{"reviews":[{"author":"Not found","date":"Reviewed in the United States on June 28, 2019","id":"amzn1.account.AGAJY4R5X55WEIIHNLHT75GEIEAA","link":"https://www.amazon.com/gp/profile/amzn1.account.AGAJY4R5X55WEIIHNLHT75GEIEAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    This ECHO PLUS product arrived with issues.  The voice activation worked when it wanted to, and seldom beyond 15 feet away. I missed the 30 day window to return for full refund.  I though that Amazon would kick out a software update and it would be working fine.  That never occurred.  48 days after purchase, I finally decided that I had enough, and requested help from Amazon Customer Service.  They wanted me to mess with my router and changed the channel  to 1 or 16.  They tried to blame it on everything except the device.  After much back and forth, they agreed to send a replacement.  The replaced was cosmetically unpleasant (damages - nicks and discoloration everywhere).  I contacted customer service and told them this was unacceptable.  They wanted to send out another refurbished product with the only guarantee that it will work (nothing about cosmetically sound).  It's too late to get my money back now, but I will change the wake word to something I never use and just use it as a bluetooth speaker.  As far as the sound quality goes, it is acceptable as Radio Quality sound.  There is a severe lack of bass without the subwoofer and a second Echo Plus.  If you want the best sound look elsewhere - Bose, Sonos, HomePod, maybe.  I think the HomePod is better quality (and cheaper price) than 2 Echo Plus 2nd Gen with Subwoofer.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Save your money. Don't buy this garbage.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on February 12, 2019","id":"amzn1.account.AHRWOAGJ5ZRJMF6SKLLY6OAO2AWA","link":"https://www.amazon.com/gp/profile/amzn1.account.AHRWOAGJ5ZRJMF6SKLLY6OAO2AWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    Pro bundle with Sub OverviewPro: Quality Built, Quality Sound, Functionality, Small form factor, Volume (low and high), Perfect amount of BaseCons: Connecting all three to act like a system is finicky and dosen't work when you set it as an alarm.  Only will play off one so you miss out on some of the rich sound when waking up.  But a plus since it isn't as loud.Long Review:I have to say these are amazing.  I have had a lot of amazon products and these surprised me the moment I started them up.  First off these get loud for their size and the audio clarity is amazing.  They are crisp, clear and sound amazing.  Now if you like heavy heavy base then these aren't the speakers for you.  I bought the package with 2 speakers and the sub and they are perfect for me.  The base is well controlled and gives the sound that is lacking in many speakers but if you want the base to shake the walls and make it sound like a floor speaker with a 12 inch amplified drum then don't try.  But if you are looking for a clean, rich, bold and sophisticated listening experience then these are amazing.  Much better than anything I have tried in the $350 price point.If you want something that is loud, base heavy with good high and mid tones better than this then look at spending 700 or more.  I listen to everything from classical music to EDM, Rock, rap, pop, country, jazz and folk and these just keep impressing me.  The vocals aren't drowned out and you can hear all the instruments and the base fills in the lows at the perfect listening experience.Summary:  If you are looking for rich, deep, bold music this is the set for you.  Better than anything in the 350 to 450 market.  (I have tried 20 in this market) If you are looking for wall pounding, rave quality base then you better live on your own or in a frat house cause more than this you will need a floor speaker with amplifier and thick walls.  PS I own a full amplified speaker set housed in my living room for when I was in college and a fraternity.  Nothing against them but horrible for all day listening and having friends over to talk and not drink all day hahaNote: I have both echos and the sub in my bedroom and the room is too small for all 3.  I barley raise the volume past level 3, maybe 4 if I am listening to them in the shower.  I moved them to my living room for the pre and post Superbowl party and they filled a medium 4 bedroom 3 bath house with crystal clear music.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Quality Sound\n  \n"},{"author":"Not found","date":"Reviewed in the United States on January 17, 2019","id":"amzn1.account.AEZ3Y2WTH2M4CU52KVNAYGZTWO5A","link":"https://www.amazon.com/gp/profile/amzn1.account.AEZ3Y2WTH2M4CU52KVNAYGZTWO5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    Don't waste your F&$#ing money on these pieces of $hi$.  They never respond and the software is a comical sideshow.  Amazon claims they are the future and they are not.  They can't pickup your voice an inch away or a mile away.  Stop being lazy and take back control of your home.  Because when you need them to work they won't.  They get progressively worse and are a complete waste of money.  Don't do it!\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    F&#$ Amazon and F&%$ Alexa\n  \n"},{"author":"Not found","date":"Reviewed in the United States on October 15, 2018","id":"amzn1.account.AGXRY64ZWW6Y2K5XD44EW52TRHKA","link":"https://www.amazon.com/gp/profile/amzn1.account.AGXRY64ZWW6Y2K5XD44EW52TRHKA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":4,"text":"\n\n\n\n\n\n\n\n  \n  \n    to no surprise, the sleep timer doesn't work on this like the 2nd gen echo. I've been back and forth trying to get it fixed but it's something the devs have to fix and it's clear it'll take some time.however, the speaker quality is amazing on this. I watched a few shows and it sounded like I was in a movie theater. there is a super slight delay though (I'm using the line in feature, something new I believe - super useful, should have always been a feature).one last thing I find useful is the room temperature feature. I dunno if this was in the first echo plus, but it's nice to have.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    very nice with a couple small issues\n  \n"},{"author":"Not found","date":"Reviewed in the United States on June 21, 2019","id":"amzn1.account.AFD5SGJTTBYG5VYUBK6VCVV5M7EQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AFD5SGJTTBYG5VYUBK6VCVV5M7EQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    I think it's kind of important information  that this is NOT a standalone item that pairs directly to your WiFi. It requires you to load an Amazon Alexa app on your PC and your PC to operate in WIFI. Well my PC operates on either but not both simultaneously. Because I watch video and game WiFi is a poor cousin to a wired connection. I returned it. I did not want the app installed on my PC and did not want to be running an inferior WIFI connection. I felt that this is the FIRST piece of information they should give. Some people might not care that they are forced to halve Alexa on their phone. I don't want it. It was supposed to be a standalone item but is really just a voice recognition outlet for an app running on another device. FAIL Returned\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    You need your PC to download Alexa and to run on wifi, or to install app on phone\n  \n"},{"author":"Not found","date":"Reviewed in the United States on November 29, 2018","id":"amzn1.account.AEGOGHH2EXQPNZBH37SDZ7BSDMSQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AEGOGHH2EXQPNZBH37SDZ7BSDMSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    I currently own a 1st gen echo, a 1st gen dot, multiple 2nd gen dots, a Fire TV Cube, and now this. I bought an Echo 2nd gen when they came out. Received it, and was extremely disappointed with the sound quality. I returned it within 2 hours of setting it up.The Echo Plus 2nd gen blows the previous units away. I get crisp, clear sound with plenty of bass. The volume is great, and the mic array is fantastic (I admit, the mics were great in the 2nd gens too). She hears me from all over the first floor where the unit is centrally located, and sometimes from the second floor. No need to shout, the mics are sensitive enough. I can also play music on the max setting, say \"Alexa\" in a regular tone (I can't even hear myself say it), and she'll pick it right up.Our 1st gen Echo was getting a bit hard of hearing and was retired to the basement. She still plays great sound though. The 2nd gen mic array and enhanced stereo was a great upgrade.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Much better than Echo 2nd gen\n  \n"},{"author":"Not found","date":"Reviewed in the United States on August 23, 2019","id":"amzn1.account.AGE7J4OTMTGJNM6KQ4GUZGCJ5FLA","link":"https://www.amazon.com/gp/profile/amzn1.account.AGE7J4OTMTGJNM6KQ4GUZGCJ5FLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    I have 2 first generation Echo's and 2 second generation Echo's.  I have always thought for the size and its purpose, these were great to listen to, especially if you paired two together.  I recently bought an Echo Plus for my Mom and did a double-take when I got it up and running and playing a little Red Hot Chili Peppers .  I also have a Sonos and I'm going to say this is as good if not better.  Why... because I don't have to deal with the fickleness of Sonos, its annoying at times and for anyone thinking I don't know how to set it up correctly, I have over 60 devices paired (Hue lights, Sonos, Smart Plugs, Wemo, and more).  So yeah, the only one that always has issues is Sonos.  This Echo Plus sounds so good, I'm thinking of replacing my other 3 Echo's.  Its also incredibly responsive,  more so then the one I replaced it with.  I especially like that when I have the music turned up, it still hears the wake word.  As for my Mom, I have a few lights set up, probably more in the future, what I liked was telling Alexa to \"find my devices\" and it was done in a few seconds.  My mom thinks its \"magic\" and how did you do that....heh!  I would highly recommend the Plus for the excellent sound quality, even if you don't need the hub.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Impressive sound\n  \n"},{"author":"Not found","date":"Reviewed in the United States on October 17, 2018","id":"amzn1.account.AFEBZEABT374YF5AQBZXCXZMVDUA","link":"https://www.amazon.com/gp/profile/amzn1.account.AFEBZEABT374YF5AQBZXCXZMVDUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    I thought it would be hard to improve the sound from my first Echo in such a compact unit, but they accomplished that in this Echo plus. I have used the built in hub yet, because I mainly use it for music when I'm cooking. But I'm sure I'll eventually venture into the Alexa controlled gadgets before long. I'm completely satisfied so far and I don't expect that to change. If you're even thinking about buying one, go ahead and do it, you won't regret it. Thank you guys and God bless.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Surprisingly better sound than my first Echo.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on January 23, 2019","id":"amzn1.account.AEGRLJF26U3MKQA3MVQFLWEDN2WA","link":"https://www.amazon.com/gp/profile/amzn1.account.AEGRLJF26U3MKQA3MVQFLWEDN2WA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":2,"text":"\n\n\n\n\n\n\n\n  \n  \n    Setup:Two Echo Pluses (2nd gen) placed 2.5m apart on a dresser (in the same room) with an Echo Subwoofer on the floor to the left of the dresser.The two echo's often get confused and stop would as a single unit would.  If you say \"Alexa, do this\", sometimes the first Alexa replies and sometimes the second does.  The problem is that they do not necessarily realize that one has already replied.  If Echo one asks a question, sometimes Echo two hears the reply instead of Echo one causing Echo one to get stuck in a loop.Sometimes the two echos break stereo sync and require HW power cycle to get it together.  One of the echo may lose the ability to \"Understand\" when in this state (this is NOT a wireless signal issue).If you set a timer on these Echos, Echo one may set the timer and Echo two may then answer all other queries.  Echo two is not aware of timer on Echo one.  As such, Echo two cannot list, stop, or reset timers on Echo one even though they are \"one unit\".  A master/slave situation should exist when Echos are setup in stereo pairs (they are ONE unit).  Turning mute on one of the Echos helps, but the mute light is distracting and annoying.In short, the sound quality gained by the stereo pair does not warrant the extreme annoyance of the buggy interaction when two Echos are placed 2.5m apart in the same room.Amazon seriously needs to work on better detection code to determine which Echo I am talking to in a multi-Echo home setup.  Their implementation is horrid in close proximity (as above) and bad in simple multi-room use cases.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Review of Double Echo/Subwoofer Setup\n  \n"},{"author":"Not found","date":"Reviewed in the United States on February 22, 2019","id":"amzn1.account.AHXCP7QZXE74732B6OA7RL46H7PQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AHXCP7QZXE74732B6OA7RL46H7PQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":3,"text":"\n\n\n\n\n\n\n\n  \n  \n    Good sound, easy to set up, attractive/subdued hardware, cloud based AI works well for us, needs better client firmware, admin software apps.More details on our cons, as the pros have been covered by many other reviews.- cannot be set up from ethernet connected PC, requires either mobile app or wifi PC- whisper mode is cool, but rarely works - the volume between \"too soft - can't hear me\" and \"not a whisper - use normal volume\" makes it very hard to get the whisper reply- bummed that the smart home connectivity for Hue bulbs is limited to so few capabilities compared to a dedicated Hue hubWe have had several Echos over the years, and this is a replacement for an older generation, and I hope this one avoids the problems we have had with those, because they are now essentially paperweights:- a recent firmware update (sometime in the last 3 months) killed the ability to connect with our router's 5GHz or 2.4GHz wifi, either as an existing, new, or factory reset new device. We had two identical ones, both replaced by these. One went to the garage where it was rarely used, noticed it was not connected about 2 weeks ago, but figured it just needed a reboot; however rebooting it didn't reconnect it. I hadn't used it in a while, figured maybe it died from the cold or something. The second was in storage in the house, so I got it out to use instead, and it powered up and connected to wifi fine - I checked weather, etc. to verify it was ok. I left it alone a few hours, it got an update and restarted, and was then in the same boat as the other one - no wifi connection can be made with any combo of settings I can try, but it does connect to the Android app via the Amazon wifi step of setup, so the hardware seems fine. All our newer Echos - Echo Plus, Echo Sub, Echo Show, Echo Show 2, work fine with the same settings.- the Android Alexa app pops up an error message when wifi connectivity fails during setup, which covers the first two input fields on the page (network name and password) and can't be dismissed, making it difficult to edit the form without killing the app- the Android Alexa app flips the phone from standard WiFi to a peer-to-peer Amazon Wi-Fi with the  Echo during setup, and killing setup or failing setup leaves the phone unconnected to the internet unless you go back and reselect your normal WiFi network in Android settings- support was free, but very slow (3+ minutes to type each response, I think they were in multiple simultaneous chats), and ineffective - they just followed the flowchart, ignoring what I told them I had already done, and asking the same questions over and over; the only new thing they had me try was the factory reset paperclip button, but it made no difference.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Hope it lasts\n  \n"}],"title":"Echo Plus (2nd Gen) with Philips Hue Bulb - Alexa smart home starter kit - Heather Gray"}