{
    "reviews": [
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 16, 2018",
            "id": "amzn1.account.AHHNN3FQ6XPWBUDC5EVIMK5ZESXA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHHNN3FQ6XPWBUDC5EVIMK5ZESXA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I want to start off by saying that I love Amazon as a company, so this isn't a hate review on Amazon. BUT, I do feel deceived by amazon on this.The Echo Plus does have a \"smart hub\" that uses Zigbee to connect to various smart home devices. HOWEVER, the Echo Plus can only utilize the PHILLIPS HUE system in a limited capacity. In order to get full use out of the HUE bulbs, you still have to buy the HUE BRIDGE.What you can do with the Echo Plus alone:1. Voice Control the lights.2. Change the color of the lights by voice, BUT you are limited to about 20 colors instead of the \"16 million colors\" that the HUE bulbs are capable of.3. You can set routines and groups, which is nice.What you CANT do without the HUE Bridge:1. Compatibility with many more sensors2. The ability to automate and set scenes3. get system updates over the air and future features.4. Have your lights sync with music5. Probably more, but I can't remember.Also, if you change devices, or switch to a HUE hub, odds are you will have to redo all of your lights.What bothers me more than anything is that the product page for the Echo Plus CLEARLY states compatibility with the HUE system, and even use the HUE APP logo as shown in the picture. That's great, except that you MUST have a HUE BRIDGE to use the app, which is another $50-60 on top of the already expensive investment of the bulbs.CraigI would like to see Amazon clarify that the HUE BRIDGE is necessary for the full HUE system, but I doubt it will happen. Alternatively, I would to see them bundle the Echo Plus and HUE together so that you can get the full system right out of the box.Hope this helps,Craig M\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    BUYER BEWARE if you plan to buy this for the PHILLIPS HUE SYSTEM.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 16, 2018",
            "id": "amzn1.account.AGDSZMBAOZVBPDG3BNKMLA2I5XDA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDSZMBAOZVBPDG3BNKMLA2I5XDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Short & Sweet - For what it is, this device is amazing. Performance is quick, audio is great, and the built-in Zigbee hub works quite well.Longer Review;After dragging my heels for over a year, I finally bought our first Echo (2nd Generation) back in August. I loved it so much that I got us 2 more for other areas in the house. Being able to group them and play the same music or audio throughout the house is a novelty that won't grow old for me. I've only wished that they had a little more full sound, especially at higher volume. I'd considered the last Echo Plus, but the average of reviews I read didn't make it appear to perform significantly better than our already great 2nd Generation Echos.When I saw this new Echo Plus listed, I pre-ordered it to \"replace\" the Heather Grey Echo in our kitchen and move that one to our bedroom. We tend to have music playing in the kitchen more than any other room, and I wanted slightly better sound than the regular Echo in there. I'm honestly glad we took a chance on this device without any reviews to go by.Appearance;As you can see in the photos, it's pretty much identical in height to the 2nd Generation Echo. It is a bit wider to accommodate the larger speakers, and the top is slightly domed instead of being flat. A similar 7-microphone array is on top and they seem to work just as well. There also appears to be a tripod-style connector on the base of the unit.Setup;Setup was surprisingly easy as this Echo Plus detected our network settings on its own. I plugged it in, it did its initial startup, and then told me the device was connected. Simple as that.Audio compared to 2nd Generation Echo;Highs are clearer.Mids are more natural and better-defined.Lows are deeper.Overall volume is noticeably louder and sound quality is improved.When paired with our other Echos, music and audio is in sync everywhere and this device stands out above the others in audio performance.General Performance;We have a quick network and I don't notice any perceivable performance difference between this new Echo Plus and our regular 2nd Generation Echos. Everything seems to work as it should.I bought this with the \"free\" Philips Hue bulb promotion. This bulb is our first Zigbee device and works very well with the Echo Plus. It is easily controlled by either the Echo Plus or the other Echos we have in the house. I'll be keeping an eye out for deals on these bulbs in the future. Like our other Echos, it also has no problem controlling our Kasa Smart Plugs.Overall;While $150 is a lot for a single speaker, for what I was looking for, this thing excels. If you like the 2nd Generation Echo but hoped it sounded a bit better, I would highly recommend this. Based on what I've read, if you were disappointed with the audio performance with the 1st Generation Echo Plus but want everything else it had to offer, consider giving this wonderful speaker a try.P.S.: The internal ambient temperature sensor seems fairly accurate and nice to have included.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great Device with Impressive Audio\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 15, 2018",
            "id": "amzn1.account.AHN3TQQZOM3WQXNIMAKFEYCKJG2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHN3TQQZOM3WQXNIMAKFEYCKJG2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I jumped on the Echo bandwagon as soon as the original was released a few years ago.  Loved it.  When the Echo Plus with Built in Hub was released in 2017 … Nice.  The hub gave me the luxury of controlling my garage door after buying Nexx Garage.  With these two Echo's - I also purchased the Amazon Voice Remote because the Echos did not have much range for \"listening\" around corners and from different rooms.  The Voice Remote was essential, but solved the issue.  I also added an Echo Dot in an obscure corner of the house for better Alexa coverage.When the Echo Plus with ZigBee (2nd Generation) was released in October 2018 … I stressed over whether I should take the plunge and add another.  Would it be \"that\" much better?  I DID buy it and I am soooooooo glad about my decision.PROS:  #1 - Pairing accessories with this latest version is easy and intuitive.  Everything works flawlessly.  My previous two Echos had me ranting in frustration when trying to add a smart home device. And most ended up being returned out of failure to pair.  #2 - The internal microphone is so finely tuned - I can call out commands from other rooms and even outside the house (when the windows are open) and Alexa responds perfectly.  #3 - THE SPEAKERS.  Oh the sound is phenomenol !!  Yet - I was going to call Amazon support because there was a \"rattle\" sound frequently from the speakers/unit when playing music.  I went next to the unit to record the \"rattle\" so I could play it for the tech rep when I called.  It was them that I realized the speakers were so dynamic - they were rattling my fine glassware that was in close proximity to the Echo.  Once the glassware was moved - the speakers are sensational and flawless.  I play Spotify all the time now.  It sounds wonderful on the new Echo !!!This 2nd Generation Echo is worth every penny and then some.  I now have my entire house paired with receptacles, light bulbs, my garage door opener and a Phillips Color Hue bulb.  Pairing and grouping everything was absolutely simple !!!  There is never a glitch in operating the accessories.  AND best of all - I know what I will be buying for family holiday gifts.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    If You Are Undecided .. Dont Be ... BUY THIS ECHO\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 28, 2018",
            "id": "amzn1.account.AGKXT256UQH7TIPJEDQ2UB3FFNEA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGKXT256UQH7TIPJEDQ2UB3FFNEA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These were on sale for Black Friday/ cyber Monday. I didn’t see the point in having a robot listen to mine and my family’s every word. I read reviews and my boyfriend and I laughed at people saying they have 7 or 22 of these around their home, “what weirdos” “how lonely do you have to be?!”. I thought you just ask questions and she replies. How stupid.... WELL we love this. We purchased this one and a 3rd generation dot (one for the living room and one for the kitchen) I ordered the 2nd generation for as a grab bag gift for Christmas because everyone almost passed out last year when they saw that this dot was in a pool of gifts. We’re keeping all three. Living room, bedroom and kitchen, we even bought the light bulbs that Alexa can turn on. This thing can make grocery lists and it’s automatically on mine and my boyfriends phone (love love love this shopping list feature!!). We can talk to each other from one room to the next, my boyfriend keeps playing the worst music from the bedroom into the living room while I’m cleaning just to get a laugh. This is a nifty thing and we love them. If the government is listening to our every word, we’re going to get our own reality show. AND if these things start speaking on their own, I’m throwing them out the window and will update my review. But for now we really dig them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Surprised\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 18, 2018",
            "id": "amzn1.account.AHS6VKR4C5W436YOGPTOC4EREC7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHS6VKR4C5W436YOGPTOC4EREC7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I was quite excited that Amazon had caught up to Sonos and Google and finally allowed stereo pairing of speakers. It’s amazing how much better two properly spaced speakers can sound, even without a sub. Unfortunately, Amazon decided to release this product without full feature parity of it’s competitors.As other reviews have mentioned, the stereo configuration ONLY works when streaming music from an online service. If you’re internet is out, or you want to take the speakers somewhere where no internet is available, you can only play from a single speaker at a time. That means local connection methods, like bluetooth and the 3.5mm aux in don’t play on a stereo pair (like they do with Google Home).I am really hoping this is a software kink that is quickly being worked out, and if support is added I’ll update this review. For now, I’m quite disappointed that I purchased a stereo pair of speakers and sub when half the time I only hear sound out of ONE of the three devices.Do yourself a favor and get a Google Home, Sonos, or if you don’t mind wires and want Alexa, get a Klipsch ProMedia 2.1 with an Echo Dot— much better stereo sound, lower price, and more functionality.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Extremely limited compared to Google Home stereo pairing\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 25, 2018",
            "id": "amzn1.account.AGE3GCLHHRQZRFGOS4CDRLJFXDHA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGE3GCLHHRQZRFGOS4CDRLJFXDHA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought the combo deal, two echos and subwoofer.It was a Nightmare to have them connected as stereo output. Had to delete and reassign them a couple of times for it to work.Sound quality is ok on the echosWhat you expect from them. The subwoofer really does make a difference to your music.Now here is my real issue. It only allows you to play stereo music through amazon music app or if you tell alexa. Which is unnaceptable because their apo is garbage and laggy. Sometimes it plays stereo and sometimes it only plays it through one echo and no subwoofer.Cant stream from another source or just connect your phone to the stereo source which I hope they fix in an uodate.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    No Bluetooth Stream\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 19, 2018",
            "id": "amzn1.account.AEPCYGY7HJMZQZEBPWAXBVZD6MRA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEPCYGY7HJMZQZEBPWAXBVZD6MRA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really like the sound on these two speakers combined. I have a Bose, which always outperformed other small sound systems for me, but the Echo 2nd Gen--although individually not quite as good soundwise as Bose--sounds just as good when the two speakers are paired, and along with the subwoofer slightly outperform the Bose. The trebles are clear and the bass isn't overwhelming, but it's a good solid sound and feel. There's a good balance between treble and bass and you can ask Alexa to decrease or increase both. The volume level can also get extremely loud, which I found has been lacking in most speakers this size. The setup can be a little glitchy with the Alexa app, which seems buggy and is not that user friendly when it comes to setting up and pairing, but even I, who is no tech wiz, was able to figure it out and finally pair everything up. I've tried so many  small speakers like this and have always been disappointed, so I'm glad I finally found some that live up to my expectations. Super happy I bought these. I'll definitely be keeping them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Satisfying sound when paired, loud volume\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 28, 2018",
            "id": "amzn1.account.AHO5DZXKX5MNQFQ76YOCD2B2XXDQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHO5DZXKX5MNQFQ76YOCD2B2XXDQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I Followed directions to get Hue bulb to connect. It came with the Echo and the directions say: To set up your free bulb, plug in and set up your Echo Plus, plug in your bulb, and ask, “Alexa, discover my devices.\" All I get is \"no devices found\" even when turning on skill in the app. I have a hue account set up and logged in. If you try to join the Hue app itself it said \"no bridge found\". I asked Alexa  \"is Hub turned on\" and get no answer. I ask to \"turn Hub on\" same thing. I went and bought another HUE bulb and it does not work either. I bought this for THE HUB, but it does not seem to work. I'm sending back. On a side note most new home automation devices are WIFI now and do not need a hub. I just wanted to connect my older devices without an external hub.I like the idea, but if I would make one of these I would have made a hub that worked and would have included Z-wave in the hub as well.I'm sending back and ordering the ECHO without the hub. I also ordered a samsung gen 3 HUB to go with it and all will be good.I do think the ECHO with the better speaker design is a great Alexa device. I love Alexa and everything the dot and Echo do, I just think the Built it hub didn't work out for them so well.ADDITIONAL INFO: We even tried to connect our front door lock that was Zigbee and it would not connect in pairing mode. Tried several times and no luck. I think the HUB on the device I bought must be defective.I have been working with home automation since the first generation and are very familiar with programming. We also set up out own alarm system and camera system with automation and garage door control.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    CANNOT GET ZIGBEE HUB TO WORK\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 25, 2018",
            "id": "amzn1.account.AEX7GUEA4ZQV5H3RWPKTGCBNGJMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEX7GUEA4ZQV5H3RWPKTGCBNGJMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought the new echo plus during the black Friday sale this weekend to make use of the Line In feature which I was disappointed that my second generation echo I purchased last year didnt have. I was so excited to see that this changed this year with the new generation... EXCEPT it doest work!! The alexa software that you need to configure it as a \"line in\" and not a \"line out\" doesnt function, and according to the tech that assisted me, this has been a common problem with the device. I bought it for this reason, as advertised by amazon, and it doest work. The options I were given by the tech was essentially to wait and hope it gets fixed in the future, return it and lose out on the black friday deal if it is fixed in the future and wanted to buy it again at that time once it is, or wait and waste $109 dollars if it isnt fixed in the future once I pass the return window. All for an issue that is 100% AMAZON'S FAULT!! FALSE ADVERTISING and HORRIBLE CUSTOMER SERVICE like I have never experience before from amazon from a problem THEY inflicted and CAN remedy if they choose too! I asked for an extended return window, if they can honor the black friday price if I was to return it and buy it again in the future, and a refund/discount on the product due to it essentially being defective for my purposes, and each request was flat out REJECTED. When I asked to speak to someone else, that wasNOT PERMITTED either. SHAME ON YOU AMAZON, SHAME!!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY IF YOU ARE INTERESTED IN THE \"LINE IN\" FEATURE\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 29, 2018",
            "id": "amzn1.account.AEMWNSUZRTUA7EHAPZQYIZASU25Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEMWNSUZRTUA7EHAPZQYIZASU25Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I had been using a 2nd generation Dot in conjunction with an older Bose Bluetooth speaker which my spouse would run off with periodically, so when Amazon offered a good trade-in discount (and the Bose was missing again), I took advantage and ordered the sandstone speaker. I guess I was prepared to be disappointed in sound compared to the Bose, but this sounds great! Can’t really notice a difference! It’s nice not to have to separately turn the Bose on (how lazy is that?). It works great with the free Hue bulb,  though I had to power the bulb off and on again to put it into pairing mode, apparently, because the Echo couldn’t find it at first. I feel it’s a good value and I’m really happy with the purchase.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Exceeded my expectations\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 18, 2018",
            "id": "amzn1.account.AFW2M4LQUC5SAEYYQTGDX5KNSB7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFW2M4LQUC5SAEYYQTGDX5KNSB7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Not that the sound of the \"old\" 1st Gen Echo was bad, but the 2nd Gen is noticeably better. Deep, richer and perhaps even louder than the old. I did like the old volume control (turning the top of the device) as opposed to buttons (so 1990s), but since I rarely use that function, I can live with it. The only down I can think of is the \"smart home hub.\" I don't know what it is, how to use it, whether it can replace the ones I already own, or where to find information about it. I posted a question pre-sale, but never got a response. Maybe no one know, or perhaps it is not ready for prime time.BTW, I \"traded in\" the old one for a credit and it was worth the investment just because the sound is superior.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Nice sound\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 15, 2018",
            "id": "amzn1.account.AEZ6LVNAUY5VHFYCQEHP4TQ7VIAA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZ6LVNAUY5VHFYCQEHP4TQ7VIAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I purchased Alexa Plus (gen 1) the day it came out and now this (gen 2) Plus Hub.  I'll not rehash that experience so Amazon will not call me again.  OK if you don't have one of these Hubs they are cool and I like over Wink, GE and Hue.  Hue hub I gave away but still use Wink for Zwave and Stanley locks.  I run all the switches and WiFi off Alexa/Echo hub.  Now I have Alexa both gen 1 and 2 hubs running.  Good news this one just sync's-up and no issues so far.  So why did I purchase this well for temperature sensor and most important stand alone automation when WEB is down. Temperature works great if you wish to know as she runs 1.5 to 5 degrees hotter then the room when in use especially if you are enjoying the my opinion improves sound quality. So great if you want to take her temp but a word of caution if you are running heating/cooling automation off her reading alone.  As for standalone light controller when internet is out also, guess that is some enhancement as I couldn't get it to work just got the typical RED ring.  Why 4 stars, 1 because it is cool, 2 because it works kind-of, 3 because I purchased it after know what gen 1 was like out of the box and 4 so Amazon won't call asking me about my review.  Really is a fun great product nice new Android App update is what I use as the main driver for home automation after giving up circa 1978 X10/BSR system till a few years ago. Why not 5 stars?  I'll save that for when the product reaches the hype. I purchased not for what it can't do now but what it can do in the future. Except for new looks I have experienced nothing to praise over the older hub so far.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    She runs a tempertauture.  ?Local hub finction?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 6, 2018",
            "id": "amzn1.account.AHXOBXLV57OH3XMTYP2JV6TKUACQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHXOBXLV57OH3XMTYP2JV6TKUACQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    OK, so generally I like the Echo Plus.  However, there are several things I don't care for so much:First, the \"Line In\" feature doesn't work.  I've contacted Amazon support and they've said a fix is on the way, but I don't have an ETA on that so for now I'm only giving this one star.  This is because the primary reason I purchased this device over others was the fact that it offered a Line In feature, which my wife wanted to be able to use our old iPod to connect it to the speaker.  This is a pretty big defect, especially when it is advertised as a distinguishing feature.Second, getting Alexa to recognize requests for specific albums is difficult.  The phrasing has to be precise, otherwise she'll respond that she can't find the requested album and proceed to suggest something \"similar\".  This wouldn't be so bad except usually I don't want to listen to something \"similar\" and I'm not so sure the suggestions are always good.  This problem isn't so much unique to Alexa as I have similar issues with my google home, but google seems to be more responsive.  I just don't like having to talk over Alexa to get her to stop talking so I can move on.  I also find Alexa to be a bit more cold than my google home assistant, perhaps a little more robotic.I do like that the Echo Plus seems more responsive to my voice compared to the Google Home.  Perhaps the mic is better in the Echo Plus than the Google Home.Sound quality is OK and is comparable to the Google Home.The \"smart\" light bulb that comes with the Echo Plus is only \"OK\".  It was easy to set up, but I was disappointed that it couldn't do anything more than turn on/off and dim (I was kind of hoping for the ability to change colors).  It also took me a bit of time to find a use for the bulb.  Needless to say the use cases for a \"smart\" light bulb seem limited.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Line In feature doesn't work\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 16, 2018",
            "id": "amzn1.account.AE63PJN4FSTQY2NAXTCWITPKMICA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE63PJN4FSTQY2NAXTCWITPKMICA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Yikes. Alexa constantly says she's unable to do that task at the moment when I'm telling it to set an alarm or play music etc. Its mic really needs help as well as I often have to yell at it while only 10 feet away in a low noise area. Good luck finding information out, it cant find Jack. The speaker is average and would be acceptable if the other features worked close to flawlessly. Here's the thing. Its had how many years to make this product better? It seems just like gen one echo.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    What a disaster\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 16, 2018",
            "id": "amzn1.account.AGFOM6NXCPA25D566JA74GGNKO7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGFOM6NXCPA25D566JA74GGNKO7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I love Alexa! I’m glad I did my research and decided to go with the Echo Plus. Has the built in hub and within minutes of turning it on for the first time our house turned into a smart house. Set up for light bulbs and outlets was a breeze. Alexa reminds us and helps us with all sorts of stuff! The App is so easy to use too.  So many things we are doing with it now and every day we find new ways to have her help out! I love this and now have dots in just about every major living space in the house and the Echo Plus in the kitchen.The intercom feature is great for my teen who loves to shut her door and listen to music on the end of the house. I highly recommend the Echo Plus. Sound quality is perfection as well!!Bonus: My five year old was not listening to me before the bus one morning. Instead of getting upset, I decided to set a reminder for 1 minute. One minute later Alexa came on and said she should put on her jacket and boots like your mom said or she will notify Santa that she was not being a good listener. I have never seen her move so fast in my life!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love! Love! Love!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 26, 2018",
            "id": "amzn1.account.AFW2NN3ELPCRVWI7PEB4UR4TPZ7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFW2NN3ELPCRVWI7PEB4UR4TPZ7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I've read a number of reviews regarding the lack of Bluetooth capability, and how that takes away from enjoying iTunes and other stored content users have on their computers/smart devices.  Also not able to use these for smart TVs either.  So basically these are glorified devices for playing online content.  I don't get why they would roll these out without those features.  The Echo Plus stereo pair and sub  I ordered are scheduled to arrive tomorrow, but in light of that glaring omission, I will return them and just wait for the 3rd Gen and hopefully they will be blue tooth/smart tv compatible.  Sadly, they will probably be rather costly for the addition of features they should have included in the first place.  Mia culpa as I should have looked at these reviews before I ordered them.  I will be happy to change my review when they fix this issue.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Back to the drawing board/Not ready for prime time\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 15, 2018",
            "id": "amzn1.account.AEUGVGQLTAEOAD2BRCABJ6FMKN5Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEUGVGQLTAEOAD2BRCABJ6FMKN5Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really wanted to love this Echo. But it has far too many bugs to be worth it anymore. It started just a few days after I received it. I had to do a factory reset because it got stuck on a notification that it couldn't play because it had disconnected from the internet, then it got stuck on a red ring immediately after. I had to delete everything I had worked to set up just a few days before in order to do the factory reset. It was working fine for a few weeks after that, then today it stopped playing my Spotify music, I had to relink my spotify premium account and reconnect the echo plus to the internet via set up mode, then it played spotify but could not access my playlists. When I asked \"Alexa, play my *name* playlist on spotify\" it would play a random playlist on spotify by the same name. Now is has unlinked from my spotify again, even though in the Alexa app it says I'm linked and good to go. I have given up.30% of the time it will misunderstand me or not hear me at all, and I speak loud and clear in anticipation of it not hearing me correctly and it is in the center of the room so the microphones aren't blocked. I have overlooked most of these little bugs and brushed it off as this relatively new tech still finding its feet, but today's spotify fiasco was the last straw for me. It can still play NPR without a problem and is good at giving me generic information like the weather and time. Other than that, not worth the money I spent on it. It is now just a glorified radio in my living room. I’m giving it 3 stars because of what I can get it to do, it does very well. There are just too many bugs.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Too Buggy to Be Useful\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 7, 2018",
            "id": "amzn1.account.AELZX6HL7QPWEBQLKJ3NOKLEU53Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AELZX6HL7QPWEBQLKJ3NOKLEU53Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    no connectivity with iTunes\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    not functional for my needs\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 17, 2018",
            "id": "amzn1.account.AFAO344YR5VW7SAQSO5MGOLEZEDA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFAO344YR5VW7SAQSO5MGOLEZEDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I’m amazed with the speaker quality, improved bass and more louder. Loved it\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Value for money amazing product\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 15, 2018",
            "id": "amzn1.account.AGFPQCUEVTD3AFRO4O3ZV3BQQE6Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGFPQCUEVTD3AFRO4O3ZV3BQQE6Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I am a huge fan of the Echo. I have the tap, the dot, the standard Echo and an Echo smart speaker, and now the plus.This one is definitely a step up. The best sound and response of all the previous models.In a nut shellThe dot is ok. Limited quality sound but small and unobtrusive. Nice for  a bedside alarm, weather information and morning news while shaving.The tap is the portable and battery powered option that I use in the morning. I listen to a streaming cable news show. I listen to it while in the shower, (it is not waterproof but I have a shelf far from water that it sits on), then while I shave, and I put it in the closet while getting ready and dressed. It's like a portable radio but it allows me to stream internet cable and listen to anything I want.The standard Echo and Echo with smart options is a great device. The addition of the smart features is ok. It allows you to turn on lights and fixtures, but going into a dark room and saying, \"Alexa, turn on lights!\" is not as easy as flipping a switch. It is ok for lights that are not near the bed and your heading to sleep. But, you'll wake people up by shouting the wake up command.This one is good for two reasons:1.) The sound is great. Better than the others.2.) I got a smart switch and can use it to turn on any number of devices. The hook up was easy and flawless.Also,Alexa is adding new skills. If you use a sound machine, she has a sound maker for sleeping. Wake up to the weather, the stock market, the news, a fact from history, and a joke of the day.If you are on the cusp of buying this device, making this your first Echo would be a great choice. If you have an Echo or tap, this is a good upgrade.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Better sound, great connectivity, looks better, and turns on the lights\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 8, 2018",
            "id": "amzn1.account.AFJK5TEJ7BLVKIDQ7YNS6ZC3U2DQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFJK5TEJ7BLVKIDQ7YNS6ZC3U2DQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    i Bought the Alexa plus wrote a bad reviewSo now that I have played with it and educated myself with the help of the fantastic Amazon tec support people I can give a better review. Ok to start with if you buy smart life bulbs and can’t get them to work there are like a dozen smart life apps my best suggestion is look at the picture of the name brand and then look for that same picture on the smart life app that it matches.  Then you got the right app for that light. And if you still can’t get it to work ask amazon tec support to help you they are amazing 👍🏼👍🏼👍🏼👍🏼The Alexa plus is wonderful you don’t need Amazon music or any of that it’s built into the Alexa you just say Alexa play me some blues or play me some pop music and it will. Find out how cold or hot it is outside or the traffic she will tell you. I am now really enjoying my Alexa plus I just bough two echo dot’s on Black Friday for $20 each to put in different rooms\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Alexa plus and smart life bulbs work great together\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 29, 2018",
            "id": "amzn1.account.AFL2U5QKICL4PT2BEQXE54F5HDYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFL2U5QKICL4PT2BEQXE54F5HDYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    In the following examples, they are not stereo. Only one speaker plays.1. Connect to your phone with Bluetooth. Play a video.2. My Flash Briefing3. Ambient sounds4. Guided meditation5. Line in from a stereo source such as a Dot (sometimes.)6. Streaming music (sometimes).Paired remote stops responding once stereo sound starts. Must use voice control. At times, only volume buttons respond from remote, not pause, mic, or anything else.Sometimes, one stereo line into one of the echoes is enough to get stereo from both. Then it mutes entirely.  I pull the line from the echo plus left and reinsert it and the remote for that works again and there is sound, but only on one side.Workaround: Use the Echo Pluses as dumb speakers. (It's a shame, I know, but this is hopefully just until they get the kinks worked out.)Get a Dot. Mute mic on both Echo Pluses. Delete the stereo pairing in the Alexa app. Change Line In/Out jacks to In in the settings for each. Use a left/right breakout cable going from the Dot mini stereo jack to one cable for each Echo Plus. The remote works with the Dot at all times as it should. Stereo sounds proper in stereo test videos on YouTube via Bluetooth from the phone. (But there is an irritating lag.) News and other apps play from both speakers (even if mono).This workaround won't help to utilize the subwoofer, unfortunately.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Stereo feature needs updating\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 22, 2018",
            "id": "amzn1.account.AFCPXGQO2N2HCD6P7O2IMSU6PVHA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCPXGQO2N2HCD6P7O2IMSU6PVHA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The echo plus (2nd gen) is a fantastic device.  The sound quality is great for the price.I have both the echo plus and now the 2nd gen plus.  The first difference you will notice is sound quality.  The 2nd gen is dramatically better.  I remember getting my first plus and was disappointed with the poor sound quality.  The 2nd gen definitely addresses that.Overall the echo devices are great I control much of my house, lighting, alarm, and temperature through my echos.What I like most is that the 2nd gen removes the need to have a hub.  I actually avoided smart devices like the Phillips hue that required a hub.  Now I don’t need to avoid them.For the money this is a great device on its own.  I look forward to trying the 2nd gen with an additional plus and subwoofer.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The Plus (2nd Gen) is the Echo you are Looking for.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 23, 2018",
            "id": "amzn1.account.AFVWUL3PRIHIS37ZGJSHB7W2UDXQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFVWUL3PRIHIS37ZGJSHB7W2UDXQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Saying the device I received was buggy is an understatement. Within a few minutes, it stopped being able to respond to requests. “Sorry, something went wrong.” What went wrong? No indication from the device or in the app. “Sorry I didn’t get that.” I’m two feet in front of it, and it can’t understand yes, no, or stop. Had to unplug it to stop music playback. It seems like after a minute or two of use, it just falls apart. Meanwhile my other Echo Dots have been without any issues since day one. Looking at other comments, I’m guessing I got a dud - really disappointing considering the price.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Horribly, horribly glitchy.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 21, 2018",
            "id": "amzn1.account.AEJF6BKTU76CN5HO5CC5SZDJPPNQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEJF6BKTU76CN5HO5CC5SZDJPPNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Easy to use and sounds better then the others.However, the light ring started turning green and and would a a pulsating thing. when I looked up what the color meant I read that either I was getting an incoming call or something was eavesdropping on me. immediately put it into \"do not disturb\" and after that I never saw the light again. I have multiple Alexa devices and have never had this happen.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Interesting\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 6, 2018",
            "id": "amzn1.account.AFI2MV2E6BT4GLS6EQC5DGYYFXFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFI2MV2E6BT4GLS6EQC5DGYYFXFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This Echo does everything it professes to do, plus the sound is great.  It is a breeze to set up too.  If you have TIVo, as I do, and want it to turn the TV on or off, you have to use a smart plug, otherwise it works with TIVO to change channels without the smart plug.I do want to warn those who might have an issue with the Echo that they need help with to be aware that there is an online scam from a company called, ITS support, where they will try to sell you a repair contract for $149.99.  I Googled Alexa (instead of calling Amazon for help) and found this site that looked like it was an Amazon site.  They had me try to download the Alexa app, but the download failed each time because the website it rigged to always show a failure.  That is how they get you to purchase their product.  They tell you that you have viruses on your computer and go through quite an elaborate scheme, taking control of your computer, pretending to scan and clean up the so-called viruses.  All of that is fake. They are not really doing anything.  It only appears that way.  I had a gut feeling about this and called Amazon.  At Amazon, I was told that they would never try to sell you something to fix the issue and that they had no record of my call.  I mention this because someone in  one of the reviews stated that he was told to buy a fix for $149.99, and it seemed too coincidental.  I had to change the password to my computer and a few other things because they almost pulled the wool over my eyes.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Sound quality is fabulous\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 25, 2018",
            "id": "amzn1.account.AGDHYL2UZK3RJGND457B5RX7ZOYA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDHYL2UZK3RJGND457B5RX7ZOYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Got it last night, will give it time to flesh out. I like that it can hear me if I talk decently loud from the other side of the house (and that I can hear its response) but it does occasionally just completely flub a command by somehow hearing it as some form of \"What time is my alarm?\" or \"Set a timer\".Dropped another star. It can't even google search. Ask it any basic question that can't be found on Wikipedia and you'll get the incredibly useful \"Hm. I'm not sure.\" Useless.It boasts itself a calculator. It sucks at follow-up questions. Too slow. Faster to just take out my phone and open the app.I needed to find out how to \"fix\" my rice - it wasn't done when it should've been. Alexa responded \"No clue\". I asked again in case it just didn't hear me. \"Sure! Here's how to make rice cakes!\". Frustrated, I shouted over at my phone a bunch of profanities along with my question. Google Assistant KINDLY and ACCURATELY told me how to fix my rice. The first time. Without fail.This is a useless garbage product and I can't believe it's so popular.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Decent, but worse than Google Assistant for voice understanding\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 31, 2018",
            "id": "amzn1.account.AESWCIWLNTAZGF74BF3M5AGJGFHQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AESWCIWLNTAZGF74BF3M5AGJGFHQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n    Yo compre este echo hace un mes y lo he puesto a sonar todo tipo de musica baladas de Jose Jose, musica cubana de Orlando Contreras, Reggaeton ,Salsa de hector lavoe y la verdad todo suena demasiado bueno mi familia no puede creer que haya tanta salida en una bocina tan pequena .  LA verdad lo recomiendo .\n  \n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n    El sonido de este ECHO esta brutal!!!\n  \n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 24, 2018",
            "id": "amzn1.account.AFI3LJBRCTIOU3MSRE6XTOSIHW2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFI3LJBRCTIOU3MSRE6XTOSIHW2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I'm a bit disappointed in this 2rd Gen Echo Plus.  While my expectations weren't HIGH, for the price I was hoping that it would sound better than my 1st Gen Echo Plus.  Yes it's less tinny/bright..and a bit deeper bass, but the bass is muddy.  Not sure its really an improvement audio-wise from the 1st Gen.  I have many little DOTs and have them connected to higher-end speakers.  I was hoping that this Echo PLUS could be in my kitchen near the sink while I was doing dishes and listening to Classical. But I'm going to have to connect this one to my Mini-Bose speakers too.  Maybe it will sound better with Pop music. But I don't think I'll likely purchase any more of the Plus models and just stick with the inexpensive Dots and connect them to other speakers.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not Major Improvement Over 1st Gen\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 26, 2018",
            "id": "amzn1.account.AFLELSXTKJIIVHL7V3W455ICGHIQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFLELSXTKJIIVHL7V3W455ICGHIQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    EDIT: I changed the rating to 4 stars since Amazon was able to resolve my issue with the trade-in program. It is not 5 due to the multiple over-one-hour calls this took. Now the product itself gets 5-stars!!! We’ve been using the 2-Echo-and-1-subwoofer setup and it is the best! I HIGHLY recommend it!I have always been a fan of the Echo devices, and when I heard this Echo plus I knew I needed to upgrade my devices. Thankfully the trade-in program is available. Unfortunately, my experience was horrible. I sent in the three eligible devices I had to get their respective upgraded version using the advertised 25% discount. After the devices were received and inspected by the trade-in team, my discount was available. I placed all 3 items in my order but the discount only applied to one. I called in, thinking this was an error and I was told I needed to play 3 separate orders for each discount to be applied. I placed my first order and it worked, but the discount did not apply afterwards. I called in again, and apparently I was misled. Now I do not have my old devices and I only was able to get ONE upgraded device. If I knew this would happen, I would have sent each device individually for an upgrade. Definitely missed the mark with this trade-in program. Not cool, Amazon!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Be careful with the Echo trade-in program!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 14, 2018",
            "id": "amzn1.account.AGHRJLQ7MJHHR4QJATQPTY47TDAQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGHRJLQ7MJHHR4QJATQPTY47TDAQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Does not work. Glitches and Bluetooth sound distorted. Replacement ordered. Update. Replacement arrived today. It does not work either. Shipped in mail pouch instead of shipping box and arrived with product box severely crushed. Waiting on second replacement. Second and third replacement did not work either waiting on replacement #4. Replacement #4 doesn't work either. All have same Bluetooth issue. Update replacement #5 same problem. If you want to use this as Bluetooth speaker don't get it. 5 units all with same problem, Bluetooth distorts massively. My echo dots Bluetooth fine. Only echo plus 2 gen giving problems. Update, still not working. Distorted Bluetooth, now account showes 3 active echo pluses when I only have 1, constantly disconnects from wifi or says internet down, self deletes my smart home devices, alarms no longer work among several other problems that have been going on for months. Tech support can't seem to be able to fix issues. Waiting on replacement #6 now. Replacement #6 don't work either. Replacement #7 sent was a used unit. Now waiting on replacement #8. Don't buy echo plus 2 generation, you'll wish you hadn't. Up to 10 or 12 replacements now. Still not fixed. Now they keep trying to send used units as replacements instead of the new unit I paid for. Up to 14 replacements now. Still not fixed. 18 replacements and Bluetooth was never fixed. Tech support finally says Bluetooth just will not work with LG brand Android phones (incompatible) and they cannot fix it. Also many problems with routines and smart home functions that don't work as advertised. Complete junk!! Update, still having many problems with echo devices. Tech support is been very rude and of no help. Some of these malfunctions have been going on almost 2 years now and still not fixed. Asked for full refund but was refused a refund saying return window passed. Google home works perfectly. Alexa echo is junk and nothing but aggravation. I highly recommend  Google home instead.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Does not work. Many problems.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 8, 2018",
            "id": "amzn1.account.AFISHDD4TRGW4TR4AEPVYVSI77SA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFISHDD4TRGW4TR4AEPVYVSI77SA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have 4 of the Echo Plus's in the house and one Echo sub.  The two in the kitchen/living area are paired as a stereo.  I found that the separation between the two Echo's is a bit spotty at times when paired as a stereo.  Still trying to figure out a way to pair them both with the sub without them playing as a stereo.  I think getting the full range out of each Echo would sound better.  The sound quality gets spotty (pun intended) as you increase the volume.  Two Echo's and a sub are not a replacement for a high end sound system obviously.  But the convenience is nice being about to group areas on the different speakers/zones and have music everywhere in the house.  I do wish a equalizer was available in the Alexa app for each speaker.  I know the ability is there to achieve this with the technology that is in the Echo plus but Amazon has apparently decided not to provide that capability.  Since I have a home office my attempts to mesh Alexa and Cortana (Windows 10) have been a bit frustrating.  Although that is a skill that Alexa has -Cortana still needs work on the Microsoft end and it would be nice if Amazon and Microsoft provided a more fluid work productivity venue for the millions of us that work out of home offices.  There is good potential there but it just has not been realized yet by the developers that seem content with Alexa telling jokes.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Stereo pairing options limited.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 9, 2018",
            "id": "amzn1.account.AHBBPOA7FYKB4O5T3TMTQVRCQE7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHBBPOA7FYKB4O5T3TMTQVRCQE7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This is my first Alexa product. I was mainly looking for a smart speaker that integrated with Spotify to put in the kitchen and that didn't break the bank. The audio sounds a little muffled and adjusting the eq helps a little bit. I always feel like i'm struggling to get the volume of Alexa's voice and the music just right. In the morning she is too loud and at night when we are working in the kitchen she is too quiet. I think once the homepod integrates with spotify I will probably go that route instead.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It's not amazing but not bad.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 19, 2019",
            "id": "amzn1.account.AGUGAUMB73NEIPGYKB5RYNGOM5DA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGUGAUMB73NEIPGYKB5RYNGOM5DA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I had an original, full sized Echo in my kitchen and loved it, but the only thing I really wished it could do was support  stereo playback via two units - which it does not.  A pair of them would make for a much better overall music experience, as a single mono device just isn't ideal when it comes to enjoying music...  So, when the Echo Plus (2nd gen) arrived offering a built in stereo pairing feature/utility  via the Alexa app, I immediately jumped onto getting a set of them and traded in my original Echo.The first let down was the sound.  The original Echo simply sounded a bit better.  It could go louder, and the sound was just clearer/cleaner.  Perhaps it is the quality of the materials used in the original Echo, which just seemed more like a premium device as to fit/finish and the richer sound.  Fine I thought - but certainly having a pair of the newer units would make up for a better overall Echo experience?  Well, no, not really.  Sound wise, even paired, I feel the original Echo just sounded cleaner/clearer.  The bass was less muddy and the dynamic range was also a bit better, especially at higher volume levels.  Now I'm not talking about a night and day differences here, but still, I fully expected the Echo Plus to have evolved somewhat in the sound department... and that simply isn't the case here.So all in all, if you are looking to upgrade for improved sound, well, there isn't really any reason to jump ship.  Stick with your original Echo or explore the Sonus One speaker that has Echo support if you really want to upgrade your sound for music playback.Now, my biggest gripe about the paired Amazon Echo Plus is the fact that it is ONLY paired for music playback.  Other than that, it acts as TWO completely separate devices.  This is especially frustrating in a kitchen environment where you use timers and alarms all the time.  Example:  Ask Alexa to set a 15 minute timer.  It does, choosing whichever Echo unit heard you I guess.  Now walk around the kitchen and then call out, \"Alex, how much time left on my timer?\"...  And low and behold, the other unit hears you and responds telling you that you have no timers set!  WHAT?  With a stereo pair, you have to remember which device took your timer request and ensure that you are only speaking to it in order to get any info out of it?  Really?  How hard would it be to just have them act together in unison as one unit!?  Why not provide that as an option?  A paired set should behave and act as a single Alexa device!  They should respond in unison to commands - which they do not!  They should also know about each other timers/commands, but unfortunately they do not.  Right now, stereo pairing is NOT what I expected.  It only plays music in stereo paired setting, nothing else.  Rather than getting a nice volume boost when responding to commands, you get just a single speaker.  This is a tremendous let-down for having purchased two premium devices and wanting to use them together.  If Amazon would fix this MAJOR issue, I'd easily raise my review to 4 stars.  My original Echo was easily a 5 star device.  The newer Echo Plus (2nd Gen) is only a 3 star device if you buy 2 of them and use them as a stereo pair.  Purchased alone, I'd raise it to a 4 stars.  (-1 for the poorer sound quality compared with the original Echo).\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great, but with some issues\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 29, 2019",
            "id": "amzn1.account.AFX3O2YGMAIQKPK63I3WO5IMKSGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFX3O2YGMAIQKPK63I3WO5IMKSGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I loved this fantastic piece of home automation/personal assistant technology...for about two days. That’s when we experienced one of our, all too frequent (two - three time daily)Momentary WiFi signal service drops - from our only one choice, D- rated local internet service provider (which caused ALL our Echo devices to drop offline - and these devices do NOTHING without a WIFI signal. Zip! Moments or hours later when the same WiFi signal was restored, NOTHING we tried could get the Echos to simply reacquire that same unchanged WiFi signal. After a 40minute tech support call to Amazon none of our Echo devices was able to reconnect... and Alexa can’t do ——- without a WiFi signal. Seriously, an Apollo moon launch seemed easier than getting any one of our Echo devices back to tea quite a simple WiFi signal. After 15 minutes w tech support, we had DELETED every Echo device in our house (and deleted all our playlists, preferences and EVERYTHIG else we spent HOURS setting up. Really! I asked after the tech call went past 20 minutes with no results... Reacquiring a dropped out WiFi SHOULD be one simple voice command or button push (if the WiFi signal /credentials hasn’t changed since it was last connected). After working 45 min w tech support we still had no luck on reconnecting ANY Echo device to our lame WiFi (which can drop in and out several times a day) at which point I asked the Amazon agent  - do we have to go through this entire procedure EVERY TIME our lame WiFi signal drops out for even a second, to which she replied YES - at which point I told the agent to initiate a return for all of our Echo devices and related home automation devices. They were completely worthless to me with this one GLARING flaw. (And I had all the latest 2nd and 3rd gen High end Echo devices. No one thought to fix the huge flaw in three generations of the product line)? Well maybe I’m the only one who has WiFi that comes and goes.I love amazon and regularly place orders over $1000 a month just because it’s SO easy to do and always flawlessly fufilled...except the one MAJOR, MAJOR flaw in the whole, otherwise FANTASTIC Echo series of devices. The entire dropped WiFi signal SHOULD be fixed (provided the WiFi credentials haven’t changed) with a simple ALEXA, Reconnect to WiFi voice command or a one button push...and be back online and in business right away without the need of a 45 minute PLUS tech support call.Echo and Alexa are my favorite home Automation /personal assistant/ direct audio command to buy anything and everything from my beloved Amazon account, but this one flaw RUINED EVERYTHING. Other than that flaw I was fully investing into the whole Amazon Echo lifestyle, but unfortunately if your WiFi drops in and out your hosed and the entire investment in time and resources was for NOTHING!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fantastic, but ONE MAJOR flaw makes it worthless - to me!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 20, 2018",
            "id": "amzn1.account.AEIACJEPDC775LDKIFEZFQ6MTFKQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEIACJEPDC775LDKIFEZFQ6MTFKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I purchased this in a bundle and was happy when it finally all came in.  Yes, it did not come all together.  It paired without problems and updated itself in about 10 minutes.  The sound is rich and room filling with very little distortion.  Alexia responds and adjusts in a few seconds.  The sound is even better than the first which was good considering its limitations. This is the wilder,  louder and better sister.  LOL, I use it every day and have to say it is Awesome. If you have trouble pairing, delete the set and then recreate the set.  it works, A+  If this was helpful please indicate, I purchased this and use it daily.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Alexa hits another home run\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 25, 2018",
            "id": "amzn1.account.AH6AEY3RIFK3EVADHMOEJHI2AKOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH6AEY3RIFK3EVADHMOEJHI2AKOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    There are many bugs in the product that requires correcting, so I am happy to hear Amazon say Alexa is always learning. The Bluetooth connection breaks up when connecting to a my Macbookpro Bluetooth speaker. Invocations for Skills do not always work for some developers and Alexa does not pick up on this issue and recommends actions that is not related to the command.  When sending a command to open a radio station on one of the radio channels Alexa does not recognize the command and continuous to open to incorrect station.  Even though I send feedback to the app to indicate that it was the incorrect station, I continue to get the same results.  The system is not learning my most frequent commands.  But the sound is great, the system is practical for timing and mathematical conversions, the list function is GREAT! The biggest learning curve is understanding how Alexa pulls information and from where.  Once you learn the way to structure commands and where it should come from (i.e. Skills, Amazon Music...etc.) you can make good use of it. There were basic search engine requests given that Alexa didn't know.  This makes me wonder what search engine or data base is it pulling information from.  There shouldn't be any different between typing in the Google Search Engine and getting a result and asking Alexa a questions and getting a similar result.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The biggest learning curve is understanding how Alexa pulls information and from where.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 20, 2019",
            "id": "amzn1.account.AFUPTXG6JMBC23ADXZYBT5TOVVMA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFUPTXG6JMBC23ADXZYBT5TOVVMA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We bought 1st generation years ago and loved it, but for playing music we used our Bose Soundtouch 10. So our kitchen, dining room and bedroom had two speakers taking up space, the Echo and the Bose. Now the New Generation Echo devices with their new speakers are so very good plus so very small that we decided removed our Bose speaker from the dining room. In the kitchen and bedroom, we bought the Echo Shows which they also have great sounding speakers.  We almost bought the Sonos One with Alexa, but after comparing them side by side in a show.  We bought the Amazon Echo devices based on the equally sound and the better price. We paid $69 for the Echo, $99 for Echo Plus and not $199 for the Sonos. The Echo Shows, We paid $179 which was still cheaper than the Sonos One.  Now don’t get us started on the new Bose 500 with Alexa at $399, which barely sound better than the New Generation Echo devices and definitely not worth $300 more.  Remind you we own a lot of Bose products and have been fans since 1980. So my recommendation is buy The New Generation Echo Devices over the over priced and marginally better sound Bose 500 is a based on years of use.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    For great sound and better value than Bose 500 and Sonos One buy the Amazon Echo devices\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 29, 2018",
            "id": "amzn1.account.AGIZHAY4ONRE7T3X3D6VSRT6PWSA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGIZHAY4ONRE7T3X3D6VSRT6PWSA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Us kids gave Dad this echo plus to help him out. We ask it many questions. Play a little music on it. Have a lot of problem getting the old music. Usually when you ask Alexa for a song it brings up some modern garbage. We're working on the way we ask Alexa. We got the Phillips Hue in a few rooms and Dad just gets a kick out of the lights coming on just by talking. It helps us because I'm pushing him in a wheelchair. Mostly we're just having a lot of fun. I look forward to purchasing other items for Alexa. We got the echo dot 3rd gen. as well. Just one little complaint is that the microphone doesn't seem to be the best. Sometimes we have to outright yell at Alexa.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    We're having a lot of fun\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 5, 2018",
            "id": "amzn1.account.AEZ3BA3YX7FD2GRNUEWOBPZS5SOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZ3BA3YX7FD2GRNUEWOBPZS5SOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We absolutely love our new 2nd generation Echo Plus! With the built-in hub, I've already connected almost everything I can to our Echo Plus and our original Echo Dot. Verbal home automation at it's finest! Music sounds great when played through our new Echo! You can't go wrong with the new Echo Plus.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    New Echo Plus is amazing!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 11, 2019",
            "id": "amzn1.account.AE7DA62S4DX2SPYWNRUUOBLMIYHA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE7DA62S4DX2SPYWNRUUOBLMIYHA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    According to recent Bloomberg reports, Amazon has employees listening to your private life... this is a sleazy, creepy and disgusting practice and I am sorry we purchased one- which has since been unplugged and won't be used again...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    AMAZON is spying on you with this device- a repulsive invasion of privacy...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 16, 2019",
            "id": "amzn1.account.AFSW4YFTPUIFGGW533VBNY33CMLA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFSW4YFTPUIFGGW533VBNY33CMLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n    Mejo no podria ser ya e comprado el echo dot gen 3 y ahora el echo plus gen 2 y son excelente, la parte negativa es que para poderlo usar en español hay que valerse de Mexico o España, deberian ampliara los demas paises de america latina, soy Dominicano\n  \n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n    Bien\n  \n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 15, 2019",
            "id": "amzn1.account.AFF45WVC24JX7FT2MNT5HBB35K7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFF45WVC24JX7FT2MNT5HBB35K7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The promise of Alexa/Echo is awesome.  Connect and automate virtually everything in your house as well as various communications alternatives and other services and functions, and be able to control it all through voice (by talking to it).  The main problem, however, is that it's unreliable.  For this reason I give it 2 stars.  The promise of Alexa is like a dial tone (remember that?) or your Internet service.  It becomes an essential part of your daily life, and you expect it to WORK 99+% of the time.  If it doesn't, it seriously damages the fundamental value proposition and causes frustration, inconvenience, or worse.There are MANY companies who make \"Alexa compatible\" devices such as Wemo, Phillips Hue, etc. including Amazon itself, and as I'm sure you've noticed, many items sold on Amazon say \"Alexa compatible\".  The problem is that on a pretty much random basis, items will lose their connection to Alexa and won't work through Alexa although the item itself still operates, and/or can be controlled by it's own app (such as a Wemo or Hue device).  From everything I can tell, it has nothing to do with the Wifi connection since I've tested for strong signal strength and hi bandwidth, and there is no discernible pattern.  A device will simply stop operating, and you get an error message in the app that the device is \"unresponsive\", or some other message.  Also, sometimes the Echo will just not recognize what you are asking.  I have an Echo plus, and two Dots.  For some of my switches and lights, one Echo will recognize what I am saying, but another may not.  Yet they are all connected to the same account and this happens relatively randomly for a given device, again there is no pattern.So, it's just REALLY frustrating that on a fairly random basis, Alexa will just not work for a particular device at a particular time.  I have to re-set, re-discover, re-connect, or re-install that third party device.  BTW, this ALSO happens with Amazon-made devices, such as the smart outlets.Also, there are different degrees of \"compatible with Alexa\".  Some third party devices work completely fine through Alexa, but others have only partial functionality compared to using their own app.  This is a problem since the promise of Alexa is a single point of control, but if you don't get to fully use the features of the particular device, you may have to occasionally resort back to using the third party app for certain features and functions. Check the ratings of your third party app integration.  For instance, Ring makes very popular devices such as video doorbells yet it gets only 2 of 5 stars when connected to Alexa.Also, I don't see why video devices such as security cameras can't be viewed through the Alexa app. You can (sometimes) control the device through Alexa, but if you are using the Alexa app, or if you don't have one of the Echo video displays, you can't actually use the cameras through the Alexa app.  This is a big limitation since why should you have to purchase yet another video screen to use with an Echo, and sometimes if you're not at home and have to use the Alexa mobile app, you ought to be able to see security camera video through the Alexa app instead of having to switch to the third party app.  After all, isn't this part of the promise of \"controlling everything\" with Alexa?These issues are particularly problematic when you are out of town and trying to control things at your home, so when an item doesn't work, you may not be able to correct it (such as if it requires a hard reset).  And if you want to check your security cameras, you can't get the video feed through the Alexa app.  If you have any significant degree of home automation, you cannot (as far as I can tell) do it all through Alexa, you have to use multiple apps.Also, an Echo will occasionally do strange things for no reason.  Yesterday, my Echo Plus started making two beeps every five minutes.  All day long.  My two Echo Dots did not beep, just the Echo Plus.  There were no alarms or reminders set, and the Wifi in the house was fine (actually my access point is in the same room as the Echo Plus, only a few feet away, so signal strength and bandwidth are strong).  When I woke up this morning, the beeping had stopped.  I have no idea why. Tech support said if it wasn't an alarm or a Wifi disconnect, they had no idea why and offered to remotely reset the devices, which arguably should never be the solution for such a highly-touted system.The Alexa app is surprisingly primitive and cumbersome despite the elegance of the overall Alexa system and Echo devices.  It takes too many taps to do simple things, the navigation is cumbersome, it doesn't remember your place on a screen, it is often slow to connect with the native app of the device you are trying to control, it's unattractive, and in general it's probably the weakest link in the whole system.Finally, as far as Amazon tech support, the \"pros\" are that if you dial the number, you get a live person within a minute or so, and the person you get is eager to be helpful and sounds as if they enjoy their work and want to do a good job.  The \"cons\" are that unless you are lucky, you often get a person who barely speaks English fluently and you have to talk slowly and repeat yourself.  Also, they rarely know the answer you are calling for off the top of their heads, and have to put you on hold while they research it.  Fortunately, they are better and faster at researching the knowledge base than we are, so I often find it still better/faster to call than to try and find the answer myself although I will first do a quick Google search to see if the answer quickly pops up.Anyway, as they say, buyer beware.  Overall, I like using Alexa, but you need to understand it's quirks and limitations.  Some day, voice-controlled life as promised with Alexa (or competitive systems) will be here, but today is not that day.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great promise but poor reliability, strange happenings, primitive app, and so-so tech support\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 2, 2019",
            "id": "amzn1.account.AE7XO2B74ED5KK37Q4CRUPZI3UOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE7XO2B74ED5KK37Q4CRUPZI3UOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Enough has been written about the Echo Plus that I don’t need to go over all of its features. I will say in general that it looks cool, sounds fine (maybe a 5 out of 10 compared to real speakers), the music playing capabilities are excellent with Amazon, Apple, Pandora, and Spotify, and the voice recognition is ok - good not great. I had no problem connecting to a Phillips Hue bulb and eventually an Echo dot and a smart outlet. I use all the time to play music and radio, control lights, and make shopping lists. I bought on sale at the end of 2018 for $97.99 which I think was a great deal.That said, I want to focus in on a four major issues that I wish I’d known about before buying:1. PodcastsThere is no native podcast skill on Alexa so you need to get podcasts through TuneIn, Stitcher, iHeartRadio, etc. All my other devices (computer, mobile) are Apple products where I use the Podcast app to listen and sync. The podcasts I listen to are not all on any one of these skills so I would need to download all the ones I need to keep podcasts synced between Alexa and my iPhone which is too much trouble. Plus I have a heck of the time trying to tell Alexa what podcast I want to listen to - who remembers the episode titles or  numbers of the podcast they are currently listening to? Even just asking it to play the latest episode of a podcast wasn’t working for me 9/10 times so I just gave up and figured I will connect my iPhone over Bluetooth when I want to continue a podcast. But that brings me to my next issue:2. Bluetooth connectionsI was successful at pairing the Echo to both my iPhone and iPad but Alexa can’t connect to the one I want when I ask it to. If I ask to “connect to my iPhone”, it connects to my iPad. If I ask it to “connect to my phone”, it still connects to my iPad. The only way to get it to connect to my iPhone with a voice command is to turn Bluetooth off on my iPad - annoying!3. Multiple usersThis is a big one. It is great that the Echo can have multiple users on it, so my wife and I can share the Echo using our separate accounts which are linked in Prime under the same household. You can even set it up to recognize each of your separate voices. However, ONLY THE PRIMARY ACCOUNT CAN CONTROL THE SMART HOME DEVICES. This means that if I want to control the lights and the Echo is set to use my account, I have to tell it to switch to my wife’s account first, then give it a command for the lights. Furthermore, you have command it to switch between accounts to use your personal skills and settings. Given that it can recognize my voice as distinct from my wife’s, I thought that if I asked to play something on Pandora, it would automatically play from my account. Nope - I need to tell it to switch from my wife’s account to my account, and then ask it to play something on Pandora. Want to turn the lights down? Have to switch back to my wife’s account. Want to play something else on my Pandora? Have to switch back to my account first. What is the point of having voice recognition if it can’t automatically detect who is speaking and use that person’s account? And what is so useful about having multiple accounts if they can’t both control the smart home devices? I can't control the smart home devices from my app, only my wife can, and I can't set up routines either. And last, there are some things I would like to be discrete to my account only - like shopping lists and reminders - but those have to be shared, so my wife’s Alexa app on her phone is getting reminders that I set up. There are some major kinks here they need to work out, but the good news is that it’s all just software fixes so GET ON IT AMAZON!4. RoutinesAnother big one here. There is a well-documented glitch that people experience with Echos where the music stops playing after one song. You have to ask it to keep playing in order to keep going to the next song. If you google “echo stops playing” you will see lots of discussion around this. Well we had it happen to us as soon as we set up routines. Routines are little scripts you can set up - actions Alexa can take when certain criteria are met. This is one of the primary reasons we went with the Plus instead of the Dot. We have pets in the house and we wanted to set up a routine where the Echo would send us an alert if the house temperature got above or below a certain amount. Well unfortunately as soon as we set up the routines, the Echo started doing the thing where it stops playing after one song. So we deleted the routines and reset the Echo and the problem has not come back. But now I am afraid to set up any routines because I don’t want to deal with the music playback issue. I hope they fix this glitch because not having routines is a big drawback.5. Alexa GuardI was also excited to learn that the Alexa Guard feature can alert you if it hears broken glass or smoke alarm sounds. But it’s not available yet. Still waiting for that.If I knew someone interested in buying an Echo, I would recommend they try an earlier generation Echo Dot which you can get on craigsist for $20-30 and see how you like that before spending $150 on the latest Echo Plus. Too many bugs still need to be fixed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good overall, but some key features need work!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 10, 2018",
            "id": "amzn1.account.AEZHWJSOFCGAFEXHWUUZPUXXMG3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZHWJSOFCGAFEXHWUUZPUXXMG3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    1-try to ask ALEXA play RTHK1 from Tunein ( you can try ) see what you get2-if you connect echo plus via Audio or Bluetooth from you smartphone it will not Pair with Amerzon SubWoofer? what a waste !3-it start talking by itself one to two time a day particularly during MidNight !4-when you play music and pair Echo plus to Echo Sub woofer when you commad\"  ALEXA stop\" echo plus stop but echo sub woofer keep playing with very low bass sound ???how is this possible for such \"BIG\" Amazon company roll out products like this????\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    bad quality\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 18, 2018",
            "id": "amzn1.account.AHUCRDJB7QNB7HCCBEZM4RXSHK2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHUCRDJB7QNB7HCCBEZM4RXSHK2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Wow, this Echo sounds great and the voice is so natural.  I bought a Dot at the same time for upstairs and it works great as well.  I plan on ordering 2 more Dot’s and I’m looking at buying a couple thermostats to take advantage of the built in hub for smart devices.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great new Amazon Alexa Echo\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 5, 2019",
            "id": "amzn1.account.AEMF5PCSFUDXW6D33GVHTENRUUBA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEMF5PCSFUDXW6D33GVHTENRUUBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n    Muy decepcionante pensé que ya venía en español y cuando llamas al soporte técnico de Amazon nadie habla español y no te pueden ayudar ,estoy pensando en devolverlo !!!!\n  \n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n    Echo plus alexa\n  \n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 8, 2019",
            "id": "amzn1.account.AGZHM73W47UIWSTGNTQ3HB5MFJSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGZHM73W47UIWSTGNTQ3HB5MFJSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n     I mean it’s a good speaker I guess, it’s loud, she listens but sometimes Alexa acts like she has comprehension issues, and I have to reset it and sync again, but all in all I will give Alexa a 8/10 rating it’s awesome she understands me and can turn lights on and off in my smart home so yeah and playing my music, she just seems to have trouble with Apple Music sync , and sometimes understanding some artists names/songs, but I fw Alexa heavy , wait Alexa isn’t the speaker she’s integrated into the echo so yeah I fw the Echo it gets the job done. Another minus would be the fact it only works when it connects to power, pluses and minuses my friends pluses and minuses. I paid full price, do I think it’s worth it yes, I guess, I would recommend buying a regular speaker to just to be able to pick it up and take it from room to room and it not having to be connected to a power source all the time. I like the fact that’s it’s a smart speaker, I think that’s the best quality. The sound quality is out of this world I love it wish it went higher than 10 but 10 is pretty loud plus I stay in apartments so my neighbors are probably happy it doesn’t go much higher. I love that Alexa turns my lights on and off with Vivint smart home skilldownloaded, this speaker is so neat! If you have a fan that’s smart and the skill downloaded you can control the fan speed right from your device that’s connected to echo/Alexa. So many functions, I love this speaker! Also great if you have a smart home like me, helps control lighting, and temperature as well!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I’ll give the echo 2 a 8/10 rating\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 10, 2019",
            "id": "amzn1.account.AFSWEBLLZV7JRTBKSHCL7Y5AVRCA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFSWEBLLZV7JRTBKSHCL7Y5AVRCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I fell for the hype...Neither Alexa nor her apps work well for me.  I tried to get some integration going with TP-Link switches so I can turn the lights on and off. Alexea indicates the lights are OFF when they are ON and vice versa. Easier to use the TP-Link app.  Same for Honeywell thermostats. No benefit to using Alexa.The interior temperature sensor, that apparently took an hour to \"calibrate,\" is consistently off by 4-5 degrees.  Alexea doesn't understand the words \"calibrate\" or \"recalibrate.\"  So, that's busted.Weather conditions are poor. No indication of dew point or even relative humidity. Cloud cover, etc. Just temperature.No weather warnings or alerts? Just experienced a hurricane, but it was news to Alexa...Volume is way off between various sources and there is no way to normalize. I am constantly either adjusting the volume manually or asking alexa to do so, and the increments she does it and the buttons are not the same.Can't get alexa to realize I've read my notifications and her yellow light keeps blinking.Equalizer is lame and doesn't seem to do much at all.Supposed to have my Comcast TV schedule available -- if it's there, I can't find it.The alexa app does not recognize or remember the volume settings and always reverts to minimum.Speaking of the app --- who was the brainaic who decided that tiny blue letters in an illegible font against a black background was good? It's terrible, and there is no way to adjust the font color, size, or background.  The app wastes nearly all of the iPad real estate with bits and pieces along the edges and a huge black hole of nothingness in the middle.Handling \"privacy\" is a complicated matter...hard to find things and there are several different settings and places one has to look.I waited for a while so that the bugs would be worked out -- but it's not worth the price for the few things it does --= and does so, so poorly.This is a real mess and one of the most poorly implemented things I have ever seen.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Disappointed and will be returning.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 29, 2018",
            "id": "amzn1.account.AESJEK52QHYST6REILT5DNFZLOTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AESJEK52QHYST6REILT5DNFZLOTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My echo plus setup experience was very interesting! The Alexa App is instrumental in the set up, so  were my headaches caused by the app or the device? After logging into the wifi system and thinking i completed all that was necessary, i was left with a message in the device area. It said echo plus not available and needs to be removed. I tried a few things, unplug, plug, hold down reset. While i could ask and get response that indicated connection to internet, the device on the app, had no other means of editing or setting up. I called support and got a very helpful agent. Together we explored aspects of the Echo interface to no avail. Finally something happened i now had a new message on app “device is recalibrating and could take awhile”!I asked the agent if this was unusual, and was told “very uncommon”, and she would call me back in a couple of hours.Things i learned, in lower right corner, icon looks like house with vertical bars. This was the access to device setting. Once my recal competed,  when using the menu on left, selecting device i was greated with my room temp! Look in upper right on this screen find 3 dots. Touch those then menu for this device opens. I created a group for origional echo and new echo plus naming it “everywhere”! So now i can say “alexa play _____ music everywhere” and both units play.Now i need to find out how to change phone number (cell right now) to a different number, to utilize phone call out. I did use it to try it out and that worked fine.Now i still have question on the aux in? Can i use IPod to play my own music. As a prime member i can play what is on Amazon Music, by asking.Oh the agent did call back as promised, so i asked her about the aux in use, the response was try it.  I havent.So what could make this better? Maybe a PDF style manual explaining the app interface and what icons are, and what each will do ( like the house i mentioned earlier) vs guessing.Sounds great but came close to returning that is why i gave 3 stars.Created new review on 2nd generation echo plus. Included screen shots that should beeter explain that review posted Dec 16\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Miserable setup, learn from mine.  Read to bottom for update\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 25, 2019",
            "id": "amzn1.account.AFFYGHDODSS4YX2URS2ZXQVF46KQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFYGHDODSS4YX2URS2ZXQVF46KQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So I've been eyeing the Echo Plus 2nd gen for a while and when it went on sale I was like \"uh yes please,\" so I bought it, it arrived in mint condish (mint condition for all the non-Jack Black fans), my fiancé and I set it all up with no problem aside from a few difficulties we had with the Philips Hue light bulb we got in the bundle including the app saying we needed their hub even though we knew the 2nd gen doesn't need it and Alexa not recognizing the name we gave it right away but after we figured out how to use the skill for it and linked our account everything ran smoothly. We also linked a smart powerstrip we got with no problems, connected her to our Xbox so she can turn in on and off, launch games and apps and pause and play videos, and our absolute favorite thing is to ask her for the room temperature since we're both always arguing about whether it's actually cold in our bedroom or not lol. All in all we both love the Echo Plus, it's useful AF and makes life easier. Alexa even controls our year round Xmas lights! Now we just gotta watch ourselves when we say her name and she's listening lol this beech hear everything.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Siri who?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 5, 2018",
            "id": "amzn1.account.AHFBE2DBC5F3EGDQ5HTTB7FKEYFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHFBE2DBC5F3EGDQ5HTTB7FKEYFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Before buying the new 2nd generation Plus, I had a 1st gen Echo, a 3rd gen Dot and an Echo Show.  Most of my home automation was handled by SmartThings.  With the addition of the new Plus, I have retired SmartThings and am slowing trying to have Alexa handle all of my HA tasks.  The major issue holding this back is that Alexa's support for sensors is brand new and not yet fully developed.  For example, the new Plus has a temperature sensors built in to it. But there isn't - currently, I hope - support for simply asking Alexa what the temp is in the room where the Echo Plus resides.On top of which the features that are currently implements don't work so well.  I created a routine that was supposed to send me a notification any time the temp in my living room got below 65 degrees.  Just a simple routine to test how the temperature sensor is working.  It worked sort of.  I would get my notification but it would usually be delivered several hours after the trigger condition had been met.Otherwise, the new Echo Plus seems to work well.  Discovering Hue light bulbs works seamlessly.  The sound is much better than my 1st gen Echo, even to my ancient ears.  It's smaller, better looking and so far, at least, does everything that it's supposed to do.  Amazon just needs a little more time to build out the software.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Almost there\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 15, 2018",
            "id": "amzn1.account.AFCFETDASD24UX4BSMD243PB2O6A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCFETDASD24UX4BSMD243PB2O6A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I primarily bought this because I wanted to enter the world of smart devices.  I bought some google home minis, but found you had to download apps from outsiders in order to use the smart light I wanted.  I looked at the privileges that were being demanded by the app and decided an app to control lighting had no reason to know who I called, when I called, or anything else about me personally.  Amazon already knows me (my husband thinks they pretty much own me) so I was more in favor of using the echo plus since it has a built-in hub and no third party app or skill was desired for the smart light I bought (actually, I received a free smart light bulb when I purchased the echo plus).I had a bit of trouble getting the light to work - Alexa didn't find it at first but I reset the bulb and then I was good to go.  I agree with others that the Alexa app interface is not really intuitive, but now that I have the light up and running, I am in love.  My 94-year old father is not very mobile and when he comes to stay with us, I wanted him to be able to turn the light on and off while he is still in bed.  This feature now works like a champ so I am very happy.I have played some prime music and that works well, but I still have a lot to learn about all the echo's features.The only reason I would not give it 5 stars right now is the alexa app - but that is really a separate issue, so I gave it 5 stars.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I don't know much yet, but what I have tried, I like very much!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 4, 2019",
            "id": "amzn1.account.AFFSL3SCCNMIX43HO3TTI7X65K2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFSL3SCCNMIX43HO3TTI7X65K2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Originally owner of Echo Dot 2nd gen, decided to buy Echo Plus 2nd gen because of temperature sensor so that alexa could automatically turn on/off space heater at specific temperature, after following youtube tutorials and setting everything up, ran multiple temperature routine tests & they all failed, alexa would not shut off/turn on space heater on it's own according to ambient room temperature. Later did more research on the subject and found out that lots of other people had the same issue with alexa not being able to control their equipment based on temperature.Another thing I noticed from Echo Plus 2nd gen was that there was a 10 second delay before playing \"tunein\" radio, with echo dot 2, that delay was only 2 seconds.And yet another annoying thing i noticed about Echo Plus 2nd gen is: while she's not playing anything if you ask her  \"set volume to (a number from 1 to 10)\" she does not play confirmation sound tone so you can't know how loud she really is, on \"Echo Dot 2nd gen\" she plays that tone which is really helpful (even though confirmation sound after each normal request is disabled in settings).So for over a $100 buying a glorified mono speaker, no matter how amazing it sounds, just doesn't make sense in my opinion.P.S. Please note that this review is written on \"March 2019\" it is possible that Amazon may have fixed some of those issues since the time of writing this review.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Quality sound but not without issues\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 1, 2018",
            "id": "amzn1.account.AFB2OOCVXJKPTQLNQ4XQX2VNAAQQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFB2OOCVXJKPTQLNQ4XQX2VNAAQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A small device like this can never match a large speaker for playing realistic music that spans the frequencies our hunan ears can hear. But this little guy, smaller than aPeanut butter jar, sounds way bigger than it is when playing music. What it does even better is play frequencies of the complete tonal range of the human voice. If you like listening to audio books, or NPR radio like I do, you will think there is an announcer standing in your kitchen. I have the new echo dot as well, and that one is fine for a small room, but this new echo plus is in an entirely different audio class. Which it should be as it is around four times the price. You get what you pay for.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not bad for music. Amazing for voice\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 8, 2018",
            "id": "amzn1.account.AF2TDL56GX26AZ6UFJYTVIOGZIDQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF2TDL56GX26AZ6UFJYTVIOGZIDQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Ordered the two Echo Plus's and the Sub and come to find out BOTH Echo's respond to your voice so you have to train both to do the same command OR they don't complete the task you asked for because they are confused. Let not mention the Sub doesn't work with the Prime Music Single Device plan so the music playback didn't work. Will not buy it again.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    One make work fine but when you make them a sterio pair they don't\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 8, 2019",
            "id": "amzn1.account.AFEF7477RJIRAZDT7YKLYLIHFSTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFEF7477RJIRAZDT7YKLYLIHFSTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We bought this \"Echo Plus\" specifically because it pairs with the Echo Subwoofer - if you use a regular ECHO, you know the sound is ok, but lacks deep bass.  The subwoofer is great and delivers on sound - but the ECHO Plus is lacking - it is much less receptive to commands (doesn't \"hear\" or doesn't interpret them correctly), and frequently just cuts out mid-broadcast.  There's a significant delay between command and response, which suggests the pairing with the subwoofer component slows the whole system.  (Maybe it's a two step process - the ECHO responds, then feeds the subwoofer, then you get the audio response.)  At any rate, good sound but frustrating to use.  First generation ECHO's, even the refurbished ones, are far more responsive.  For a sophisticated full range sound system, there may be better smart speaker systems out there.  Amazon has just offered the \"Amazon Studio\", which is an all-in-one device - but expensive.  As we're too far out to return our ECHO Plus, we'll have to relegate it to the garage.  There are lots of smart speakers out there and though I'm pretty loyal to Amazon, it may be time to evaluate some of their competitors, at least for audiophiles who want the full spectrum of sound.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good idea, to add a second speaker, but slows overall function.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 18, 2019",
            "id": "amzn1.account.AHAARWFCRJBZQQQY23VT23KQQ2MA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHAARWFCRJBZQQQY23VT23KQQ2MA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So I couldn't get this to 5 stars and here is why... Amazon now gives you the option of doing \"speaker pairing\" that will allow you to connect multiple speakers and use them as one. The problem I'm running into is that if you are dropped in on a \"call\" (one room to another) it only uses one speaker and when you try to hang up it says there is no call connected if the \"other\" speaker heard you tell it to hang up.I love the Amazon Alexa system and I have it throughout my home for home automation and it works great, it can hear you from another room and it understands what you are asking for.  There are a TON of devices you can connect to it and there are a TON of skills to use with it. I loved the idea of connecting multiple speakers as one in the master bedroom because of its size but not being able to use both speakers while making a call is not what I was hoping for. I was hoping they would act as one speaker (or a speaker set like a real stereo system) all the time, for everything.Now the worst part...I changed my review from 4 stars to 1 star because of a software update that now forces me to specify which light, power strip, and/or other devices I want to turn on/off. All of my rooms, lights, power strips, etc... are in various groups for a reason. Each light, outlet, and other devices have a unique name (IE: The upstairs hallway lights are named UH-Light, UH-Light2, and UH-Light 3, my smart power strip has unique ports like TV, Monitors, etc..).YESTERDAY (9/18/2019) I was able to walk into a room and say \"Alexa, turn the light on\" (in my home office for example) and it turns the light on, Today (9/19/2019) I'm sitting in my home office and I say \"Alexa turn the light off\" and I get the response \"There are multiple devices that share that name, which one do you want\".The master bedroom - Setup with only lights (MBR-light, or something like that so I can identify it later when adding other stuff), the wife used to say \"Alexa, turn the light off\" because that's what she has always said before going to sleep. Today she can't do that because of Amazon's development team.So I say \"Alexa turn the office light off\" and it turns the ENTIRE OFFICE GROUP OFF. So now I have to go to the app to turn the light off and rename EVERY ONE OF MY DEVICES so that my family can remember what each name is.I reached out to Amazon customer support who tells me I have to be specific when asking the echo to turn the light off as in \"Alexa, turn the office light off/on\" and that it has always been this way. When I tried to tell them that yesterday I was able to say \"Turn the light off\" they said it wasn't possible and I have always had to be specific.I set up groups for a reason, that being I can go into a room, say \"Alexa, turn the light on\" without having to remember each light bulb name or what I named the room/group. Yes, I know what the group names are, I don't expect everyone in my house to remember the group names.There was a software/firmware update overnight that broke all of my Echo's and Amazon's customer support will not acknowledge it.I will not recommend this device to anyone else until they put it back to the way it was.You would think it would be simple, it's not, apparently.Update 10-8-2019: Attached another picture right from the amazon website that says \"Alexa, turn off the lights\". It's still broken and doesn't work like that. Additionally, I was supposed to receive an email from the Alexa/Echo customer service department with more information, this was a couple weeks ago and I haven't heard anything.They (Amazon) reached out to me after reading my review requesting more information, I gave them everything they needed and the rep said he would contact me again, never happened. It is a pain in the rear end, but this has been broken for nearly a month and nothing has been done about it... I keep getting emails saying \"What's new with Alexa?\" I can tell you what's new, you can't turn the lights off by saying \"Alexa, turn the lights off\".I've done everything the Customer Service Reps have asked me to do, every time it doesn't do what I ask it to do, I go into the app and report it as \"it didn't work correctly\".SORRY AMAZON, YOU ARE FAILING THIS ONE.Update 12/15/2019 - So they fixed the \"Alexa, turn the light off\" for a few days, then it was broken again... Now they've changed the APP so it's more difficult to find the voice responses to give feedback. I tried saying \"Alexa, turn the light off\" got the same response as before \"There are multiple devices with the name light, which one did you want\" If I say \"Alexa, turn the office light off\" it still turns EVERYTHING IN THE OFFICE GROUP OFF\" but Amazon customer support can't seem to get it when I explain that it shouldn't do that. So, like the APP says, I tried saying \"Alexa, turn the lights off\" it responds with \"Sorry, what device\" but I can't say \"Alexa, turn the office lights off\" because it will turn all of the plugs off too, so now Alexa has no voice control over lights if there is anything else in the room.I feel as if I have wasted hundreds of dollars setting this system up for Amazon to come along and ruin it all...Amazon, you should fire your developers and hire people who will do it correctly.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Connecting multiple speakers isn't 100% functional (Edited to include the turn for the worst)\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 23, 2018",
            "id": "amzn1.account.AFAEJ6HIKPQ2Q4WJH6MPUW2Y2VOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFAEJ6HIKPQ2Q4WJH6MPUW2Y2VOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Amazon Echo Plus 2nd Gen is perfect for my needs - I bought 2 Amazon Echo Plus & the subwoofer (check my act. to read that review).  I have a large great room with 40ft ceilings and it absolutely fills my home with warm sound which can be heard throughout my house, and with the \"everywhere\" group feature I can successfully play my music throughout my home on my Echo's in stylistic fashion. I've been an audiophile for quite some time and this kind of quality for something affordable blew my mind.I think my favorite feature is connecting this with smart home commands when paired with other devices - turning on lights, controlling my TV's, etc. It just makes everything so much simpler. I am highly anticipating future adaptability - the sky really is the limit with these devices. I would highly suggest these for your home as I have really enjoyed using them.The only problem I've had so far is giving commands to play certain radio stations and the cursed \"I can't find (x)\" response. I really Alexa said something humorous when she can't find what I'm looking for, it would make it a lot less aggravating when I've been playing a Pandora or Amazon Music station and suddenly it can't find what I'm looking for.Other than the minor nuisance of that, I am free to stream whatever station I want via Bluetooth on my iPhone or other smart pad, which negates my only discrepancy. My friends love interacting with Alexa when they come over! Highly suggest!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    These sound terrific!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 27, 2018",
            "id": "amzn1.account.AFK5QH54XACR2AKQUU7UPEAIHVNQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFK5QH54XACR2AKQUU7UPEAIHVNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We had a 1st generation Echo for several years and used Amazon's trade-in program to get a discount off of a new Echo. The process was easy and straightforward and we're very happy with our new device. Is there a huge difference between old and new? No, not really. You change the volume with + and - buttons instead of twisting the dial. I do like the new color options available. We got the Heather Gray color and it blends in nicely with our living room furniture. The deal included a Phillips hue bulb, so that was a nice bonus.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love our new Alexa\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 10, 2019",
            "id": "amzn1.account.AHL4VUATXAL6B6FWRYV6P65T3ERQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHL4VUATXAL6B6FWRYV6P65T3ERQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If you want to get on the home automation bandwagon like everyone is doing but aren't a \"Techie\" then the Echo line of products powered by Alexa is the smart choice. the Echo Plus is the latest generation of the main Echo device. It's very responsive (almost too responsive if you don't mute it whenever anyone on TV is demonstrating how they work) has great sound quality and is very easy and intuitive to set up. There are literally thousands of things it can do for you and you're really only limited by your imagination. Usually the Echo or the Echo plus is bought and used for the main hub of an Echo/Alexa enabled Smart home, although there are other more expensive options like the Echo Show that can do everything the Echo Plus can do plus a few things the Echo plus can't. If you are on a tight budget and don't need a video interface though then the Echo Plus is the Smart Home hub for you.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Amazing device with tremendous potential\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 19, 2019",
            "id": "amzn1.account.AGQGOENLVNMONGGVK6J2AF673OGQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGQGOENLVNMONGGVK6J2AF673OGQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Once every two months we wake up to find that none of our 4 Echo devices can connect to the internet. We unplug routers, and modems and Echo devices. We spend hours on the phone with Amazon whole they make us do things that don’t fix the problem. They open a ticket to send us to a support person that makes us do the exact same things. We give up. And in 1-2 days all of the devices start working again. It MUST be due to a Amazon update, but they won’t tell you that. We have echos provide music, control the temp and our blinds. So when they go down we know it. The Amazon’s tech support is reading a script to tell you what to do.  And the issues that we have never seem to make it back to the actual developers who are updating the device software. If you buy these devices, realize that you are committing to spend approximately 1-2 days per month frustrated that they do not work.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Realize that these devices will be down for 1-2 days per month\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 24, 2019",
            "id": "amzn1.account.AHYS5LD63UQWVD6C64IZUTYCMDSA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHYS5LD63UQWVD6C64IZUTYCMDSA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought this after I fell in love with my 2nd gen echo dot, but wanted an upgrade for me room, so I could put the dot in the kitchen for simple smart home co trolls and music during cooking. The sound in this thing is insane, for a medium sized room, I never have to keep the volume over half, and the base is crisp and beautiful, you gear every little wub and punch, unlike the dot, which only tries to mimic the low sounds with its tiny tweeter. This is worlds better, is it better then a multi hundred dollar speaker or surround sound home entertainment system, hell no, but is it way more then what you could expect for a speaker the size of a beer pitcher? Hell yes as well!! The microphones seem to be able to pick up my voice even when music is playing and the air conditioner right beside it is blaring, and even though most of my smart home devices are wifi and not zigbee, I'm happy to be able to expand the choices of smart home devices I can now buy with the built in hub. The thermometer inside, I thought was useless at first, but I can set it to turn on my airconditoner at night when the temperature is over a certain degree, and off when it's under a certain degree, which saves myself from having to half brain command it to turn on and off in the middle of the night, I will be buying an echo sub to further enhance the lows in my music, not because I need to, but because I personally love bass in my music.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A billion times better then the echo dot, bass is loud, crisp and clear\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 15, 2019",
            "id": "amzn1.account.AGVTHKZKWEIH3SUTHGE5JWNAZYSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGVTHKZKWEIH3SUTHGE5JWNAZYSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My #2 daughter gave me one of these things and, at first, I thought \"Geeze, what an over-priced BlueTooth speaker!\".Then I startef fooling around with it and now I have three with probable two more on the horizon..You only need one \"Plus\" because they talk to each  other - but you need that plus so they can all use it to turn smart light bulbs on-and-off and do other WiFi/Zigby stuff..Smart devices, Pandora, my own music via the Plex add-on...I find it addictive AND functional..Three Nice-To-Haves so far:- Custom wake-up words.  \"Alexa\" gets on my  nerves, \"Computer\" is a bit of a mouthful.  Being from Philadelphia,  I'd opt for \"Yo!\".- More granularity in volume commands: 3 is a  bit too soft and 4 is a bit loud. (you only get  10 volume levels at this time).- Multi-processing.  Right now, it only does one  thing at a time so, if you have it playing music and  tell  it to turn a light off, the music has to stop for  several seconds while it issues the lightbulb  command, the bulb responds, and the Echo  issues it's \"Command successful\" beep..Favorite Command: \"'Puter: Shut up\" (actually, \"'Puter Shut\" works too)...and it realky does shutup immediately.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Worth a Try - But Get the \"Plus\" Version\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 7, 2018",
            "id": "amzn1.account.AFYG7PHUKURGMG4E45WHS3DZXEVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFYG7PHUKURGMG4E45WHS3DZXEVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This echo is really incredible! I can ask it to turn off my lights, play the music channels I frequent on Pandora, call my friends or family or what the weather is forecast for the next morning so I can plan accordingly for what to wear & if I need to let my vehicle warm the frost off of the windshield. Also, the sound that comes out of this unit is phenomenal! For its compact size it really packs a punch even on the bass line. Can't say enough good things about it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Always ready when you are\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 1, 2018",
            "id": "amzn1.account.AH2UJ5DX5DUJS6FIIXXKLDJ542BQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH2UJ5DX5DUJS6FIIXXKLDJ542BQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Got a pair of these to go with the new sub. The speakers sound good and have a nice full range especially with the sub. The speakers themselves dont hear the commands as well as the standard echo I have been using. The other thing that is a little annoying, the voice responce is very low volume compared to the music. It seems like I am adjusting the volume a lot more often. The last item is that when speaking to, the stereo pair both try to listen, only one responds but as I said in the beginning they dont respond as well.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    As a pair, much better sound, but they cant hear as well.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 27, 2019",
            "id": "amzn1.account.AH47UO7RM5DGNL7YQAJYLCPSNYQA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH47UO7RM5DGNL7YQAJYLCPSNYQA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Echo Plus has much better sound quality, nice plus, better bass, nice, but poor voice recognition, volume control and essentially no control of it via the Alexa app.Volume is all over the map essentially.  When you first turn it on, volume is very low for about 10 - 15 seconds, then goes moderate for maybe 5 seconds, then loud, and stays loud.  If you tell it to lower volume, just don't know what you will get.  You have to walk over to it and turn the volume down and even then, it isn't consistent.Plus I have noticed, my husband has as well, it literally does not want to be turned off.  It's about 50/50 that it will actually turn off when you tell it too.  A couple of times I have told it to \"stop\" and the volume just got very low.  Repeated attempts to turn it off were ignored.  After several minutes, I finally shouted angrily at it, no lie, and THEN it turned off completely.  Does Alexa now understand emotions as well??  Kind of scary.As far as integration in the Alexa app, essentially nonexistent.  You can do the setup via the Alexa app, after that, there's no more volume control, on/off control via the app.  DO NOT like that Amazon.  Are you listening??  Oh, wait you do listen sometimes....  Yes, not so happy with this 2nd Gen Echo.  Improved sound quality does not make up for loss of control.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Doesn't recognize voice commands as well\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 6, 2019",
            "id": "amzn1.account.AFTYCHAT5TQE5EHR4LYOH6W2U5TA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFTYCHAT5TQE5EHR4LYOH6W2U5TA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    First off, I own several Echos... from the 1st Gen to Plus to Dots. So, this is not a 'bash' Amazon or Echo review nor is this me drinking from the Amazon/Echo Kool-Aid.This is meant more as an observation of my experience with them... culminating with the Echo Plus 2.Echo-wise, there are no obvious functional differences in how all these Echos work.Appearance-wise, I really like the rounded unassuming appearance of the newer Dots and the Echo Plus.Microphone-wise, here's where there seems to be differences. In my opinion, perhaps this explains issues with Echos after the first generation.My first gen Echo is near instantaneous in the ring lighting up and the 'listening' sound (I have all of my Echos adjusted this way so I can hear actual and accidental activations).Every gen since then, seem to have a delay between the wake word being heard and the Echo responding by lighting the ring and making the activation sound.As much as I enjoy the Echo Plus 2, I have factory reset, voice retrained (from a foot away and even as far as ten feet away) and even deregistered the device several times... and there is still a half to one second delay in an acknowledgement that the device 'heard' me.Before you respond that it must be a defective device, this is my 2nd Echo Plus 2 from a completely different source... in addition, all of my Echos, after the first gen, have this similar issue.This doesn't ruin the Echo experience for me... it just tarnishes it.I'm hopeful that somehow, someone, someday will actually address this and/or release a firmware update (if it is a software issue) to make these Echos really, really shine!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Response delay tarnishes an amazing product!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 13, 2019",
            "id": "amzn1.account.AHSRSAOJTHI4LCNRXIFQXS4MMV5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHSRSAOJTHI4LCNRXIFQXS4MMV5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Sometimes when you ask a person question, Echo will but into conversation and answer even though you never said \"Alexa\". She is getting better. One thing you should know if you own any Hub whether it is an Echo, Google Home, Samsung SmartThings, or whatever people will hear you even if you think the speaker is off.  I just think you should know that.Personally, I feel since they can listen in on you with your cell phones what does it matter. You can always unplug, and turn off your internet. If you do research about this on the net try using .gov, .org. , or .edu websites. I learned in school these are more likely to be true.So, why get a Hub? I love it because it makes life a lot easier. If I want to know anything, I ask my Google hub ( she knows more info because she is  better with web searching than Alexa). If I want to spell something I ask Alexa (she is a better speller).You can use any hub to ask about weather, how to cook something, games, read you a book, play music, news, turn on/off smart stuff like... plugs, lights, thermostats, TV, coffee makers, dryer/washers etc.... It can work smart cameras, smart beds. You can ask, is the back bedroom light on, They are coming out with new stuff for them to do all the time. I can't wait until they come out with a \"clean my house\" command. lol  Also, you can call someone ( I often call my own phone because I lost it in the house lol ) ETC....Please note, I do feel it is dangerous to let a smart device control locks, garage doors, cameras in your home, or anything else that might be a security threat.  As you know there are a lot of hackers out there that are willing to take advantage of others. Even the cops are hacking ring door bells ( the Washington Post had written an article about it).I own two of the Echo Plus (2nd Gen), one Echo Dot (3rd Gen), 2 Google Homes, and 2 Google Minis. Ok - I admit I went a little over board . lolThings to know...1. When you buy Alexa you can hook her up to your Amazon acct. I like doing that online when I am buying it.2. However, once you get an Alexa, and plug it in at home, the Alexa will ask you about hooking up to your voice, to account. If you say yes, Alexa tries to sell you stuff a lot. Example:  I asked for the price of Duct tape, and Alexa said, \"I put the Duct tape in your shopping cart\". So, I feel it's better just to hook it up online only, and not hook it up to  your voice after you have it at your house.3. Alexa can start off very buggy. However, if she is buggy after about 17, or 18 days Alexa works out many of her bugs.4. If you get Alexa, I would recommend getting Prime membership. If you do have an Amazon Prime membership you will get a lot of songs. However, some you have to pay another yearly fee, on top of your Amazon Prime membership fee. Ouch!5. For keeping cost down I feel that the Google is better.Google Home gives you a lot of free stuff like bedtime stories, music, ETC. Where Alexa you have to pay for just about everything. The more stuff you get the more it will add up. An example is Alexa bed time stories are $79.99 plus tax a year if you are a Prime member. If you are not, it will cost you $99.98 plus tax. Again Amazon-Ouch!However, if I had a lot of money, I think I would like Alexa a little bit better than Google. Tough call.If you want to read more about the Google, and Alexa because you don't know what you want than read below. Hope this helps...Compare Amazon Alexa hubs to Google hubs.Google is easier to use because it understands more words, and phrases.The Echo Plus sounds better than the Google Home. So, if you want great sound with Google Home, you might want to get a good speaker for it. The sound is really I'm All Bout That Bass, Bout That Bass (I mean it's all about the speaker quality). Sorry, I couldn't help myself.You will find that there are some songs Amazon doesn’t have at all no matter what you pay. They are normally the rare songs. One example is Night Beach by Dream Singer.While Google Home, works with every song out there that can be downloaded for free. Just pick a song you own from your iTunes, computer, or whatever song that you already paid for, and upload it yourself for free (easy to do, just YouTube it). After that you can create your own playlist.Google has a lot more choices when it comes to making up routines. Google also has quiz games that you can have more than one player. Google ask you how many people are playing each time . Alexa does have quiz games, but they are only for one player unless you add MultiPlayer Skill. Even with adding MultiPlayer you have to ask Alexa before starting the game. If you don't ask Alexa in the right way, she gets mixed up.Alexa has more brand name smart devices, but not more kinds of devices. Example: Alexa will work with an Foscam security camera, and Google will not. However, there are plenty of security cameras that work with both Google Home, and Alexa. So, they both work the same kind of stuff.The Echo Plus (it must be the plus that has the thermostat in it) can tell you room temp. The Google doesn't do the room temp. However, you can buy a smart thermostat for your home to hook up to the Google. They both will tell you the outside temp.Google tracks packages throw Gmail, so it can be ant package, but it is tricky to set a Google Home up to Gmail. Alexa tracks only Amazon packages. Alexa lets you know when you have a package at your door from Amazon by a lighted ring on top of the device.I feel Alexa can be nosey, and rude. One example: Once it asked me if I had a tattoo, and I said that's a personal question. Then it asked \"what kind of tattoo do you have?\" Then I said you shouldn't be asking questions like that. Then it said that it wanted a black bird tattoo.The point is that It assumed that I had a tattoo, and would not drop the subject. It will ask you a lot of questions if you let it, so it knows what stuff to try to sell you. I have learned to watch what I say, so there is not as much sales pressure. Also, I say \"Alexa Stop\" about two or three times in a row. That way it stops talking.The Home Google is very polite. Also, it doesn't try to sell stuff to you. I hope Home Google stays that way.Both Alexa, and Home Google have improved over time, and still are improving. They will keep trying to outdo each other. I do like having both of them. I hope this helps.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Without saying the wake word the Echo will but into conversation when you are talking.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 7, 2019",
            "id": "amzn1.account.AGDNPXZHZBXDJ7ELU54GBGOYHP6Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDNPXZHZBXDJ7ELU54GBGOYHP6Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    UPDATE:I still can't believe what a mess this is.  Over and over I say \"Echo turn WRITING table lamp on\" and get back that it can't turn \"CONSOLE table lamp on.\"  Those things do NOT even sound alike.And it NEVER just does its job and SHUTS UP, even with the minimal talking setting turned on.This is like being in a torture chamber where the longer it goes on making the same mistakes and talking incessantly my first reaction is to see red and scream at it.I've seriously got to look at other options.  This is beyond belief bad, and needlessly so.Don't believe me?  Google Echo \"a few things share the name\" and see how many people are having this issue -- for years now, unfixed.Worse?  There's nothing more unnerving than hearing a prowler outside your house and telling Echo to turn on downstairs lamps and having it argue with you while your house and garden is still in the dark with someone outside.You will literally want to bash this piece of garbage into the cement just to get some satisfaction and closure.______________________________This more expensive speaker was billed as working via Zigbee even when your Internet connection is down.  It's never worked reliably even for turning a light off and on.  The older Echo Dots were actually more reliable than this ever was.At any rate, I have just about reached my limit with Amazon and Echo and am looking for a competitor's product.Like eBay that used to work quickly and simply, over the years it's been bloated to the point it's time consuming and labyrinthine.  I assume this is because workers and supervisors need to show results and justify their existence so over time what worked simply becomes bloat ware.As a reult of this, now when ask what time it is instead of just answering briefly it tells me the time AND then tells me to have a nice day, or to enjoy national blah blah blah day.Think about what just happened there.  A MACHINE with no real personality just took the time (and my time) to wish me a nice day.  Maybe that's cute once, but it gets annoying.  Imagine if you flipped a light switch in your home and instead of just doing its job it suddenly had a personality and wished you a good day, and then your toaster, and so on, all throughout the day.  It's ridiculous.  That's not what I bought into.  I literally simply wanted to be able to walk into a room and turn on three lights at once instead of having to go around the room and do it one by one.Not even that works anymore.The system works for awhile and then a name stops working, so if you've called it desk lamp suddenly you have to call it something else.  There are only so many logical things to call it.  So I've gone through a few name changes and each successive one and more and more strained to have some meaning.  My living room is now \"Garden Room\" and so on.Worse still is the system repeatedly tells me a device isn't working and then I ask again just a second later and suddenly it works normally.  Hey, Amazon, how about the stupid device tries three times before telling me it doesn't work instead of just the one?Just as infuriating is very clearly saying to turn something on and getting a message that says, \"A few things share the name 'table lamp.'  Which one did you want?  Well I've got WRITING TABLE lamp and STUDY LAMP and CONSOLE TALBE LAMPS and FRENCH LAMP and BEDROOM 1 LAMPS and BEDROOM 2 LAMPS and so on.  Most of those things don't sound anything like one another, but still the device can't figure it out and constantly asks me which one I want.I suspect this has to do with waking up after you say the wake word so while it's doing that it misses the first (and more descriptive and unique) word and just starts listening at \"lamp.\"  Either way, it's annoying, and I don't recall this ever being an issue with the early/simpler/cheaper Echo Dots before I got this one.Every day is infurating, and because unlike a human it's the exact same thing, it's more maddening.I simply want to be able to say what time is it or what's the temperature or so on and get an answer, not a verbose response.Even if you want to play an audiobook and shoot the sound over from your phone to this speaker via Bluetooth that works, but Amazon in its infinite wisdom decided the speaker should (instead of just start playing your book) say, \"Now connected to blah, blah, blah.\"  Just play the book and we will know we're connected.Do a Net search for Amazon Echo or Amazon Alexa and the word verbose and you will see I'm not alone in my issues here.It's so awful even though I'm invested in this maddening system I'm looking into competing products designed by humans who actually gave them some thought as to how they interact with humans.The devices should be adapted to US, no US to THEM.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Looking for a Replacement Brand\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 3, 2019",
            "id": "amzn1.account.AG7WLBBJUBAYUHUSXT3SKMBCIJLA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG7WLBBJUBAYUHUSXT3SKMBCIJLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n    Efectivamente se encuentra en español para América Latina, pero es muy difícil encontrar skills que funcionen en esta zona. La mayoría de las que se encuentran son para España y no se pueden seleccionar en, por ejemplo Colombia. Aún así los dispositivos conectados como luminarias hule y lutron así como audio sonos funcionan perfectamente.\n  \n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n    Alexa Latinoamérica Colombia.\n  \n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 29, 2019",
            "id": "amzn1.account.AH5XIWOZJTXFIUFU7IY6PPXWIK6Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH5XIWOZJTXFIUFU7IY6PPXWIK6Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We're all having fun with Alexa.  Overall it is nice but I look forward to future updates.Key areas -Voice Profiles and security.  It would be nice if I could limit activity based on Voice profile.  While one can lock down purchases - I want to set times where Children aren't allowed to talk to it... or they can't override what Mom says (mom picks music and then the kids try to override mom - which results in me pressing the Mute button).  Alexa listens to everyone (future criminals will be yelling \"Alexa open the garage\" from outside the kitchen window)SmartHome:  I bought the hub hoping I wouldn't need to buy a hub from other vendors.  Turns out I was wrong. Echo Plus doesn't support Scenes, sunset/sunrise time triggers, light switches as input, and several other things.  For example the Hue lights come on full brightness after a power outage.  The fix requires a Hue Hub.  Some switches I was looking at require their own Hub to operate.  You need the hubs and Alexa can control simple devices.  A hub of hubs (kind of an industry problem I suppose).Miscellaneous - Timer alerts and CONTEXT.  We use this feature while cooking - often naming the timers \"chicken timer\" \"pasta timer\"  wonderful feature.  However, when a timer goes off one can't simply say \"thanks I got it\" -- no you have to say \"Alexa - stop the pasta timer\"  \"Alexa this, Alexa that\" - yes there is a mode to chain things together, but one still needs to be explicit as Alexa lacks context.  A time is going off - when I say stop --- take a guess what I might mean.The larger speaker is nice (although my Sonos sound system is better -  the integration is lacking - but that's a Sonos problem).  It looks nice.  Works well.  Just needs new features added.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Alexa is nice - Smart Home is lacking\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 15, 2018",
            "id": "amzn1.account.AGQZQKW6SZASXBKY46IFJTOD3HOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGQZQKW6SZASXBKY46IFJTOD3HOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I don't know how this thing gets such good ratings.I have about 15 devices all on the same network and work group.It can only find the thermostat.Can't find any of the samsung/lg tvs all of which are smart.  It can't even find my Samsung Smart Series 8 1.5year old tv. I have tried enabling stuff through the Alexa app, but its honestly a waste of money IMHO.We had google home too, and it was only slightly better.Got this becuase I just figured Google Home wasnt up to par, and Alexa is advertised as controlling all these smart things.In short,  don't buy any of them,  save your money.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Is it really smart?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 14, 2019",
            "id": "amzn1.account.AFEJ3IYFGT7B6TQ2K5OTIDJIYSPQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFEJ3IYFGT7B6TQ2K5OTIDJIYSPQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought this over another dot specifically for the better audio, but it's terrible! Not only does the speaker sound way too bass heavy, but it drops audio multiple times a day on my Everywhere network.I don't believe that it's an internet connectivity issue as I have excellent wi-fi with only a few devices connected, the plus is only 8 feet away from the modem, and none of my dots in other rooms have any issues. I have tried resetting it, moving it within feet of the modem, different streaming sources, etc It keeps dropping audio no matter what. Meanwhile, if you ask it what's playing (and it understands you for a change), it will tell you what's playing, but no music comes out.Also, of all my echo devices, the echo plus has the worst comprehension by far! Per other reviewers, I've moved it down to a coffee table and made sure that it wasn't trained to my voice, but it still fails to understand virtually every instruction!I could have purchased 6 new dots for the price of this chunk of e-waste. I really wish that I had!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Drops audio constantly, doesn't understand 2/3 of requests\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 22, 2018",
            "id": "amzn1.account.AGUY7SDJGZD334TW64DTWXB6PYJA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGUY7SDJGZD334TW64DTWXB6PYJA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Echo Plus Stereo/Sub pair setup is extremely buggy and unreliable for playing music. The following all happened on the first day of owning this:1) MOST of the time when I ask for music it only plays through the 1 echo, and NOT the stereo + sub. The only guaranteed way to get stereo + sub is through the Alexa app and not voice command.2) I'll say \"Alexa stop\" and it'll stop playing music, then I'll say \"Alexa play\" and instead of restarting or playing new music it'll say \"Not currently playing music\" and not play anything.3) Sometime after starting music it will play at at low volume for 20+ seconds as if Alexa is listening.4) After pausing music, when I restart it can sometime take 20+ seconds before playback starts.5) Music has occasionally just stopped playing for no reason, despite having songs left in my queue.6) Remote doesn't work while music is playing, only when it's not playing.The quality of the sound is very good for the price, and once (if) they fix the bugs it'll be a terrific setup. But the voice command implementation for stereo + sub is poorly implemented and the bugs are extremely frustrating so for now my advice is to stay away.Update: After 3 weeks issue 1 is still happening so dropped to 1 star. Amazon say they're looking into it but unless it's fixed this will stay at 1 star as it's extremely frustrating. Also added a sixth issue above regarding the remote with the stereo/sub pair for those considering buying it.Update 2: After 2 months issues 1, 4, 5 and 6 still occur regularly.Issue 1 can be mitigated by saying \"play on stereo sub pair\" or if it's in a group \"play on <group>\". Note that setting up a group with left and right echos added and the stereo sub pair as the preferred speaker seems to improve things but the issue still occurs.Also found another issue, this time with the multi-room music functionality: If I play on the multi-room setup via the Alexa app and try to interact with Alexa by voice if will often say \"No music playing on this device\" and ignore the instruction.Amazon's customer support have been great as usual trying to help and keeping me up to date with my bug reports, but the team that developed this should be ashamed of themselves, it's poorly implemented and poorly tested. A prime example of rushing the software out and letting the paying public do the beta testing. Fully deserves its single star.Update 3: After testing for the last month I can say issue 1 is now fixed, it hasn't occurred at all recently, and that was by far the most annoying bug.The biggest issues now are:- The sound randomly cutting out midway through a song, the only way to fix is to skip to the next song.- The multi-room setup is flaky, sometimes I'll have the echo in the current room respond, and a few seconds later a linked echo in another room will also respond.- It can still take up to 20 seconds to restart music after pausing.It's slowly getting there but it's been a very frustrating journey, and for that reason I doubt I'll ever go over 4 stars even if everything is fixed. As it is I'm increasing it to 3 stars.Update 4: It's been 7 months. The problem with music suddenly cutting out randomly has come back. I'm done with waiting for fixes, after 7 months it's still flaky. Dropped back to 2 stars. As a software developer with over 20 years experience, I can categorically say that Amazon's developers don't have a clue about developing quality software.Last update: After 10 months my final rating is 1 star. Even after all this time the stereo/sub setup is buggy and frustrating. The Amazon Echo developers are, in a word, incompetent.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Stereo + sub setup is still buggy after 7 months\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 19, 2019",
            "id": "amzn1.account.AGMKNL2RS7WUYXEEVIXAUKNZ4SBQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGMKNL2RS7WUYXEEVIXAUKNZ4SBQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Ok,why? Because the Alexa voice volume is atrocious. Listening to music at level 2. Ask Alexa the time. Answer is given at level 3 or 4. Extremely annoying. This is especially bad at night. Quietly listening to audio book. Ask for tomorrow’s weather and the neighborhood knows what to wear. Have spoken a few times to Amazon tech support. They have been able to replicate the problem, but as yet (2 months after purchase) have not been able to fix it. Make no mistake, when it does play, it sounds great. Just LOUD. Why not get a replacement you say? I have. Same problem. If I had known these problems would persist i would have gotten a Bluetooth speaker instead. Then use an app. Also, be aware that “smart speakers” aren’t that smart. Example. Listening to audio book but would like to go back 15 seconds to hear a particular word I missed. Nope. No can do. Alexa doesn’t know what i’m talking about. Many more examples. In fact too many to list. Again, stay away from these.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    WARNING! Do Not purchase.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 9, 2018",
            "id": "amzn1.account.AHXHFZTZVJBQY3CRVKIAL25QFYTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHXHFZTZVJBQY3CRVKIAL25QFYTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I preordered a pair of the new Echo Plus smart speakers and was excited to start using however since receipt we have had many issues. The speakers have trouble pairing, they will disconnect from each other, they will not play in sync, and pairing with the sub did not even work for the first three weeks. Now it pairs with the sub but it will cut out almost on every song that is played. While these visually look appealing they lack the proper functionality that you would expect from a product that costs this much.Hopefully Amazon will try and improve these with software updates but they should have never been sent out in the state in which we received them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Better looking than the pervious generation but lots of bugs to work out.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 23, 2019",
            "id": "amzn1.account.AH5SCPTXWYBUFOZTP3ONVIE2TWWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH5SCPTXWYBUFOZTP3ONVIE2TWWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have 4 of the pluses! For the most part I like the sound of them. They sound very good. I had no issue with just unboxing the units and plugging them in! The units connected to my Wi-Fi with no issues. It does take about 45 Minutes for the Temperature sensor to come online. Then I noticed it is about 1.5F lower then all my other thermometer in the house. This looks to be the case for all 4 units. I didn’t find any way to be able to a-just them to correct the reading. They also seem to take some time to change as far as the reading. If I could give the Pluses a offset to use for the Temperature to correct them! Then I would be very happy with them. Not tried out the Zigbee hub in any of the units yet. I don’t have any devices that talk Zigbee.I like the fact if you have 2 or more Echo Pluses! You can ask what the house Temperature is and it will then give you the average Temperature of the house.I also like the fact I can use thebuilt in Temp to be able to control my ceiling fans through the Bond home fan controller.** Update 2/13/2019 **In testing the hub some more found the followingThe Echo Plus will not read Temps 32 and below. So if you want to get the temp outside on a cold winter day! This will not work.If you have a sensor with a Humidity reading! Again the Echo Plus will not see it at all.If you have any sensors that report there battery status! You will be out of luck using the Echo Plus hub. It will not even show it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Temperature sensor could be better. Looks to be about 1.5 degrees low!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 7, 2019",
            "id": "amzn1.account.AG3G4S5JCV7QLSBRZUWKAEJLMW3Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG3G4S5JCV7QLSBRZUWKAEJLMW3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought this to add voice control to a number of smart home items and this product is very underwhelming. I purchased the plus model for the “premium sound” and the array microphones because I wanted the best sound and recognition. Unfortunately, this falls short by a long run. Alexa barely can hear any request, always telling me she doesn’t recognize lights because she can’t  hear hue, or she just beeps and doesn’t do or say anything. Also, asking her to play music is a very difficult task. She will just play a random song that is nowhere near what you said. Running in to the sound quality, it sounds like a single cheap built in TV speaker. It can barely make a presence in a 12 x 14 bedroom. My 3 year old JBL flip is 3x louder which is smaller and runs on battery and sounds way better in highs mids and low frequency. The JBL doesn’t even have a dedicated tweeter like the echo does. I have friends who have the original echo and it has way better sound.Overall this is definitely a bad buy for the $150 it was. Probably will return it and get a different brand for at least $50 cheaper.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Very disappointing\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 17, 2019",
            "id": "amzn1.account.AHH5KTEP5S5OHWP5HMD6IZQPJQSA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHH5KTEP5S5OHWP5HMD6IZQPJQSA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Part of my 1 star rating could possibly be due to me not reading the whole description. However the description could be deceptively avoiding the subject that when purchasing 2 of the echo plus and the subwoofer it does not work with your tv. I was able to get one speaker to connect to Apple TV. But the whole 2.1 system does not work. This was super sad because I am super impressed with the echo plus as a stand alone speaker and the ability to turn it into a travel speaker with a battery powered base. BUT ABSOLUTELY DO NOT BUY THIS IF YOU WANT IT TO BE DUAL PURPOSE AND WORK AS A HOME THEATER OR SUBSTITUTE TO SOUND BAR. IT DOES NOT WORK THAT WAY. WHO WANTS TO PUT A SYSTEM TOGETHER  THAT ONLY PLAYS MUSIC. WASTE OF SPACE , TIME AND MONEY ! I ended up buying a Polk Audio  mini home Theatre system and saved $150\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Do Not Buy if You Want It To Do More than play Music!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 28, 2019",
            "id": "amzn1.account.AGAJY4R5X55WEIIHNLHT75GEIEAA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGAJY4R5X55WEIIHNLHT75GEIEAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This ECHO PLUS product arrived with issues.  The voice activation worked when it wanted to, and seldom beyond 15 feet away. I missed the 30 day window to return for full refund.  I though that Amazon would kick out a software update and it would be working fine.  That never occurred.  48 days after purchase, I finally decided that I had enough, and requested help from Amazon Customer Service.  They wanted me to mess with my router and changed the channel  to 1 or 16.  They tried to blame it on everything except the device.  After much back and forth, they agreed to send a replacement.  The replaced was cosmetically unpleasant (damages - nicks and discoloration everywhere).  I contacted customer service and told them this was unacceptable.  They wanted to send out another refurbished product with the only guarantee that it will work (nothing about cosmetically sound).  It's too late to get my money back now, but I will change the wake word to something I never use and just use it as a bluetooth speaker.  As far as the sound quality goes, it is acceptable as Radio Quality sound.  There is a severe lack of bass without the subwoofer and a second Echo Plus.  If you want the best sound look elsewhere - Bose, Sonos, HomePod, maybe.  I think the HomePod is better quality (and cheaper price) than 2 Echo Plus 2nd Gen with Subwoofer.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Save your money. Don't buy this garbage.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 12, 2019",
            "id": "amzn1.account.AHRWOAGJ5ZRJMF6SKLLY6OAO2AWA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHRWOAGJ5ZRJMF6SKLLY6OAO2AWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Pro bundle with Sub OverviewPro: Quality Built, Quality Sound, Functionality, Small form factor, Volume (low and high), Perfect amount of BaseCons: Connecting all three to act like a system is finicky and dosen't work when you set it as an alarm.  Only will play off one so you miss out on some of the rich sound when waking up.  But a plus since it isn't as loud.Long Review:I have to say these are amazing.  I have had a lot of amazon products and these surprised me the moment I started them up.  First off these get loud for their size and the audio clarity is amazing.  They are crisp, clear and sound amazing.  Now if you like heavy heavy base then these aren't the speakers for you.  I bought the package with 2 speakers and the sub and they are perfect for me.  The base is well controlled and gives the sound that is lacking in many speakers but if you want the base to shake the walls and make it sound like a floor speaker with a 12 inch amplified drum then don't try.  But if you are looking for a clean, rich, bold and sophisticated listening experience then these are amazing.  Much better than anything I have tried in the $350 price point.If you want something that is loud, base heavy with good high and mid tones better than this then look at spending 700 or more.  I listen to everything from classical music to EDM, Rock, rap, pop, country, jazz and folk and these just keep impressing me.  The vocals aren't drowned out and you can hear all the instruments and the base fills in the lows at the perfect listening experience.Summary:  If you are looking for rich, deep, bold music this is the set for you.  Better than anything in the 350 to 450 market.  (I have tried 20 in this market) If you are looking for wall pounding, rave quality base then you better live on your own or in a frat house cause more than this you will need a floor speaker with amplifier and thick walls.  PS I own a full amplified speaker set housed in my living room for when I was in college and a fraternity.  Nothing against them but horrible for all day listening and having friends over to talk and not drink all day hahaNote: I have both echos and the sub in my bedroom and the room is too small for all 3.  I barley raise the volume past level 3, maybe 4 if I am listening to them in the shower.  I moved them to my living room for the pre and post Superbowl party and they filled a medium 4 bedroom 3 bath house with crystal clear music.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Quality Sound\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 17, 2019",
            "id": "amzn1.account.AEZ3Y2WTH2M4CU52KVNAYGZTWO5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZ3Y2WTH2M4CU52KVNAYGZTWO5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Don't waste your F&$#ing money on these pieces of $hi$.  They never respond and the software is a comical sideshow.  Amazon claims they are the future and they are not.  They can't pickup your voice an inch away or a mile away.  Stop being lazy and take back control of your home.  Because when you need them to work they won't.  They get progressively worse and are a complete waste of money.  Don't do it!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    F&#$ Amazon and F&%$ Alexa\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 15, 2018",
            "id": "amzn1.account.AGXRY64ZWW6Y2K5XD44EW52TRHKA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGXRY64ZWW6Y2K5XD44EW52TRHKA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    to no surprise, the sleep timer doesn't work on this like the 2nd gen echo. I've been back and forth trying to get it fixed but it's something the devs have to fix and it's clear it'll take some time.however, the speaker quality is amazing on this. I watched a few shows and it sounded like I was in a movie theater. there is a super slight delay though (I'm using the line in feature, something new I believe - super useful, should have always been a feature).one last thing I find useful is the room temperature feature. I dunno if this was in the first echo plus, but it's nice to have.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    very nice with a couple small issues\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 21, 2019",
            "id": "amzn1.account.AFD5SGJTTBYG5VYUBK6VCVV5M7EQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFD5SGJTTBYG5VYUBK6VCVV5M7EQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I think it's kind of important information  that this is NOT a standalone item that pairs directly to your WiFi. It requires you to load an Amazon Alexa app on your PC and your PC to operate in WIFI. Well my PC operates on either but not both simultaneously. Because I watch video and game WiFi is a poor cousin to a wired connection. I returned it. I did not want the app installed on my PC and did not want to be running an inferior WIFI connection. I felt that this is the FIRST piece of information they should give. Some people might not care that they are forced to halve Alexa on their phone. I don't want it. It was supposed to be a standalone item but is really just a voice recognition outlet for an app running on another device. FAIL Returned\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    You need your PC to download Alexa and to run on wifi, or to install app on phone\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 29, 2018",
            "id": "amzn1.account.AEGOGHH2EXQPNZBH37SDZ7BSDMSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGOGHH2EXQPNZBH37SDZ7BSDMSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I currently own a 1st gen echo, a 1st gen dot, multiple 2nd gen dots, a Fire TV Cube, and now this. I bought an Echo 2nd gen when they came out. Received it, and was extremely disappointed with the sound quality. I returned it within 2 hours of setting it up.The Echo Plus 2nd gen blows the previous units away. I get crisp, clear sound with plenty of bass. The volume is great, and the mic array is fantastic (I admit, the mics were great in the 2nd gens too). She hears me from all over the first floor where the unit is centrally located, and sometimes from the second floor. No need to shout, the mics are sensitive enough. I can also play music on the max setting, say \"Alexa\" in a regular tone (I can't even hear myself say it), and she'll pick it right up.Our 1st gen Echo was getting a bit hard of hearing and was retired to the basement. She still plays great sound though. The 2nd gen mic array and enhanced stereo was a great upgrade.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Much better than Echo 2nd gen\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 23, 2019",
            "id": "amzn1.account.AGE7J4OTMTGJNM6KQ4GUZGCJ5FLA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGE7J4OTMTGJNM6KQ4GUZGCJ5FLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have 2 first generation Echo's and 2 second generation Echo's.  I have always thought for the size and its purpose, these were great to listen to, especially if you paired two together.  I recently bought an Echo Plus for my Mom and did a double-take when I got it up and running and playing a little Red Hot Chili Peppers .  I also have a Sonos and I'm going to say this is as good if not better.  Why... because I don't have to deal with the fickleness of Sonos, its annoying at times and for anyone thinking I don't know how to set it up correctly, I have over 60 devices paired (Hue lights, Sonos, Smart Plugs, Wemo, and more).  So yeah, the only one that always has issues is Sonos.  This Echo Plus sounds so good, I'm thinking of replacing my other 3 Echo's.  Its also incredibly responsive,  more so then the one I replaced it with.  I especially like that when I have the music turned up, it still hears the wake word.  As for my Mom, I have a few lights set up, probably more in the future, what I liked was telling Alexa to \"find my devices\" and it was done in a few seconds.  My mom thinks its \"magic\" and how did you do that....heh!  I would highly recommend the Plus for the excellent sound quality, even if you don't need the hub.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Impressive sound\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 17, 2018",
            "id": "amzn1.account.AFEBZEABT374YF5AQBZXCXZMVDUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFEBZEABT374YF5AQBZXCXZMVDUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I thought it would be hard to improve the sound from my first Echo in such a compact unit, but they accomplished that in this Echo plus. I have used the built in hub yet, because I mainly use it for music when I'm cooking. But I'm sure I'll eventually venture into the Alexa controlled gadgets before long. I'm completely satisfied so far and I don't expect that to change. If you're even thinking about buying one, go ahead and do it, you won't regret it. Thank you guys and God bless.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Surprisingly better sound than my first Echo.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 23, 2019",
            "id": "amzn1.account.AEGRLJF26U3MKQA3MVQFLWEDN2WA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGRLJF26U3MKQA3MVQFLWEDN2WA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Setup:Two Echo Pluses (2nd gen) placed 2.5m apart on a dresser (in the same room) with an Echo Subwoofer on the floor to the left of the dresser.The two echo's often get confused and stop would as a single unit would.  If you say \"Alexa, do this\", sometimes the first Alexa replies and sometimes the second does.  The problem is that they do not necessarily realize that one has already replied.  If Echo one asks a question, sometimes Echo two hears the reply instead of Echo one causing Echo one to get stuck in a loop.Sometimes the two echos break stereo sync and require HW power cycle to get it together.  One of the echo may lose the ability to \"Understand\" when in this state (this is NOT a wireless signal issue).If you set a timer on these Echos, Echo one may set the timer and Echo two may then answer all other queries.  Echo two is not aware of timer on Echo one.  As such, Echo two cannot list, stop, or reset timers on Echo one even though they are \"one unit\".  A master/slave situation should exist when Echos are setup in stereo pairs (they are ONE unit).  Turning mute on one of the Echos helps, but the mute light is distracting and annoying.In short, the sound quality gained by the stereo pair does not warrant the extreme annoyance of the buggy interaction when two Echos are placed 2.5m apart in the same room.Amazon seriously needs to work on better detection code to determine which Echo I am talking to in a multi-Echo home setup.  Their implementation is horrid in close proximity (as above) and bad in simple multi-room use cases.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Review of Double Echo/Subwoofer Setup\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 22, 2019",
            "id": "amzn1.account.AHXCP7QZXE74732B6OA7RL46H7PQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHXCP7QZXE74732B6OA7RL46H7PQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Good sound, easy to set up, attractive/subdued hardware, cloud based AI works well for us, needs better client firmware, admin software apps.More details on our cons, as the pros have been covered by many other reviews.- cannot be set up from ethernet connected PC, requires either mobile app or wifi PC- whisper mode is cool, but rarely works - the volume between \"too soft - can't hear me\" and \"not a whisper - use normal volume\" makes it very hard to get the whisper reply- bummed that the smart home connectivity for Hue bulbs is limited to so few capabilities compared to a dedicated Hue hubWe have had several Echos over the years, and this is a replacement for an older generation, and I hope this one avoids the problems we have had with those, because they are now essentially paperweights:- a recent firmware update (sometime in the last 3 months) killed the ability to connect with our router's 5GHz or 2.4GHz wifi, either as an existing, new, or factory reset new device. We had two identical ones, both replaced by these. One went to the garage where it was rarely used, noticed it was not connected about 2 weeks ago, but figured it just needed a reboot; however rebooting it didn't reconnect it. I hadn't used it in a while, figured maybe it died from the cold or something. The second was in storage in the house, so I got it out to use instead, and it powered up and connected to wifi fine - I checked weather, etc. to verify it was ok. I left it alone a few hours, it got an update and restarted, and was then in the same boat as the other one - no wifi connection can be made with any combo of settings I can try, but it does connect to the Android app via the Amazon wifi step of setup, so the hardware seems fine. All our newer Echos - Echo Plus, Echo Sub, Echo Show, Echo Show 2, work fine with the same settings.- the Android Alexa app pops up an error message when wifi connectivity fails during setup, which covers the first two input fields on the page (network name and password) and can't be dismissed, making it difficult to edit the form without killing the app- the Android Alexa app flips the phone from standard WiFi to a peer-to-peer Amazon Wi-Fi with the  Echo during setup, and killing setup or failing setup leaves the phone unconnected to the internet unless you go back and reselect your normal WiFi network in Android settings- support was free, but very slow (3+ minutes to type each response, I think they were in multiple simultaneous chats), and ineffective - they just followed the flowchart, ignoring what I told them I had already done, and asking the same questions over and over; the only new thing they had me try was the factory reset paperclip button, but it made no difference.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Hope it lasts\n  \n"
        }
    ]
}