{
    "reviews": [
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 12, 2018",
            "id": "amzn1.account.AEPQZF5IT3YLGRFRAUXYHFSSC77A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEPQZF5IT3YLGRFRAUXYHFSSC77A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I picked up a copy of this book because my students were reading it for their English class and I like to throw them off by slipping literary references into Algebra class. I figured it was a short book, it wouldn't take along time, and it would give me a sense for what they were learning in their other classes (and maybe spark some cross-curricular ideas!)Oh man, was that a mistake. It didn't do any of those things (and apparently kids these days don't actually read their summer reading, what a shame). Instead, I fell deeply in love with this book and have read it three times in the last two years. It's the kind of book that works on more than one level - you have your hero who goes on an adventure, learning from a wise mentor, hitting roadblocks, coming to know himself and the world around him before realizing that his true treasure was in himself all along, and if that's all you get out of the book, then that's fine, but there's more going on here.The difficulty of the book is figuring out what that more is. The book constantly suggests and hints at lessons that seem at once a comment on ethics and metaphysics, history and anthropology, post-colonialist critique and folk fairy tale. Biblical allusions abound next to Islamic lessons on the nature of God while institutions and mysticism are equally likely to be evoked and revoked. There's always the sense as you read that there is something lingering under the surface, but the minute that you try to grab it (or write it in a review) it seems to disappear.That seems to be the point of the book, that the message is clear if you read it without trying to grab it. Hold it loosely and it comes easily, try to describe it and it flits away. The book is allusive; it works on you without seeming to, and at the end you're left both satisfied as the adventure concludes and also wanting more, or perhaps wanting to do more. Perhaps that's why I like this book so much - it doesn't yield its secrets easily, or perhaps it yields it too easily, and you finish wondering where your heart and your treasure lie and what your personal legend might be. I imagine that this book might say more about its reader than its text: when you know your own heart and your own journey well enough, perhaps this will only remain a passing, although enjoyable fairy tale.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Engaging read, worth reading more than once, excellent shelf copy if you like that sort of thing\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 15, 2018",
            "id": "amzn1.account.AHZMSF7LAIX4G5WWNXCOXBTQWTKQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHZMSF7LAIX4G5WWNXCOXBTQWTKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A book with an overwhelming number of positive reviews was surely bound to be a great read, or above average at worst. Boy was I wrong. It's definitely up on the list of worst books I've read. Fortunately, I learned a lesson far greater than what the book could teach me; Amazon reviews do not determine the quality of a story.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Blinded by the positive reviews\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 18, 2018",
            "id": "amzn1.account.AEGC333Q7ZTE763HZTV7ZLOJ6T2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGC333Q7ZTE763HZTV7ZLOJ6T2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So, I'm on a part of my life right now where I'm 25. A year fresh after graduating, and have a new found love and appreciation for books. I'm in such a place where I'm trying to discover what I am supposed to do. I'm a spiritual person, and I really felt that this book is talking to me. I'm sure everyone would resonate differently with the book. But the theme and the message is there.I'm not done reading it yet, but when I started. I read like the first 80 pages nonstop. Really soak in the message and lessons. I can't wait to finish this book.EDIT:So, I finally finished the book. And wow, never would have I thought, a book would have such an impact on me. It's a simple tale but filled with lessons if you are seeking it. I read it in like 3 sittings. I'm not much of a reader and just starting to appreciate it, and I am glad this was one of the books I read. Love it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I COULDNT PUT IT DOWN.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 18, 2018",
            "id": "amzn1.account.AGDEWWEU4OHV6LZCZ3QYL7MFQXVA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDEWWEU4OHV6LZCZ3QYL7MFQXVA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This book was a poorly written schlock of new age rubbish.  It started out ok but then about the 10th time “Personal Legend” was teferenced it lost me.  The narrative is ok until the boy leaves the crystal store and then it’s just unreadable.  I really don’t see anything deep or profound here other than persevere I guess and you’ll get what you want.  Whatever.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not good at all\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 13, 2017",
            "id": "amzn1.account.AGLIX3XL5HHULQZI3LUIQ4JOZPUQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGLIX3XL5HHULQZI3LUIQ4JOZPUQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It seemed like this book was written for a sixth grader. Did not live up to the hype.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Waste of Time and Money\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 9, 2017",
            "id": "amzn1.account.AHMFM5P7PTGC5HBNZSB7WXMQD4KA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHMFM5P7PTGC5HBNZSB7WXMQD4KA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This is literally where it all began, my story intertwined so thoroughly with that of the young sheepherder that I was mesmerized and unable to put it down. If you look through my purchase list you will see I didn't stop here - I became obsessed with Paulo Coelho's work and have purchased almost all of his writings. This is my go to gift for all friends, acquaintances, and family members. Words that can be cherished a lifetime and continually brought back to throughout your journey. Do not hesitate to purchase this. SERIOUSLY! If you are on this page considering, BUY IT NOW. It will awaken pieces of you that you are certainly ready for. Welcome to the journey :)\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This is literally where it all began, my story ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 24, 2016",
            "id": "amzn1.account.AH4ZPZZ6NMYXMICMQXWTV6RCIO7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH4ZPZZ6NMYXMICMQXWTV6RCIO7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I purchased and began reading this book 2 years ago and, for whatever reason, I couldn't get into it.  I found it incredibly dull and tedious and finally gave up halfway through.A few weeks ago I took my mother to a dental appointment and opened my Kindle to see what I had available while I waited.  I decided to give this book another try and started from the beginning, as I couldn't remember anything from what I read previously.  I'm not sure what was different this time around, but I was completely engrossed and my 2 hour wait flew by!  I continued to read whenever I found a chance and finished it within a few days.  I now find myself constantly thinking of the story and relating it to my own life, as well as my friends and family.It's a short and very simple story, but definitely worth reading!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Now I see what all the hype was about...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 9, 2018",
            "id": "amzn1.account.AGH23V3LVD5SLT7N6P43RBP2CWIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGH23V3LVD5SLT7N6P43RBP2CWIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Really was expecting something life altering. My dog chewed up the book when I was 18 pages in and I should have let her finish.Maybe I miss the point. Kinda like Dave Ramsey’s stuff—if you’re already living life like you should then this tale is monotonous.You can read the synopsis. The story is ludicrous from the beginning, but I persevered through the gypsy and the king and the desert and the oasis and then the alchemist. Treasure? Like it had been under his nose all the time and because he was so in sync with the world and learned all these things he found it buried in his own back yard and went back to get the girl—just another he’d run into with a pretty face. Good grief.This is my take. Instead of the sheep and Bedouins and emerald tablets the author would have been better putting his magical life altering quotes in a little book. Some people may need the tale. I am religious and don’t get the relationship of God and turning oneself into the wind.Lola gets this one back as a chew toy. Not going on my library of keepers.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Seriously. Just make a little book of the 10 “best” quotes and forget the story.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 26, 2017",
            "id": "amzn1.account.AGQZM76Q2PDMDFD4SGDGUMVBRDOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGQZM76Q2PDMDFD4SGDGUMVBRDOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    To put it simply, this book changed my life. The author is overtly religious, and even though I am not, I admire the messages of this story in my own way. I think that this book would have had a profound influence on me no matter what state (good or bad) my life was in when I read it, and I would recommend it to anyone. There were many parts that I read over two or three times -- not because I didn't understand, but I was so amazed that I found myself wanting to experience a passage again.The vendor that I purchased from, Bullet's' Bonanza's, was extremely kind and professional, including a personal note in the package. I would gladly do business with them again.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    and I would recommend it to anyone\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 21, 2018",
            "id": "amzn1.account.AFFBNOJNMAQS6G7HD36SILXWSHBQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFBNOJNMAQS6G7HD36SILXWSHBQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This gift edition is beautiful.It comes in a lovely 'box' holder with a ribbon cover over it. It's the ideal gift set.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Beautiful gift edition. Highly recommended.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 6, 2019",
            "id": "amzn1.account.AHF5NTSGVKI7CPBJ4IAFOIABKZOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHF5NTSGVKI7CPBJ4IAFOIABKZOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If I had known that this \"famous\" book was based on the \"Space Fairy Story\", with \"God\" and \"...the baby Jesus,\" I would never have considered wasting my time (and money) on it. I could barely get through the Preface. It's just more innuendo piled atop the already too-high pile of religious brainwashing. But yeah, sure, if you need to reinforce your ridiculous notions of god-based faith, you'll find a 7-course meal here.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    What A Pantload\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 16, 2017",
            "id": "amzn1.account.AGGMZ5XHRBIWWVQ5LJZ24EW3DT3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGGMZ5XHRBIWWVQ5LJZ24EW3DT3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Didn't like it in the least. I know others have loved this book but what a crazy way to get to the message. There are far better books out there that accomplish the same thing with a story that flows better and not so weird. I think something is lost in the translation.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Yuck\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 31, 2016",
            "id": "amzn1.account.AEJRV7PZHO23K66PARJ4DOCXKKLQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEJRV7PZHO23K66PARJ4DOCXKKLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist is a gripping narrative about a young Andalusian shepherd named Santiago and his journey to find the greatest treasure in the world. This charming story follows Santiago on his journey to Egypt, after having a recurring dream of finding treasure there. Santiago travels across great distances and encounters crazy adventures in his quest for gold. Little does he know that the ultimate treasure is actually found deep within.This dream was so prophetic that Santiago genuinely believed this was his ultimate goal in life. After deciding to travel to a Romani fortune-teller in a nearby town to discover its meaning, a gypsy woman tells him that there is a treasure in the Pyramids in Egypt.Towards the beginning of his journey, Santiago meets an old king, named Melchizedek, who advises him to sell his sheep in order to travel to Egypt. He also introduces the idea of a Personal Legend, stating that your Personal Legend, “is what you have always wanted to accomplish. Everyone, when they are young, knows what their Personal Legend is.”The Alchemist Physical CoverAlong the journey, Santiago meets an Englishman who is in search of an Alchemist and together they continue their search for treasure. As they travel through the Sahara desert, Santiago meets and falls in love with a beautiful Arabian woman named Fatima. After a brief period of time, Santiago asks Fatima to marry him, but she tells him that she will only marry him after he finds his treasures. Perplexed by this, Santiago later learns that true love will not stop one’s Personal Legend, and if it does, it is not true love.Eventually Santiago meets a lone alchemist who teaches him about Personal Legends. He shares his wisdom that people want to find only the treasure of their Personal Legends but not the Personal Legend itself. The alchemist states,“Those who don’t understand their Personal Legends will fail to comprehend their teachings.”If you are looking for a book that will inspire courage, this is the one. No matter what your dream, goals or visions are, the universe will conspire to help you achieve the things you want, regardless of how insurmountable the task seems. You must live the life you truly desire to its fullest extent if you want to look back on a life having worth lived.The essential message is that treasure is more worthy than gold.Read more here: [...]\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    My favorite book of all time!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 13, 2018",
            "id": "amzn1.account.AHNWO4I4RHXVATBFNGPXG2Z2U4RQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHNWO4I4RHXVATBFNGPXG2Z2U4RQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have no clue what are all these great reviews about?!?- The main character is very confusing and never fully develops. Sometimes he talks like a very learned individual and other times he is lost completely.- The story? I mean was there even a story here? Its like the author just wrote down a completely unorganized dream.- Nothing ever matures in this book. Not story, not character...nothing!- i don’t know if things are lost during the english translation but this book has absolutely nothing as far as i am concerned.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I had to force myself to finish\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 7, 2018",
            "id": "amzn1.account.AHJ5JHMLOBDIA23S7NKGHSBIFNDA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHJ5JHMLOBDIA23S7NKGHSBIFNDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I do not understand what all the hype is about. I wanted to like this book. The author hit you over the head with the lessons it wanted you to take away, but instead of telling an intricate story about the Shepard following his dreams and shedding light on self discovery, he proceeded to spew generic and desperately inspirational quotes and self contrived theories on how life and spirituality works, and it gave no faith in the audience to figure out these things on their own.  Very elementary, the writing offers no intellectual stimulation. This book is suited best for students in middle school.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Uninspired book trying to hard to inspire\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 5, 2019",
            "id": "amzn1.account.AFUZMT66VWPQKQ4B34US35SAAZTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFUZMT66VWPQKQ4B34US35SAAZTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    As a brazillian I felt compelled to read this book even though it is already 30+ years old since first published in Brazil.I've heard about this book and Paulo Coelho since I was a kid. I've watched several interviews of him in the brazillian media throughout these years, and I always found him a bit of a crook with his \"magician talk\". Anyway I decided to give it a try.  After all, just like the \"Elvis is still alive\" myth, tens of millions of fans cannot all be wrong at same time. Right?To be completelly honest, I really wanted to love this book, but what I've found is it is actually rather bland and overall disappointing considering all the following the book and the author have. It simply did not live up to my expectations.Yes there are some good life lessons in there (hence the 3 stars) but because the sheer amount of positive reviews about this book I ended up approaching it with an inflated expectation. Being one the most sold and translated books of all time, I was hoping \"The Alchemist\" to be life changing, world shattering, an eternal classic, or at least a book that would be very inspiring and I'd remember for a long time and could recommend with flying stars to all my friends.Sadly, the book came up short on several fronts. It is not written in an engaging fashion, the author is not capable of transporting you to or immersing you into the mystical places where the story happens, the narrative sometimes becomes \"jittery\" jumping from one character or setting to the other up to the point I had to re-read some passages to be sure where I was standing in the story.  The ending is also rather bland... Just to name a few of the shortcomings.Perhaps all of this is due to the fact this was the author's first work?  Im not sure...Overall I'd say the book is not a complete throw away, there is some value in there, but it is way overrated IMO.Bottom line is that in being overrated, I approached it with a huge expectation which went frustrated and that reflects my medium to low rating.Im still not quite sure why so many positive reviews about it...Perhaps it is just me and my rather inflated expectation or even negative bias towards the author, or maybe it could be also that the world is filled with people who are desperate for the most simple and basic encouragements like the ones the book provides (follow your dreams, dont give in to fear etc...).In that case, maybe (just maybe) the book might be a good example of why the self-help industry thrives on these days, preying on peoples desire for finding meaning and purpose in life.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Disappointed\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 8, 2015",
            "id": "amzn1.account.AHR4UVQN37MPKXNMHZMDI65KMDIQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHR4UVQN37MPKXNMHZMDI65KMDIQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The book condition was perfect and arrived very quickly, so no complaints there. I will even give points for the book binding and the paper used. As for the content, however, this book is awful.If you want a spiritual journey with depth read Siddhartha, or the Lord of the Rings, or Harry Potter, or a host of stories from Christianity, Islam, or Judaism. If you want Dr. Wayne Dyer's platitudes wrapped in the most overt metaphors and cliches humanly possible: buy this book. The premise of the book can be summed up in one quote:\"[W]hen you want something, all the universe conspires in helping you to achieve it.\" Other ways you might sum this book up are: \"Be all you can be.\" \"Just do it.\" \"What the mind [or heart] can conceive, it [will] achieve.\" \"Live in the moment.\" \"The answer lies within.\" One of the most climactic moments in the story is where Santiago--who has been learning to convene with \"The Soul of the World\"--stands on top of a dune and becomes one with the wind. The problem is, that even as a work of fiction and not an *actual* self-help book, the story comes across as shallow and so overtly New Age that it borders on the ridiculous. Coelho (mis)appropriates religious texts at his leisure and binds them to his thesis that the \"Language of the World\" is that all things are one.Moreover, magic and the supernatural as elements of good fiction are one thing (e.g. anything by Toni Morrison or Gabriel Garcia Marquez's, One Hundred Years of Solitude) and The Alchemist incorporates those certainly but what the book lacks is subtlety. Coehlo's problem (cliches and platitudes aside) is assuming a remarkable lack of intelligence on behalf of his reader. All the metaphors are laid out and every lesson is the same: follow your dreams, er, I mean your \"Personal Legend.\" Even the capitalization is ridiculous and gives a faux sense of importance to ideas that are so vapid they would be funny if Coehlo did not peddle them as legitimate.I cannot stress enough how terrible this book is. From preposterous romantic drivel to all the babbling about listening to one's heart, you'd be just as well off watching day time pop-psychologists. The problem with platitudes and cliches is that in times of actual distress, suffering, pain, anxiety, worry, doubt, loss, etc., they are shown for what they are: nothing. And in a way this book is dangerous because it risks convincing us that nothing should stand in the way of what we want and that our only guide is our sense and the ability to \"read the omens\" (whatever that may mean). This risks making others pawns in our game of self-defined self-fulfillment and does nothing for those who have desperate, pressing needs, and who cannot be succored by some half-baked consolation that \"the universe\" is conspiring for them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Cliches and platitudes abound\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 19, 2017",
            "id": "amzn1.account.AGSVONYKGLXGLFGO4PNU27HDVQFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGSVONYKGLXGLFGO4PNU27HDVQFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I simply couldn't read it.  So utterly bland and lifeless.  It felt as if someone was shoving the story down my throat.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I simply couldn't read it. So utterly bland and ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 9, 2019",
            "id": "amzn1.account.AGILCRTKJB5SPNPRHAO5VG2EPH5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGILCRTKJB5SPNPRHAO5VG2EPH5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I am making a lot of changes in my life, and figuring out what I want to do, who I want to be, etc. So, my friend highly recommended this book to me.I do not like fiction, but I thought the book could help give me some wisdom and insight, so I gave it a shot. I read to about page 100, but even the first few pages were absolutely boring. The character wasn't relatable, the plot or storytelling wasn't engrossing, interesting, or written well, and the religious undertones weren't for me.I'm in my mid-20s, and this book reminded me of something I'd have to read for summer reading in middle school or high school. This book might be good for those interested in a Shepard roaming Africa and the Middle East in search of himself, BUT this book isn't good for any adult searching for themselves, or looking for something entertaining and readable.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Couldn't Even Finish\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 9, 2019",
            "id": "amzn1.account.AFBNKA7QHDWIVKVLAUY7SJAUSBPA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFBNKA7QHDWIVKVLAUY7SJAUSBPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    There was a time when I would probably pick this book apart and criticize its theology in a haughty fashion. These days, I instead find this book dangerously inspiring. The premise is that everyone has their own unique grand treasure to pursue, their own Personal Legend, and that the universe conspires to help them in their quest, if only they stay focused on the prize and don't give up when the universe also tests their desire for the treasure. Spoiler alert: The book is about a shepherd boy whose treasure is unknowingly right where he is at, but he has to travel the world to find it. Along the way he gains wisdom, learns languages, and finds love-- added bonuses that he is tempted to be content with as treasures apart from the greatest treasure he is pursuing.\"'When I have been truly searching for my treasure, I’ve discovered things along the way that I never would have seen had I not had the courage to try things that seemed impossible for a shepherd to achieve.'”I found a kindred spirit with the shepherd boy who had a wanderlust. I think we all identify along the way with those characters who grew content or gave up pursuing their Personal Legends.“We are afraid of losing what we have, whether it’s our life or our possessions and property. But this fear evaporates when we understand that our life stories and the history of the world were written by the same hand.”\"'People are afraid to pursue their most important dreams, because they feel that they don’t deserve them, or that they’ll be unable to achieve them. We, their hearts, become fearful just thinking of loved ones who go away forever, or of moments that could have been good but weren’t, or of treasures that might have been found but were forever hidden in the sands. Because, when these things happen, we suffer terribly.'”\"'There is only one thing that makes a dream impossible to achieve: the fear of failure.'”“'That’s what alchemists do. They show that, when we strive to become better than we are, everything around us becomes better, too.'”An alchemist recommended this book to me. I give it 4.5 stars out of 5, it is pretty good for short fiction. I do not know if I will read any of Coelho's other works; I have heard they are all written similarly. I'm told I need to re-read this one periodically to get more meaning from it-- the author says in the foreword he does that every so often. Read it for yourself.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Dangerously inspiring\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 16, 2019",
            "id": "amzn1.account.AEUQS4CKDCECSP4TWBJQGSBHI6XQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEUQS4CKDCECSP4TWBJQGSBHI6XQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought the book after hearing some strongly positive comments about it.  I was underwhelmed by it, though.  Maybe for an older kid this might be a good read?  I found it simplistic and not really all that interesting.  It is supposed to be inspirational but I found it hallow and empty.  Its founded on some magic-y premises.  I frankly found it misguided at best, harmful at worst.  I wouldn't recommend anyone read it for advice or inspiration.  Do not recommend.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Disappointed\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 12, 2017",
            "id": "amzn1.account.AG3TQP27SIHEVYBC7S6D4EBFENCA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG3TQP27SIHEVYBC7S6D4EBFENCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Great read! This book is one of the most influential books I've ever read and I liked how it was a story about an adventure, but also incorporated spirituality and self-improvement. I would most definitely recommend this book to a friend or anyone looking for clarity throughout their life journey. I feel as if the book provided me with a positive insight on how to live life to the fullest. One specific aspect of the book that stuck with me was the idea that once we decide to search for our purpose in life, the whole universe will help us. I was also able to recognize that many individuals will struggle is recognizing what their purpose is. It is okay for your Personal Legend to change based on the events that occur throughout your life, but it is important to always be working toward and striving to achieve a goal. The Alchemist is a good reminder that if we, as individuals, do not seek to find our purpose or destiny due to fear, we will forever be unsatisfied. The one thing I love about this book is that it can be geared toward all ages. You are never too young to understand that we should listen to our heart and chase after our dreams. Lastly, I find it so interesting that this text was so beautifully translated from Portuguese and has the ability to powerfully deliver a message in almost 70 other languages. The power of words is amazing! Overall, a great read and I plan to reread this book in the future!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Such an inspiring and powerful message!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 12, 2018",
            "id": "amzn1.account.AGOBVHJVMM4IPPHL7Z7AWXYD5OIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGOBVHJVMM4IPPHL7Z7AWXYD5OIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I absolutely loved this book. I am not much of an avid reader but this bookwas amazing. All Paulo Coelho's books are very enlightening. The story is about an Andalusian shephard that travels a long journey to reach a treasure. He encounters many challenges which help him grow in order to reach his true potential or as the book states. The universe colaberates in order to help you achieve your dreams.Someone told me to read eat in a few months or evena year. I read a review from someone that had said that his second time reading it, it felt different.  Cant wait to read it many more times.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    When you align yourself with the universe, it conspires to help you achieve your dreams....maktub.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 21, 2019",
            "id": "amzn1.account.AGINR3GBN6F5W6DVQSUPPY2OPQ2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGINR3GBN6F5W6DVQSUPPY2OPQ2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Honestly, I found this book to be ridiculously dull and so full of overly philosophical talk that I trudged through the first 1/2 before throwing in the towel. The entire premise is faulty as well. Life is not about finding your true destiny - it's about making an impact in the lives of others. This is such s fully self - centered view of life that I'm not honestly surprised so many love it. The whole \"It's all about me and my feelings\" creates a very selfish and self - involved person who makes little impact. And while the main character did interact with others in the story, it was all a coincidence that their lives were improved at all because the character did very little for anyone but himself. Drivel.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Self centered mumbo jumbo\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 6, 2015",
            "id": "amzn1.account.AEGG4O72IH7GQYDDCSOQYNGRLPJQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGG4O72IH7GQYDDCSOQYNGRLPJQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A poor and idiotic attempt at a deeper philosophical search for the meaning of life and existence. Paulo Coelho starts the story with a significant aspiration to knowledge and wisdom and at the end reverts back to idiocy, ignorance and superstition. I am amazed at how many people I've talk to about this book when my original intent was to talk about Gibran's \"The Prophet\" (which I may say soars above Coelho work in depth, writing style and philosophical thought and I would recommend it instead of \"The Alchemist\") and they say \"no, I have not read that book, but have you read \"The Alchemist\"? It's great!\" Well, it is not.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Dumb book.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 25, 2019",
            "id": "amzn1.account.AGSV5X4N6MKLOCHYNEXPDK5TVPVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGSV5X4N6MKLOCHYNEXPDK5TVPVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought this book for my preteen reader. He loves it didn’t finish reading it instead he found the audio version on YouTube go figure. This is a great addition to any home library.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Find your own path\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 8, 2019",
            "id": "amzn1.account.AF3B652IL42Y6YPNVQHN2APKH5ZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF3B652IL42Y6YPNVQHN2APKH5ZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I kept hearing recommendations for this title, as a book for someone seeking a new outlook on life. And also it was one of the books on heavy discount a while back. So I picked up an ebook version and eventually got around to reading, without any real idea what I was in for. It’s the story of a Spanish shepherd boy, who has some mystical experiences and goes on a quest across North Africa to the pyramids.As someone pretty involved in religion (Catholicism) this seemed very light and fluffy to me, if generally based on ideas and ideals I consider to be true. Everyone’s life has a purpose. God sees everything and is in control of it all. The world is a good and beautiful place, if perilous. Seeking to do God’s will in your life will bring you the greatest possible satisfaction. All this plays out in the simple story of the shepherd and his quest. But, it’s *very* simple. Doubts are minimal, obstacles are easily overcome, omens and miracles are abundant. This is not much like the real life most seekers face. So, while I think this might be a good book for a depressed agnostic wondering if their life has meaning... it’s going to need some follow up with some real sustenance afterward. If it was this easy, everyone would be pursuing their “Personal Legend” and nobody would have any doubts.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Religion Lite\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 28, 2015",
            "id": "amzn1.account.AGGJXEAVSTYOIDKBVAHE2CSHRF4Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGGJXEAVSTYOIDKBVAHE2CSHRF4Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Religious and hokey. If I had known this was a religious book I never would have read it. Did not like at all. Forced myself to finish it since there were good reviews. Should have read the bad reviews.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Drivel.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 24, 2018",
            "id": "amzn1.account.AFKEVFRDEUBRYMCOXZJVKBML24QQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFKEVFRDEUBRYMCOXZJVKBML24QQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Total waste of time.  Fable.  Meaning of life.  Bedouins in the desert.  Allah.  Some proverbs and verses from the Sermon on the Mount in the Bible thrown in for good measure.  I finished and said, what the heck was that??\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    What a crock!!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 16, 2019",
            "id": "amzn1.account.AEMI7K34446GAXCVXNCVS52KYF3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEMI7K34446GAXCVXNCVS52KYF3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Overly simplistic, pie-in-the-sky, everything-will-work-out dribble. Definitely not a book for anyone with any level of life experience.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not for adults\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 10, 2017",
            "id": "amzn1.account.AGVVG3SFJ54US6XBMPXWBCXQZZOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGVVG3SFJ54US6XBMPXWBCXQZZOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    After hearing and reading all of the glowing reviews of this book, my take? Extremely disappointing. For those who have been on the spiritual enlightenment path for some time, you will find nothing new here. Save your money.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Meh\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 26, 2018",
            "id": "amzn1.account.AHT7MZMECVO5WWNGCBSGOGNEJDPA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHT7MZMECVO5WWNGCBSGOGNEJDPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I found \"The Alchemist\" by Paulo Coelho to be interesting and the translation from Spanish into English by Alan R. Clarke to be exceptional. Yet, it is difficult for me to recommend this book, even though it has sold over 150 million copies. It is a book that deals heavily with philosophical and religious ideas, and at times I found the philosophical component of the book to be both burdensome and boring. The story of a boy in search of a treasure he dreams about and which takes him across the desert and to the Pyrimads of Egypt I found quite moving and the best part of the book, but this journey is loaded with so much philosophy and how 'one'... a single human or plant or fossil... is united with the rest of the world is just a little too much for me.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Interesting\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 7, 2019",
            "id": "amzn1.account.AGVBKFAIAJB5F46IVNC2XVW47MBA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGVBKFAIAJB5F46IVNC2XVW47MBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist will speak to anyone who's willing to read thoroughly and relate to the novel. I found that this book related heavily to my life. I'm glad I've read it and purchased it. I ordered this book on April 12th 2018 and I didn't start reading it until Dec. 4th 2K19. I finished it today (December 7th) it only took me 3 dayz. It made me wish I would've read it when I first purchased it... A very inspiring and life changing book depending on how deep you relate to it. Definitely now one of my favorites and one of the books you should pass on from generation to generation.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Really enjoyed the book!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 12, 2017",
            "id": "amzn1.account.AHG35CVCHN6SFEUIZ5TUCNU352AA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHG35CVCHN6SFEUIZ5TUCNU352AA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Actually horrible. It reads like it was written by a fourth grader. Very cliche and unoriginal.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    One Star\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 4, 2016",
            "id": "amzn1.account.AHXMTLNJAG6KT6LD2JFWTQJSHJIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHXMTLNJAG6KT6LD2JFWTQJSHJIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I read this book because my book group selected it. I found it tedious, sexist, and juvenile. The philosophy is very ego centric --there is some \"personal journey\" every man must complete, and \"the universe\" wants you to complete yours. (Unless you're female, then you should wait for your man.) There is nothing about service to others except to make money: life for this author is just about following your dreams and having adventures. (No one has children in this novel--or if they do, they are of no consequence.) There are many references to Jesus, Christianity, and Islam, but ironically nearly all of the references to Christianity are ego centric--for example, a story of how Saul's father is so proud that his son's words are remembered. Those words were about Christ--but the author cares nothing about actually trying to understand Jesus or Mohammed or anyone. Just listen to your heart. It's objectivism with a mystical veneer over top so the self centeredness can appear spiritual rather than just self centered.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Ayn Rand's philosophy with a spoonful of mysticism to make it easier to swallow\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 15, 2017",
            "id": "amzn1.account.AFYTEWNY66VDRBUA7HYEXASK6BFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFYTEWNY66VDRBUA7HYEXASK6BFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The story is simple - so much so that the reader expects something more complex and rewarding to be revealed at the conclusion. Unfortunately, nothing profound is revealed.The prose has an attractive rhythm to it, and yet there is something not quite right. Syncopated jazz in a world of pop tune literature.There may be something lost in the translation that might reward the reader of the book's native tongue. However, the translated version leaves this reader unsatisfied.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Enigmatic translation\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 15, 2018",
            "id": "amzn1.account.AEKYMROIZQIL46DMG3NJLQI6B6MQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEKYMROIZQIL46DMG3NJLQI6B6MQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This was an interesting read despite the headline. It turned out to be a reasonably engrossing look into the intellectual and spiritual enlightenment of a young man, referred to throughout the story only as \"the boy\". He finds himself somewhat inexplicably drawn into a quest from his Spanish home across the Sahara desert in pursuit of his \"personal legend\". Needless to say, along the way he meets many interesting, even extraordinary people, while also finding himself in dangerous and trying circumstances that test his will to continue the journey. Nonetheless, he finds the love of his life who, despite her desires to keep him close, encourages him to continue.Perhaps the title is a bit misleading because the story, in the end, has very little to do with the life of an \"alchemist\", as much as it has to do with \"the boy\" who encounters him, and how he receives guidance and encouragement. In any case, I think anyone of any faith who can read with an open mind, will find this an uplifting tale of personal trials and tribulations in pursuit of an unquenchable desire to discover one's own \"meaning of life\".\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not at all what I was expecting\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 12, 2020",
            "id": "amzn1.account.AFRTQMFLHD3MFKYZGPEQMCM57MOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFRTQMFLHD3MFKYZGPEQMCM57MOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    First of all, a star docked for the writing. It sounds like it was written by a 10 year old and though this simple, parable-like prose makes the story easily accessible, it was genuinely painful to read at times for me.Another docked because Santiago is an idiot. He makes a terrible deal with a gypsy that costs him a tenth of his treasure, has his money stolen almost immediately after arriving in Africa, and apparently falls in love with every woman he meets in his life. Is Santiago made this way to represent the way people stumble around blind in life when pursuing their own dreams? Maybe, but that doesn't make him as a character any less infuriating, even though he does become a wide idiot by the end.That out of the way, this book isn't as bad as some say, or as good as some say. The truth lies in the middle, perhaps because this story is deceptive in its tale and, I believe, is so on purpose. It emphasizes dreams, or your Personal Legend, but also emphasizes the importance of living in the present and learning from your experiences. The Englishman taught Santiago about alchemists, but is ultimately less prepared when they actually meet him because he is living in his books and not the present.Additionally, the book presents an actual treasure at the pyramids as Santiago's Personal Legend, but we learn at the end that there is no treasure at the pyramids (even though he does find a physical treasure). In this, the book is deceptive yet again! The actual treasure for Santiago are the experiences he has while on his journey to the pyramids, the people he met and the wisdom he gained. For this will guide him better in life than the treasure under his sycamore tree (he is likely to have this soon stolen anyway, if his last experiences repeat).This book is ultimately deceptively wise, but only if you are able to peel through the terrible prose, mysticism and religious thinking. I would also add that you do not need to subject yourself to this tiresome tale to gain the wisdom it preaches, and that due to its deceptiveness some may only take away \"Follow your dreams and the universe will conspire to aid you\" from it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It's not as good as some say, not as bad as some say\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 17, 2019",
            "id": "amzn1.account.AH4DX6GMURY23BZLWIZF5WQP3MAQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH4DX6GMURY23BZLWIZF5WQP3MAQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I'll be honest, I didn't finish the book.  I was already bored by the time he got to Tangier and when his friend disappeared and the boy blamed God I totally lost interest.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Too naive and scripted\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 24, 2017",
            "id": "amzn1.account.AEPTKSRGGH4YKAE6C7ILQ5YUOBTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEPTKSRGGH4YKAE6C7ILQ5YUOBTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The part that stood out most to me, was when he sold his sheep for money. He was then robbed of that money and was left with nothing in a foreign land. He had gained so much along the journey, an in seconds lost it all. (oh god, why do you hate me what did I do).He then worked in a store for 11 mnth to earn back the money to continue  his quest, (talk about a set back). I found that, yes, this book had many life lessons...but realistically this guy overcame way too many obstacles, and faced triumph and setbacks that only a fictional character could live through, to tell the tale. However I wont kill the dreams of others. This book will open your mind and have you pursuing dreams you left behind years ago. Fable or not, achievable or not, this book will turn you into a fighter.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    My favorite part\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 30, 2017",
            "id": "amzn1.account.AH7J3SL62DBKHPIZBVMUZRGYK5HA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH7J3SL62DBKHPIZBVMUZRGYK5HA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I had high hopes for this book, but I was really disappointed.  I only bothered finishing it because I figured that there must be something more to it because of all the hype.  I also thought that the author bragging about this being one of the greatest books  of all time (in the forward) was a bit much.  The whole fable concept just seemed juvenile and simplistic. I also prefer books in which the main characters have names.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Simple...a little too simple\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 30, 2020",
            "id": "amzn1.account.AHWNNDNMAVL3RDVIU6LGM6AHBYFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHWNNDNMAVL3RDVIU6LGM6AHBYFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I know, I know... it's a must-read, change-your-life kind of book. But was it really? I found myself highlighting a few things one moment and then pulling out the play-dough for the kindergarteners the next. Did I miss the pearls and diamonds of life-changing wisdom? It was like a self-help book for people who don't want to admit they read self-help books. I don't know... I couldn't connect with the main character, I thought the plot was disjointed, this could have been a five paragraph parable and told the same story. I'm not saying it is without merit, but let's just say I get why wealthy, famous people dig this book: it is a reminder that they have listed to the universal language and found the soul of the world. For the rest of us, it's an annoyingly optimistic, simplistic slap in the face.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Probably the only one who doesn't love this...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 11, 2019",
            "id": "amzn1.account.AEMM2SD5RBMG2K7STYIDKINEENPQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEMM2SD5RBMG2K7STYIDKINEENPQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    There were so many portions of this book that I highlighted to reread.The stories stuck with me throughout the day and I would find myself mesmerized staring into space as I was pondering the messages this book holds.Here are a couple that truly touches my heart :“There is only one thing that makes a dream impossible to achieve: the fear of failure.”“Tell your heart that the fear of suffering is worse than the suffering itself.”“Everything on earth is being continuously transformed, because the earth is alive . . . and it has a soul. We are part of that soul, so we rarely recognize that it is working for us.”Even if my neighbor doesn’t understand my religion or understand my politics, he can understand my story. If he can understand my story, then he’s never too far from me. It is always within my power to build a bridge.”“intuition is really a sudden immersion of the soul into the universal current of life, where the histories of all people are connected, and we are able to know everything, because it’s all written there.”\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A true treasure\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 29, 2020",
            "id": "amzn1.account.AGDBWAKQKYGDUAVWTAXAE5AINLFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDBWAKQKYGDUAVWTAXAE5AINLFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A simple coming-of-age parable which, by means of its straightforward style, achieves profundity. This book has been touted for years. Several friends have declared this their favorite book; a co-worker recommended that I read it; online book forums can’t get through a recommendations thread without The Alchemist among the top responses. I figured it would be difficult for the book to make a true impression because of how highly touted it has been. I was wrong. I am impressed.This book drips with wisdom and yet is so unassuming that the reader is welcomed to embrace what rings true and shrug off the rest. The Alchemist tells the story of a shepherd who leaves his flocks to follow a dream of great treasure at the pyramids in Egypt. In his wanderings, he remains open to whatever experience comes his way. He meets a cast of fascinating, fun characters who share their wisdom, experience, and misadventures with the young shepherd.The writing style is simple, the translation beautiful. The prose is poetic yet approachable. As the story progresses, a reader can’t help but listen to the simple wisdom on offer. I enjoyed nearly every page of this book and was satisfied with the story’s full-circle conclusion. I felt that I learned and grew alongside this peripatetic shepherd; I maintained an open heart ready to welcome all wisdom, even from unexpected people and places.A few tidbits that particularly stood out:  -“I couldn’t have found God in the seminary, he thought, as he looked at the sunrise” (13). A perfect example of the sort of wisdom this book offers. This rings true for me as I have a graduate degree from a seminary and a few weeks of wilderness backpacking under my belt. The sunset and a rock to sit on after a long day of schlepping have a deep theology on offer which couldn’t be contained in the many books I’ve read on the topic of spirituality.  -“We are afraid of losing what we have, whether it’s our life or our possessions and property. But this fewar evaporates when we understand that our life stories and the history of the world were written by the same hand” (79). As an agnostic with an education and history of biblical studies, this sort of welcoming, simple wisdom is encouraging. Coelho doesn’t ask you to convert to his philosophy, but simply to engage.  -“You will never be able to escape from your heart. So it’s better to listen to what it has to say. That way you’ll never have to fear an unanticipated blow” (134). This is a main theme: listen to your heart, keep your eyes open to the world, remain present in your experiences, welcome omens as guideposts, avoid artificial absolutes. The shepherd in this passage goes on to confess that his heart is afraid of suffering. His friend the alchemist responds, “Tell your heart that the fear of suffering is worse than the suffering itself. And that no heart has ever suffered when it goes in search of its dreams, because every second of the search is a second’s encounter with God and with eternity” (134). What a beautiful message that strikes me at a perfect time. I am hoping to pursue my heart’s dream of writing. “From then on, the boy understood his heart. He asked it, please, never to stop speaking to him. He asked that, when he wandered far from his dreams, his heart press him and sound the alarm. The boy swore that , every time he heard the alarm, he would heed its message” (136).  -“When we strive to become better an we are, everything around us becomes better, too...when we love, we always strive to become better than we are” (155).This is a beautiful book that I will treasure, recommend, and re-read.A\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Approachable Wisdom and Beautiful, Simple Prose\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 16, 2018",
            "id": "amzn1.account.AGTS4HRO6FRTWROBZBY6SAMM2FFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGTS4HRO6FRTWROBZBY6SAMM2FFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A friend summed it up like this, \"If I was 20 something years old, this would be my bible.But  I am 60 something years old and this read a bit  like old news and thoughts\". Although well written, it felt like a rerun of the 60's and 70's to me. Been there, done that, I'm over it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    well written\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 31, 2018",
            "id": "amzn1.account.AEBHO7IZ4MGT2D2WFLHHCQLQLLIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEBHO7IZ4MGT2D2WFLHHCQLQLLIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I feel a little misled by all these wonderful reviews. I totally did not get the hype at all. It's just a weird book. It's not motivational, inspirational or life-changing. Parts I wondered if it was an allegory to drug use? I have no idea. Overall, this book felt like a hippie trip and made me kinda uncomfortable with its weirdness.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    How is this rated so high?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 14, 2019",
            "id": "amzn1.account.AHCIWNJLF4IVJ4IDNFKY6HJJUSTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHCIWNJLF4IVJ4IDNFKY6HJJUSTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I don’t know if it is due to the translation I have some difficulty to read it. Painful. Not magic at all. Maybe I was not in good behavior to read it. I suppose...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Painful reading\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 3, 2015",
            "id": "amzn1.account.AGCLHSEKZ6LBLADEEZDNUQXUFWIQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGCLHSEKZ6LBLADEEZDNUQXUFWIQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Here's how my reading of this book came about: I saw a quote on Pinterest that I really liked, found out the source of that quote was this book, ergo I ordered this book.I was incredibly excited to read it (based on nothing more than the intense appeal the quote had on me). I read the first several pages and was like, \"Well, this is an easy, simple little tale,\" but it wasn't all that appealing to me, so I marked my page, set the book down, and read a different book. Now, the magic comes here: while reading the other book (which was good) I was plagued by something I had read in the first several pages of The Alchemist, and the very fact alone that I was being haunted by words from a book I had labeled as a \"simple little tale\" told me that I really had no choice but to read it, after all, we must \"listen to our heart,\" right?So I read it- I read it, and I loved it. Then I read it again. And I still loved it. I loved it because it spoke to me on a soul level, and because for such a \"simple little tale\" it is filled to the brim with a deepness that, though simple, may be a lifetime in getting to the bottom of.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A simple little tale with so much depth\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 13, 2019",
            "id": "amzn1.account.AHFF7L4X2EUO6MBHVVV333XRSNYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHFF7L4X2EUO6MBHVVV333XRSNYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I teach fifth grade and read this in a small group - it was a total bore.  I tried to keep the kids interested and engaged, that absolutely hates it.  By the end, I could understand completely.  I wish I could understand the four star reviews!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Very disappointing!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 7, 2016",
            "id": "amzn1.account.AEHQXS3U6GNHLLIYL7YFBHEPOFOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEHQXS3U6GNHLLIYL7YFBHEPOFOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    One of the top ten worst books I've ever read. The condescending, preachy, mixed religious, pedantic, pedestrian, \"insights\" wore thin real quick. It reminded me of all the quasi-spiritual, new age crystal wearing hippies I hung around with in the 90's who convinced me of the healing powers of quartz. I'm still holding that giant crystal and haven't felt anything from it in 25 years. It was like a 4th grade version of Conversations with God meets A Course in Miracles edited by L Ron Hubbard. The worst was I felt like I was supposed to like it after hearing so many rave reviews. Reading this book was like experimenting with Quaaludes in the 80's. I just stared straight ahead and couldn't move for 14 hours and did not understand what all the fuss was about. I feel dumber and less motivated to participate in life after read this book.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Pathetic Drivel\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 2, 2018",
            "id": "amzn1.account.AH6YJLQFA7RAIVZH6KTSZZRYVX6A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH6YJLQFA7RAIVZH6KTSZZRYVX6A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I heard about this book on the PBS show \"The Great American Read\". It lists 100 most loved/popular books. The Alchemist was on that list. Sadly, I dont know why? Yes, this book has some life lessons all told in a fable like story but for me it fell very short and was quite disappointing. Jane Eyre, A Tree Grows in Brooklyn, A Prayer for Owen Meany, these books are on the list and well worth reading! Btw: skip Siddharta too!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not that good......\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 3, 2019",
            "id": "amzn1.account.AGCQATNNIDOXUPA3ED4BUIKM5WRQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGCQATNNIDOXUPA3ED4BUIKM5WRQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist came to my attention twice in the same day on two different social media platforms from two different people. In fact, one friend posted the Spanish version and another the English. After seeing it twice in the same day, I knew that was a cue from God to read it. I downloaded it and found it to be an excellent read with an excellent message. For some reason I kept seeing my daughter as the shepherd boy because she has that very same spirit for life. I loved the book and could not put it down. I now have downloaded Warrior of Light and looking forward to experiencing it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist Came To Me As An Omen\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 31, 2019",
            "id": "amzn1.account.AECPMUV6YUYTPZTJ6HEMOEA54MJA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AECPMUV6YUYTPZTJ6HEMOEA54MJA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A little big confused as to why my copy of this book was so ragged. The cover was totally fine and brand new. The pages however are ugh! The pages are not trimmed uniformed. Not a straight edge but rather harsh edges that fray and stick out very weridly.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Bad Experience due to Werid Page Edges\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 22, 2019",
            "id": "amzn1.account.AFYPQPO7XKM6ECD2CYGAISHLZP6Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFYPQPO7XKM6ECD2CYGAISHLZP6Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It's a good story, but don't take everything literally. It's a metaphor as described by the author in the foreword.Some people didn't like the ending, but I thought it was good: Everythings ends where it all began...after going through a big journeyThe message of the whole story is to not give up while pursuing your dreams no matter how many times you fall into a hole. Being that said I would like to mention something that is not mentioned in this book at all. Never forget about survival of the fittest. You can't be good to everybody and not everything will come in 'omens' are fallen from the sky.That's why I said at the beginning don't take the whole book literally. I mostly liked it because of some good quotes it has. My most favorite one is: \"Tell your heart that the fear of suffering is worse than the suffering itself. And that no heart has ever suffered when it goes in search of its dreams, because every second of the search is a second's encounter with God and with eternity.\" Very powerful and inspiring. I was surprised this quote wasn't even amongst the most highlighted ones.For those who really didn't like the book all I can say is don't take it too literally and read the foreword first.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A good story as a metaphor\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 3, 2019",
            "id": "amzn1.account.AGM3S55FBCGGFJO2W3JN3O6FN5CQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGM3S55FBCGGFJO2W3JN3O6FN5CQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Its simplistic to the point of making the reader feel dumb.  And its nothing new.  This book is a waste of time for anyone who is remotely spiritually-aware.  I kept reading because I kept thinking that there must be something more to it.  There isn't.  Good thing its a quick read.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I don't get it\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 28, 2020",
            "id": "amzn1.account.AERMWQPNFVWYYGG7A4YRE3UC3DJQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AERMWQPNFVWYYGG7A4YRE3UC3DJQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So, I’ll be honest- I did not finish this book. I didn’t enjoy it, which was a disappointment since I’ve heard such great things about it and It’s been on my reading list for years. I finally just bought it and was excited to give it a try. But right after I started it, I found that I was forcing myself to read it (that’s not a good sign when you are reading for leisure). I just could not get into it. The writing is so basic. The story is just mildly compelling. I got to the part where he met Melchizedez, the king, and then I just couldn’t read anymore. Kept putting the book down and sighing with boredom. This book is hugely overrated! (I realize the story might have picked up and gotten better if I had kept reading, but I just couldn’t. I think if I was a 12-year-old I might have liked it, though.)There were a couple moments were I liked the way the author turned a phrase or I appreciated an insight that the author had. But as a whole this book was just not well written in my opinion.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Way overrated\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 25, 2013",
            "id": "amzn1.account.AGYSMSR32XW774CER2X3PZJ6GWAA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGYSMSR32XW774CER2X3PZJ6GWAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We are told how people perish for a lack of vision/ goal/ dream/Personal Legend, where themagnitude of the dream is irrelevant. However, what's imperative is that a person possessesone. Why do I say this? Because dreams are the language of God. We're all placed herewith a purpose and Personal Legend (what we've always wanted to accomplish), with ouronly real obligation being to realize our destiny. However, as with all things, to whom muchis given, much is required. There is a process that one must endure before attaining theirdream. The important thing to do is to start, which always entails choices. We mustdecide, whether we're going to continue with what we've been accustomed to (stay in ourcomfort zone) or pursue what it is that we really want (expand our territory). The way onethinks always plays an integral part in the process as well. We can either view ourselves asa poor victim or an adventurer on a quest. There are other contingencies involved aswell. However, the thing I do know is that when a person really desires something, all theuniverse conspires to help that person realize his/her dream. God has prepared a path foreach to follow, and everyone on earth has a treasure that awaits them. In order to find thetreasure we must realize that the only thing holding us back is ourselves , as wells as readand follow the signs/omens left for us.If you're reading this review, I'm sure that you have a dream that's close to your heart or onethat has been deferred, or buried. Well, now is the time to exhume that dream, dust it off,and remove it from the shelf. One of the signs that the Creator often gives us beforeembarking on a great task is a messenger. Well, in this case the messenger is Paulo Coehlo,with his book entitled, The Alchemist, being the Magnus Opus. The book is simple, yetbrilliant as it tells the story of a young man in the quest of his dream. It explains theobstacles that inevitably obstruct one's path, and the requisite qualities to face and pursueour dreams, as well as the qualities developed when following our dream to the end. Fromtime immemorial some of the most sublime truths have been communicated to man viamyth/ allegories, with The Alchemist being no different. It is chock full of spiritual andpractical gems that can be applied to our everyday life. The journey in the book is muchlike an initiation, where one is constantly subjected to tests of patience and courage. It willremind you that in pursuing one's Personal Legend, it's not about the destination, butlessons accumulated throughout the journey, that we don't have yesterday or tomorrow,only today, how life is generous to those who pursue their Personal Legend, the importanceof simplicity, listening to your heart because that's where your treasure is,how the people who love you will never stand in the way of your dream, and that if theCreator brought you to it, He'll bring through it because everything under the sun has beenwritten by One hand. When one is traveling to the promised land, it's inevitable to take adetour through the desert. However, on this particular trip we have Paulo Coehloconducting us each step of the way. So if you're ready to start on or resume the journeytowards your dream/ Personal Legend, I highly recommend picking up a copy of TheAlchemist. This book contains something for everyone from high school on up. The onlything left is to observe the signs, rise, follow your conductor, and fear no danger!Maktub\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It is written...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 16, 2018",
            "id": "amzn1.account.AGAB6BFP5BJOWN35AO5ODAV5CQ4Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGAB6BFP5BJOWN35AO5ODAV5CQ4Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    As is often the case with a book that is so highly rated, I was somewhat underwhelmed by this book.  It is a nice story about a young man facing many challenges in his life while pursuing his treasure, but for me there was no real wow factor to it and some of it was just plain unrealistic.  It does seemed geared toward a younger reader, but perhaps that is because of the translation into English.  It is a fairly short book and it held my interest throughout so I did not dislike it but for me, the magic was not there.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not what I expected\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 17, 2016",
            "id": "amzn1.account.AGIOE3S4WV2RHS57NGRMQTWZVQQQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGIOE3S4WV2RHS57NGRMQTWZVQQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have heard a lot of positive things about this book but couldn't bring myself to read it.  Curiosity got the best of me and I really enjoyed the book.  I must say that it's more about the underlying story than the actual story itself.  More like a fable where the deeper meaning comes after you have finished the book.  Part of it stays with you but not necessarily the characters, more what the characters represented. This book would appeal to those who enjoy reading and discussing philosophical novels.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Wonderdul\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 23, 2017",
            "id": "amzn1.account.AGEHWSZXZ6QU3YH7RESSOJVLYPYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGEHWSZXZ6QU3YH7RESSOJVLYPYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    One of my favorite books\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Five Stars\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 12, 2019",
            "id": "amzn1.account.AFO6YTIXUXJ3HEVONB6Y7JDHCQ5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFO6YTIXUXJ3HEVONB6Y7JDHCQ5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    As my head line states, this book, for me, didn’t live up to the hype. I didn’t really get much out of it. This a quick and easy read, which actually disappointed me. Read any other 2 or 1 star reviews and they’ll tell you exactly how I also felt, no need to repeat someone else’s words. I will say that the first half of the book was better than the last half for me. I didn’t care for the ending. I don’t even know what to say. The book sucked.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Didn’t live up to the hype\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 11, 2017",
            "id": "amzn1.account.AFFW3Y5OUCQBP357PM5GLESLBBFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFW3Y5OUCQBP357PM5GLESLBBFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This was an okay read that kept my attention until I got towards the end then it was moving too far.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Okay Read\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 5, 2014",
            "id": "amzn1.account.AEGTO3WOR2O3V4CS3756367XIIPQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGTO3WOR2O3V4CS3756367XIIPQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A real effort is taken in order to not completely slam this book with my major disappointments and frustrations. When there is a world full of real literature, art, and creativity, it was a waste of my time and energy. The only thing positive about reading, struggling through, and finishing - which I had no desire to do - is that I was reminded of how not to write, how no to explore and share observations and wisdom, and how to write for the level of a third grade child. I'm disappointed but more so saddened that this is a best selling novel worldwide and this is what we call literature. Polite rant now over.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not worth the time\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 19, 2020",
            "id": "amzn1.account.AHEQLOKIJAS27J4VCSMBBBRJB5TA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHEQLOKIJAS27J4VCSMBBBRJB5TA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This book was on my list for years before I pulled the trigger and bought it.  It was unlike anything I've read and I really enjoyed it.  You have to read between the lines with this one because the morals of the story aren't spelled out for you.  I would make a point to read a chapter and then sit back and reflect on what you just read.  It's essentially, in a roundabout way, about following your dreams,, finding your passions and being resilient.  Each person you meet is part of your overall purpose.  On the surface, it's an easy, quick read, but that's only if you don't take time to think about its contents.  Go slow with this book.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Don't Give Up!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 5, 2017",
            "id": "amzn1.account.AFCPLP4TXIXEBQDS2D44ZNIZXT5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCPLP4TXIXEBQDS2D44ZNIZXT5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist is a book full of integrity, determination, and fulfilling one’s dreams. In this book, the main character is overcome with the desire to set out to find his destiny, or his own Personal Legend, that supposedly lies within pyramids- all while leaving behind his simple life as a shepherd. Throughout his journey he is confronted with obstacles and delays, both physical and mental. He displays much internal conflict and doubt, yet always regains his footing with the help of his faith and the always truthful omens reoccuring in his life. In this book, the author guides the plot with a series of omens and spiritual occurrences that aid Santiago, the main character. The Alchemist is written in a very simple manner, and does not express complex diction. In this way, it is a very easy read. Although some may approach that as a negative aspect of this book, it actually assists the reader to more easily understand the symbols and the spiritual meanings that occur throughout the book. The simple diction and the simple syntax helps clarify the underlying messages and themes of the book rather than having the reader anguish over the true meaning. Even with the simplicity of this book, it is written in an extremely elegant way. Paulo Coelho writes in such a vivid manner and creates very smooth, appealing imagery that makes anyone reading this book physically unable to close the book and set it down. Coelho’s skills in the imagery department are very developed as he was able to write in such a way that through simple descriptions, a sense of self was provoked and appealed to not only every human sense, but to every human emotion. The book is centered around Santiago’s journey, which is the main theme of the book: one must always follow their dreams. Although, the Alchemist does a wonderful job at conveying many underlying messages. The book teaches helpful universal messages such as it is wise to listen to nature as well as oneself, and to always have faith in oneself and what one believes in. The Alchemist is an absolutely wonderfully written book that provokes the readers who truly read it with passion and emotion. It is a book that contains a large amount of religious content, but it speaks spiritually to any and all who read it and it teaches a vast amount of valuable life lessons.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Wonderfully written book\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 30, 2018",
            "id": "amzn1.account.AH2BP5YW62ZB3VR3NHPHEUNIZ2EA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH2BP5YW62ZB3VR3NHPHEUNIZ2EA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This little book is filled with life lessons but reads like a bedtime story.  The Spanish shepherd boy, Santiago (who is only named once), is on a quest to Egypt after a fortune-teller predicts that there is where he will find his treasure.  Along the way, he meets many characters, some who help him and some who harm him.  His journey teaches him self-reliance, judgment, and compassion.  He learns that when you are pursuing a dream, the universe conspires to help you and that obstacles are disguised as opportunities.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Life lessons story told as a fable\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 21, 2014",
            "id": "amzn1.account.AF3MHYKKTGZYM7GYMYEFO4KECDYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF3MHYKKTGZYM7GYMYEFO4KECDYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist sat on my bookshelf for much too long! I wish I had read it sooner.It is a delightful story about a young man who starts out studying to become a Priest. However, he decides that is not what he really wants to be, and he becomes a shepherd. After a few years he finds himself on a quest to find his own personal legend (destiny).Through a series of events, including meeting a king who encourages him to follow his heart. That included a trip to northern Africa, spending several months working in small crystal shop (where he helps the owner become successful) in order to earn enough money for a trip to Egypt, riding in a caravan to an oasis (where he meets a woman and they fall in love), meeting an Alchemist who helps him determine and find his destiny), and reaching the Egyptian Pyramids, where he thought he would find a treasure and his Personal Legend.Through this journey he learns much about himself and others. He learns to interpret omens (much like intuition) that guide him in reaching the highest level of understanding.  He also learns that the treasure he was seeking was to be found in a place where he was originally happy as a shepherd, home in his own country.  He learned it's not the destiny that was important, but what he learned on this journey.This is one of the best books I have read dealing with how one can seize opportunities when they come your way, and by not fearing the unknown, trusting in yourself to overcome adversity, one can succeed on levels beyond what might never have been possible. It is a way to find a better understanding of yourself and your real goal, and through this journey you allow yourself the opportunity to reach your own destiny -- Personal Legend.I wish I had read it in my younger years.  I would then have had the opportunity to seize the moments when they came about.  I might even have become that famous doctor I had dreamed about as a teen.Do seize the opportunity to read this book by Paulo Coelho! I did, and I find myself looking at things through different eyes, and reflecting on my own destiny.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist caused me to reflect in my own Personal Legend\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 28, 2018",
            "id": "amzn1.account.AGWOEUUV4EESRZK5YNE3QQLABF7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGWOEUUV4EESRZK5YNE3QQLABF7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My grasp of philosophy is tenuous at best, and the supernatural aspect caught me off guard, because the book begins in southern Spain and is thoroughly realistic. It is an adventure - a quest - with the over-arching theme that everything is connected, and all people are connected. The author's storytelling style keeps the protagonist at arm's length (I don't know the accurate phrase), so we vaguely empathize with him without becoming emotionally attached. The story goes in a circle with no real beginning or end, like the world it describes. There is an excellent message here, worth visiting and re-visiting.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Mystical philosophy\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 3, 2019",
            "id": "amzn1.account.AF4M4PBSAWCAVCWWSKY2LLVZXU2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF4M4PBSAWCAVCWWSKY2LLVZXU2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    slightly disappointed as the printed version of the book was different than the one advertised.  it seems a generic copy of the Alchemist was printed and that version is what was sent.  I currently have a copy of the \"version\" that was advertised and really wanted that print, but received a very inexpensive print version.  the price was fair, but in hindsight would have rather purchased the copy I initially thought I was buying.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    correct product, incorrect version\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 24, 2019",
            "id": "amzn1.account.AEB6F33ZU7SBSSDYG7XOGCS2KOYA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEB6F33ZU7SBSSDYG7XOGCS2KOYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It was like this book came into my life at the perfect time, kinda like how this novel talks about when you finally decide to go after your \"Personal Legend\" (your life's dream) the Universe conspires to put people and circumstances in your life to help you achieve your \"Personal Legend\".  After years of working in a factory I made a decision last year to do something more meaningful with my life. So I started devouring personal development books including alot of Napoleon Hill. Hill stresses the importance of having a Definite Chief Aim in life (same as Personal Legend) and he also talked about how once you have a clear destination the Universe will put people and circumstances in your life to aid you.  Now, I read alot of bad reviews on tbis book. I believe that the people who didn't like this book were either not ready for the message (which one year ago I doubt  I would of been ready to understand the message myself), or they just have a very strict perspective on life, and how the world is just random occurrences.  So if you are open to look at life in a different way, or have any prior experience with personal development books you will LOVE this book. It is really easy to read, Paulo Coelho doesn't over describe everything in his books, which makes it a faster read, and let's the reader's imagination make up the details as they want. This is one of the most powerful personal development books in a wonderful and inspiring story. I was giving this book by a friend and read it three times, then ordered a copy for my 13 year old daughter. I think this book is so powerful they should make this required reading in high school!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The most profound novel you'll ever read!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 29, 2020",
            "id": "amzn1.account.AEBHFZGAYB3ASTSEOVMUJYZPTCXA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEBHFZGAYB3ASTSEOVMUJYZPTCXA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I first encountered this book years ago at the verge of an interesting phase of my life. It taught me a lot of valuable lessons, some of which have propelled me to where I am today. Ten years later, just when I am beginning another new phase of my life, I got the urge to read this book once again. I continue the chase of my \"Personal Legend.\" It has been an interesting journey. Quite a delightful adventure with all the challenges that come with it. I recommend this book to everyone who wakes up in the morning and wonders whether there is more to their life, to those who are still seeking to find the purpose and meaning of their lives, and to all those who just want a delightful read. Thank you Paulo Coelho for being an advocate for the dreamers and doers.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Still one of my favorite books....even after a second read\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 19, 2019",
            "id": "amzn1.account.AGCWMYXZKNQTFPKGEAFNK4MYYVAQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGCWMYXZKNQTFPKGEAFNK4MYYVAQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This short book is a simple fable with simple lessons. I actually expected the ending to have a more profound message. Maybe starting out searching for treasure is a good beginning, but I expected the journey to change to one with a less material message. The story is about a young shepherd boy who has a dream about treasure in the Pyramids and gives up everything to pursue that goal. This is about following your dreams, which is great advice, but the story becomes unrelatable when the boy gains powers such as conjuring the wind. I expected more from this “masterpiece.” It’s still inspiring but not as good as expected.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not as good as expected\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 17, 2020",
            "id": "amzn1.account.AFS2HW5Z67BNOGS6MQTJW7K6ADTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFS2HW5Z67BNOGS6MQTJW7K6ADTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This book is on all the lists as one of the best and most important books you could ever read, but it fell flat for me.  Spoiler--the moral of the story seemed to be that you can achieve great things by staying home in your safe environment while just dreaming about greatness.  That's never true.  Greatness requires risk, and action, and growth and learning, none of which can merely dreamed about, and most of all, achieving dreams is much better than just having them.  And no woman is going to wait for you forever while you go live your life without her.  Even a dream girl.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I must be the only person who didn't love it.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 30, 2019",
            "id": "amzn1.account.AFZQZNBK7AKICAZ5LTU3HDA2CJOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFZQZNBK7AKICAZ5LTU3HDA2CJOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really don't understand the hype about this book,flat story, boring to no end, completely no point at all\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Completely overated\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 10, 2020",
            "id": "amzn1.account.AHVYXJ3CVWD3AUT76SYENHT23UZQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHVYXJ3CVWD3AUT76SYENHT23UZQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    In the desert, I found a goatskin. What follows is a rough translation from Sanskrit.\"Picture me as a wizard in a pointy hat carrying a staff. 'The Alchemist' led me to understand the last six months of my life. Consider three quotes from the book.\"'The mysterious force... appears to be negative, but actually shows you how to realize your Personal Legend.'\"'We could sell tea in crystal glasses. The people will enjoy the tea and want to buy the glasses. I have been told that beauty is the great seducer of men.\"\"'Love is the force that transforms and improves the Soul of the World. When I first reached through to it, I thought the Soul of the World was perfect. But later, I could see that it was like other aspects of creation, and had its own passions and wars.'\"The author of those lines led me to understand that I had served as a mysterious force to the Personal Legend of a priestess.\"I had tied my heart to the side of a donkey and sent it into a secret valley between Katmandu and Timbuktu. It told me that a woman in the valley was growing into a role of spiritual leadership. So I entered.\"I met the woman. Her name is Narmis. I met the baker, the cobbler, the smith, the stable boys and girls and many other delightful folks. From the corner of my eye, I occasionally caught a glimpse of their rainbow auras.\"A week later, Narmis built a small temple. She erected the sacristy around the trunk of a sycamore. Every day she nailed a new installment of holy scripture to the wooden door at the front of the temple. I memorized one of them as a guidebook for the rest of my life.\"Narmis needed a mysterious force to spur her ministry.\"First I became a mirror. I reflected the depth of her wisdom back to her. She grew more self-assured.\"Second I performed a miracle. On the alter I held my hand over her heart. A terrible pain in her legs and hips diminished. She felt a physical echo of the healing in her heart. In truth she performed her own miracle through a faith I helped her to achieve.\"Third I whispered secrets in her ear. She feared her own power. Power corrupts. She wanted to remain pure. She wanted to tolerate only purity among her followers.\"Her disciples hid their impurities well. But the further you went from the temple, the more trouble you found in the valley. Pickpockets teemed in the market. Burglars invaded homes. Lustful moans escaped the brothel.\"I whispered that she must minister to even the worst of the sorry lot. Even some of the idolaters fashioning a golden calf could mend their ways. She must find the courage to pursue power without corrupting her soul. She must hypnotize the people with wisdom, compassion and beauty.\"Narmis pushed me from the sacristy. Her hands never touched me and her words remained kind, but her eyes clouded with anger. I fell back. I ran from the temple. I saddled up and left the valley, crying.\"Only after reading Paulo Coelho's masterpiece did I understand. My presence among the people of the secret valley served a purpose. I love them still, but I cannot go back. My absence serves an even higher purpose. The priestess shall have no crutch. She will pursue her Personal Legend or she will not.\"Hegel wrote, \"The owl of Minerva spreads her wings only with the coming of dusk.\" Coelho offers more wisdom than Hegel through the simple speech of Santiago, the shepherd boy.\"And me? My owl spread her wings in the tearful days following my fall from grace. I learned to tie my heart to the owl at night and to a falcon in the day. No more donkey rides. My heart now soars to places of great joy. I recite the holy scripture without hesitation. Narmis helped me find the faith to heal.\"\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist Helped Explain Life\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 19, 2020",
            "id": "amzn1.account.AEI6DSMYPRXV3GKUKXBJJ7TQAQZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEI6DSMYPRXV3GKUKXBJJ7TQAQZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I would never forget this book and how it made me feel. The first time I read this book, I was in the Philippines, single, looking for my life’s purpose. After so many years, now i read it again. Now, I am where I felt I am living my life’s purpose in the US, happily married, living a simple life, loving being a mother to my 6 year old daughter with autism. I felt, this book is my life written all over it. No gold treasure though, but the family love that I have found, is more than those chest of gold on this book.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Have read this book twice.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 24, 2016",
            "id": "amzn1.account.AGLAQKJHXGAYIXYHN74EEKE3RVMA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGLAQKJHXGAYIXYHN74EEKE3RVMA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I know that this book received great reviews.  I saw a celebrity in a tv interview who said that this book changed his life.  The interviewer said that it was a great book as well.  Therefore, I researched it and decided to purchase it.  It did not have the same effect on my life that it had on Pharell's (interviewee).  Nor did I think that it was as great as the interviewer claimed (Oprah). I wish that it did.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I know that this book received great reviews. I saw a celebrity in a tv ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 27, 2019",
            "id": "amzn1.account.AEICTYLI435K3Y2P3LFWJBEEHKEQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEICTYLI435K3Y2P3LFWJBEEHKEQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So, I'm only a few pages in, but I already love it. A goal for me is to read more \"mind-expanding\" books in this year and since this one is one like this \"disguised\" in a story this was my first pick. I am not religious and don't necesserily belive in god, but still the quotes and refernces are. I also enjoy the little drawings along the story. I put a marker right next to my book after the first pages, because there are so many valuable quotes (e.g.: \"Whoever you are , or whatever it is that you do, when you really want something, it's because that desire originated in the soul of the universe\") and they're not pointed out strongly or something, but just come along by the way which makes the setting very authentic and the character (as well as yourself!) grow in a very lovely written way. It is not very complicated written, since I am a foreign student and except for very few words understand it quite well.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I am thankful for the recommondentations!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 24, 2019",
            "id": "amzn1.account.AFDJ3E4UXEHSBZORDLJE5XIVNRVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFDJ3E4UXEHSBZORDLJE5XIVNRVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I don’t understand all the hype about this book. Found it to be very boring.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Disappointing!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 4, 2020",
            "id": "amzn1.account.AGTNNYPJW5L2EJU2ZZ6Z673FEGKQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGTNNYPJW5L2EJU2ZZ6Z673FEGKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It took me a while to get through this book because like some Americans after a diet of television my level of concentration was for naught. Any who, once I was able to focus - man!, so many jewels of wisdom in this little book. For those that normally read spirituality/self-help/self-improvement this is a MUST for your library. My son (who's slightly autistic) is now reading it and having his mind blown. It's worth the purchase; don't just get it from your local library.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The importance of finding your \"Personal Legend\"\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 6, 2017",
            "id": "amzn1.account.AF3FGDQS3CSYVRSGBHGHIZ7A662A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF3FGDQS3CSYVRSGBHGHIZ7A662A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Great book. If you know anyone at a crossroads  in their life, give them this book. If you are anchored down by fear due to potential of the possibilities before you, read this book. If you want to take a risk but are scared about what that risk might do to your life, read this bookI do recommend watching The Secret before so that you can appreciate the science behind these delightful lesson because it's not the universe that will always conspire in your favor, it's simply YOU.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Watch the Secret and then read this book...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 26, 2020",
            "id": "amzn1.account.AGQLKWWRLCWOIZMAJZJKS34VB22Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGQLKWWRLCWOIZMAJZJKS34VB22Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I just finished the Alchemist, and now I know why many people love this book. It is hard to describe. It is deceptively simple, with much more going on than appears on the surface. I liked the way the author interweaves much from world religions, but I mostly I liked the bits included from my own religion. (Christianity)... One thing I must admit though.... This left me wishing I was one of the first readers of this story, instead of possibly the last man on earth who hadn’t. I must admit that I had EXTREMELY high expectations for the book, since I heard and read over and over and over that it was “...one of my favorites”....or...”...one of the greatest books of the 20th century..”, etc etc ... It set up my reading for the inevitable let down that comes from anything that has been built up to “the second coming of Christ”. (i.e... movies, vacation, Christmas morning, etc). I DO feel like it is one I’ll read again sometime, to try to catch more hidden gems and bits of treasure the author has hidden in the story. So, I must say, for me to want to Reread any book.... THAT is saying something. So it MUST be a special work.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Liked it..... but a little confused (1st time reading)\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 24, 2019",
            "id": "amzn1.account.AH57PLCBGTQCSGGUTSQS7OSDUJSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH57PLCBGTQCSGGUTSQS7OSDUJSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Quick and enjoying read. It flows so well and goes by quickly while being thought provoking at the same time. So many people love this book and yet many dislike it completely. It is an easy read and does have many outside fables/stories/quotes(I cannot think of the right word here). It makes me wonder if it is ones time in life they chose to read the book that makes a difference? Maybe it is just people’s different views of the world. Is your cup half full or half empty?\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great Book\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 27, 2019",
            "id": "amzn1.account.AHTRKIOHZYHZF4KTE7RQVZHCIIGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHTRKIOHZYHZF4KTE7RQVZHCIIGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I absolutely hated this book and wish I could rate it lower. Personally I believe this book would make great kindling. I love reading but this book was pure torture and I am never going to read it again.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    THIS IS THE WORST BOOK I HAVE EVER READ!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 15, 2019",
            "id": "amzn1.account.AEZUUOTGAWQGOHS74GSHJ5MV43MQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZUUOTGAWQGOHS74GSHJ5MV43MQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This is such a highly rated book that I was excited to read it. I couldn't relate to this at all. Seriously do not understand the hype.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    big disappointment\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 30, 2019",
            "id": "amzn1.account.AGRELWAL4DCMDFZR4CKNNPKAPCFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGRELWAL4DCMDFZR4CKNNPKAPCFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I purchased The Alchemist as a book-club suggestion. It was written in 1985; and there’s no way that I’d recommend reading it for pleasure. If you read it, you deserve 3-college credits.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist is an allegory loaded with symbolism; nothing is what it seems!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 29, 2017",
            "id": "amzn1.account.AH6L3CFZV6TGL6MEJVG6O3OMSIBQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH6L3CFZV6TGL6MEJVG6O3OMSIBQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I had seen this title on bookstore shelves many times over the years but had never gotten around to reading it. It was Christmas day, 2016 when my wife and I came across \"The Alchemist\" in the Kindle store and decided it would be a good book to read together. It did not disappoint.\"The Alchemist\" reads like a fairy tail or a mythic legend. It's a delightful read with iconic characters and classic lessons of Western mysticism sprinkled throughout. For anyone who is familiar with the teachings of the Rosicrucian style mystery schools, this story will be a refreshing reminder of the truths we hold most dear. For those who haven't had any exposure to that brand of spirituality, you will find in \"The Alchemist\" a parable that may bring some clarity and direction into your life.I can especially recommend this book for teens and young adults. People at that age are still trying to find their world view and the lessons in this book may make their search easier and more fruitful.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A Simplistic Story with a Spiritual Bent\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 4, 2018",
            "id": "amzn1.account.AE7L7LYZICF5RBVCVO2GFKBQ3Z3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE7L7LYZICF5RBVCVO2GFKBQ3Z3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Books are like very personal items; either you're interested in the subject matter or you're not but somebody else is.  Open the cover and take your chances.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not for me...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 19, 2019",
            "id": "amzn1.account.AGQVTFWDOOWUSCNK5EBFYSGRIMNQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGQVTFWDOOWUSCNK5EBFYSGRIMNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Alchemist by Paulo Coelho is a very interesting book that explores many concepts in life, such as personal legends, travel, love, and belief. Through these concepts, the reader is opened up to new ideas and perspectives all while the main character,Santiago is too. I personally feel that this book has taught me a little bit more about life through quotes from the secondary characters who guide Santiago through the story. For example, “to realize one’s destiny is a person's only obligation,” was said by the alchemist and it made me realize that this idea actually applies to real life, because once someone realizes their destiny, they will always fulfill that destiny and succeed in life. One thing that Coelho does very well in this book is the character development and interactions. Santiago, the main character is introduced in the beginning of the book as a curious shepherd who wants to explore the world. He is a very dynamic character, so throughout the story, he learns lessons about himself or the world that make him wiser. An interesting thing that Coelho does is throughout the book, Santiago encounters many different people and each time this happens, he becomes wiser and more experienced. For example, Santiago encounters a gypsy in the beginning of the book who helps him realize his “personal legend”/destiny, then he meets a king who convinces him to follow that personal legend and why every man should. He also meets a girl who exposes him to love and an alchemist who shows him the ways of alchemy. Santiago’s dynamic character and his guides and teachers are a very strong aspect of this book. Throughout the book, Santiago and other characters bring up the term “personal legend” repeatedly to remind the reader of the main focus of the story. Personal legend is almost the same thing as a destiny. Everybody has a personal legend. Because the author chose Santiago’s personal legend as the main focus, the reader is able to connect with and learn about Santiago more than they would with other fictional characters. Coelho choses an adventure that is very personal to the main character for this very reason. As well as telling a story, Coelho tries to tell the reader something with his repetition of the term “personal legend” and the constant in depth conversations and thoughts about it throughout the book. By going in depth to what it means and repeating it so much, the reader starts to realize that they too must have a personal legend and follow it as Santiago did. Overall, this book is very well structured and has many great aspects about it with little to no flaws. The character structure, plot development, and connection from book to reader is amazingly done by the author, Paulo Coelho.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Book Review By will powers\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 1, 2014",
            "id": "amzn1.account.AFKTOWEZP2N3YFE5HCFE3XB54B4Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFKTOWEZP2N3YFE5HCFE3XB54B4Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    An interesting parable on life, this story takes us on a modern journey with ageless life lessons.  A shepherd boy living in Andulisia meets up with a mystical figure Mechizedek, who represents himself as the King of Salem.  The obvious reference here is the Melchizedek of ancient Biblical fame, to whom homage and tithes were paid.  He was a prophet and a high priest, and in this story he fulfils those roles for this young shepherd.  It seems that the lad needed to find his own story and find his life message, which takes him on a journey to North Africa to search out his treasure which he is led to believe is at the site of the Egyptian pyramids.  He is robbed, he has to give up treasures, he meets with a person who is searching for how to make gold from other metals ( thus the alchemist title).  In all of these wanderings, he discovers love, treasure and life lessons, the most apparent of these lessons is this: \"follow your heart, for where your heart is, your treasure is also\".  The Biblical theme in this story is woven throughout the characters and events in an interesting and pleasant fashion, making this a fun read.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Parable on Life Dreams\n  \n"
        }
    ]
}