{"reviews":[{"author":"Not found","date":"Reviewed in the United States on December 21, 2019","id":"amzn1.account.AEINIH7IBOFAPYS3M33VNCMBWJ3A","link":"https://www.amazon.com/gp/profile/amzn1.account.AEINIH7IBOFAPYS3M33VNCMBWJ3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":4,"text":"\n\n\n\n\n\n\n\n  \n  \n    I had the 2019 air pods and some Bose noise cancelling headphones.  These air pod pros fit in my ear canal well. They don't hurt my ear after a while. The noise cancelling is excellent. I turn them off when somebody needs to talk to me in a loud environment (e.g. Starbucks) by just short holding one of the tips. The difference is noticeable. I like how you can pause and unpause.  The sound quality is really good but not as good as over the ear noise cancelling headphones which I expected. I do wish there was more functionality for phone calls such as mute/unmute and hangup.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Noise cancelling is nice\n  \n"},{"author":"Not found","date":"Reviewed in the United States on November 30, 2019","id":"amzn1.account.AE6MWHRIKDRQS56VLXDWDNPADAJQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AE6MWHRIKDRQS56VLXDWDNPADAJQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n     Ambos lados puedes usarlos diferentes opciones, por ejemplo: el auricular derecho puedes hacer para llamar a SIRI, y en el auricular izquierdo puedes activar la cancelacion de ruido. O viceversa.. lo unico que le falto fue un control de volumen.. infelizmente solo puedes subir y bajar el volumen desde tu celular.. resto esta muy bueno..\n  \n  \n","title":"\n\n\n\n\n\n\n\n  \n    Esta muy bueno, solo falto el control del volumen en el auricular\n  \n  \n"},{"author":"Not found","date":"Reviewed in the United States on April 17, 2020","id":"amzn1.account.AEZQC3SPZ4QBOTJIT66J6BTY5X3Q","link":"https://www.amazon.com/gp/profile/amzn1.account.AEZQC3SPZ4QBOTJIT66J6BTY5X3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":2,"text":"\n\n\n\n\n\n\n\n  \n  \n    So, I got a pair the day after they were released for the first time. When I put them on the noise cancelation felt magical. Unfortunately my dog chewed them up two weeks later. Fast forward to last week, when I finally bit the bullet and spent the crazy amount of money on a new pair. For some reason they just didn’t sound the same. A few days ago, I finally came across an article talking about the firmware updates. Apparently, This is something that happens automatically and Apple really botched it. It’s completely destroyed the noice cancelling capabilities and once it is updated it can’t go back. I’ve lost all trust in Apple for keeping this quiet and refusing to rectify the situation or address it in any way.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY. Apple botched firmware updates and it ruined noise cancellation!!! It can’t be fixed!\n  \n"},{"author":"Not found","date":"Reviewed in the United States on December 14, 2019","id":"amzn1.account.AEE3UAMRIIOXD6QGERVGM774WTBA","link":"https://www.amazon.com/gp/profile/amzn1.account.AEE3UAMRIIOXD6QGERVGM774WTBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":2,"text":"\n\n\n\n\n\n\n\n  \n  \n    Not worth the money.  Very disappointed in the noise cancellation.  I’ve worn these on a plane and they only cancel out about 60% of the engine noise.  I occasionally work in a large data center where there’s a consistent equipment hum of about 84 decibels, and I estimate that these are only blocking out about 75% of the noise.  The noise cancellation software needs some serious updating.  The sound transparency mode is pretty good so that you can hear people talking and sounds around you.  There’s just a slight filtering of the sound, so it’s not completely transparent.  Good enough to leave the EarPods in and still hear what’s going on around you.The BIG downside to these are that the EASILY fall out!!  I’ve tried the different sized ear tips, and ran the Air Pods Pro sound/noise cancellation tests and I’m using the correct size tips.  On a plane, I nodded off for a bit and woke up to a missing AirPod.  I had to wait until the plane landed and everyone got off to search for the AirPod.  It rolled a few rows back winding up under a seat with a bunch of garbage and dirt.  On a return trip, I put them in, and within 5 minutes, one fell out again.  Forget about moving around with them in, as they will definitely fall out.  If you bend over, they fall out.  You will find yourself constantly pushing them in to avoid losing them.  I had to buy a silicone strap to keep the two attached to each other so the don’t venture off.  The use of the strap is ridiculous, and shouldn’t be necessary, but I don’t feel like buying a replacement AirPod and wasting more money.The battery charge lasts at least five hours, and charges quite quickly in the included charging case.Overall, save yourself about $200 and spend $50 on a decent pair of wired ear buds, which will have the same audio quality.  A very disappointing purchase!!\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Fall out EASILY!  Noise cancellation isn’t great.  Waste of money.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on January 22, 2020","id":"amzn1.account.AGI2EXU5RN43KKQRCLEQXKZUO32Q","link":"https://www.amazon.com/gp/profile/amzn1.account.AGI2EXU5RN43KKQRCLEQXKZUO32Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    Sounds quality is maybe on par with the regular AirPods. The sub-bass is non-existent and the low-end in general is absolutely anemic. The Noise Cancellation was pretty good until they updated it and made it almost useless. You can still hear almost everything when ANC is activated now, it had no problem drowning out car noises on the first firmware. Why Apple would willingly choose to nerf their product and not release an update to fix it almost a month later shows that these are absolutely not ready for market. If you want to waste $250 to be a market tester for some not-so-great sounding headphones, this is for you. Everyone else just avoid them and stick to the standards or another brand altogether like the Sony WF-1000XM3's for better sound and Noise Cancellation\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Not very good, not worth even close to $250\n  \n"},{"author":"Not found","date":"Reviewed in the United States on December 24, 2019","id":"amzn1.account.AG5E4UHZ3B2GJK3AWS4YQVQMOIAQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AG5E4UHZ3B2GJK3AWS4YQVQMOIAQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    Honestly, I was a little bit spectacle about purchasing this AirPods, because I know the original ones are just like the wired Apple earphones, where you can hear the sounds from outside and I did not want to spend 100$+ for earphones that can hear outside! Smh So I did my research diligently (for weeks). Finally decided to purchase the AirPods pros for my birthday especially because I love Apple and after my LG TONE Pro HBS-770 broke down within 10 months smh, never buying again.I am a huge audiophile and especially when it comes to picture and sound; I look for the best. I tested both LG and AirPod Pro and the Pros comes in first because it does block out any noise from the outside - I would say mostly 80%. I also hear that it adapts to the sound to actively block out any noise outside especially when I shop: I can’t hear my footsteps, the people around, the car on the streets. It’s amazing! Plus I can leave them in my ear and they are so comfortable, especially when I’m on the treadmill they stick like glue! Plus it helps with the sweat resistant feature the AirPods provide! Sometimes I forget they are in my ear lol also the transparency mode works well so I don’t have to remove my earphones (but seriously I’m listening to music why are you talking to me) lolI also love switching between Noise cancellation and transparency modes. Golden. Even when the modes for Off, the sound is still particularly good.My recommendation is that if you are or not an audiophile and you want to purchase AirPods, go for the AirPod Pros. You won’t be disappointed. 249$ it can be high, but it’s money well spent. It’s better to spend a little more or a lot more to get what you want versus spending 100$ less and you aren’t satisfied.... life is too short! Enjoy while you can :D Plus 249$, I mean... we spent 249$ on anything else :P\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Amazing! My favourite wireless earphones!\n  \n"},{"author":"Not found","date":"Reviewed in the United States on December 5, 2019","id":"amzn1.account.AHBQSX2GKUQ34ZTEFRA66XX323PQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AHBQSX2GKUQ34ZTEFRA66XX323PQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":3,"text":"\n\n\n\n\n\n\n\n  \n  \n    The noise cancellation isn't the greatest. Of course, our expectations for the noise cancellation won't be similar to Sony's  wh-1000xm3 be we should expect it to be pretty decent right? It's not. People have had concerns about the if listeners would hear a car or train coming up behind them but listeners have nothing to fear. In a relatively quiet room, the noise cancellation sounds great. Any fans, AC noise, etc is canceled out. However, once you start going about your day, outside noises can still be heard while having the volume 2/3 of the way up.Now that is assuming that the pros are able to stay in your ear. I tend to smile a lot throughout my day and sadly when I do, the airpods slip out. I tried both the medium and the small buds to see if my problem would be fixed. It wasn't.Compared to the gen 2 airpods, the pros have great additions. The noise cancellation and the replacement of the buttons used in previous generations are great. However, the pros do lack when it comes to fit, noise cancellation, and price. Additionally, they are not the prettiest. The short neck looks awkward and out of place.I recommend that you try before you buy. Go to an Apple store and ask one of the representatives if you can try on the pros before you buy them. Also, ask them to clean them beforehand. Perform a variety of head movements (depending on how confident you are in public you can try headbanging, head shaking, running in place, etc etc) to make sure that they fit properly. Finally, make sure you smile while you wear them.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Eh. not worth $270\n  \n"},{"author":"Not found","date":"Reviewed in the United States on January 13, 2020","id":"amzn1.account.AHDANARAVQLHGW3NLTYWMU7AIIOA","link":"https://www.amazon.com/gp/profile/amzn1.account.AHDANARAVQLHGW3NLTYWMU7AIIOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":4,"text":"\n\n\n\n\n\n\n\n  \n  \n    Hello so I’m coming from air pods 2. I guess sweat got into it or light rain got into but I had to sell those because they started to mess up on me..Apple doesn’t say they are sweat proof or any IP rating so I guess that’s my fault. The fit was perfect they never feel off and I loved them.Now I’ve tried a lot of different types but they would all fall off true wireless ones. I said the hell wit them and I went for air pods pro because of familiarity and IP rating.Pros:Secure fit (didn’t fall off my ears while running).Sweat proof.Noise cancellation (didn’t hear cars next to me).Phone calls.Lightweight.Shorter stem.transparency mode.Replaceable silicone tips.Cons:This is more my problem my left ear felt “heavier” Not a perfect fit but for some reason my right ear was perfect.Battery. Could be better.Earbud is bigger than airpods 2.I will come back and update my review as I get more familiar with air pods pro as I go on runs more. That’s if I find anything I must let you guys know about.Thank you.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    20-25mile per week runner. Air Pods Pro review.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on December 16, 2019","id":"amzn1.account.AH6ZI2QZEKQKSCC4ZMRB26IB6HWA","link":"https://www.amazon.com/gp/profile/amzn1.account.AH6ZI2QZEKQKSCC4ZMRB26IB6HWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    The reviews are right on target...these ear pods are quite remarkable!  The technology that went into creating very good sound quality, good comfort and very easy and flexible setup is amazing. Normally I haven’t been comfortable wearing and of the EarPods Apple have sent me with iPhones in the past. An hour at best and I was happy to remove them. These I can wear and have worn for three hours with no need to remove them.Sound wise they aren’t going to make me throw away my Bose Quiet Comfort headphones or even my pair of ten year old Sony Open Ear headphones. But the sound is perfect for background listening of classical orchestra and piano. I love them in the background while reading, doing desk work and even taking my daily hour long outdoor walk. I mostly use transparency mode especially when walking outdoors where safety is a factor. And indoors I don’t need noise quieting.A big advantage with these  Ear Buds is the freedom of movement and long playing time. My main music source is an Apple 11 Pro iPhone and an app I found online with streaming classical music. I also have a number of downloaded music from my Amazon Prime and use this outdoors where I have no internet.All in all...five stars. My only concern is expected lifetime (two years...maybe?). And I wish they were flesh colored not Polar White.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Well deserved FIVE Stars.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on November 30, 2019","id":"amzn1.account.AHUILFWVOTDOB2Y27UABXS7GJVLQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AHUILFWVOTDOB2Y27UABXS7GJVLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    I have been avoiding the Apple AirPods since when I tried them I couldn't keep them in my ear and they constantly fall out.  The original AirPods did not have the ear piece that the Pro comes with.  The original was annoying with meh sound quality and no noise cancellation feature.The AirPods Pro are definitely different.  I don't have any problem keeping them in my ear as I walk and the sounds quality is so crisp on both sides I have not had any bluetooth device work so well like these.  However, they do get a bit of getting used to since there's no actual buttons or anything to push on the AirPods.  But get used to the following is not that hard: Using two fingers, squeeze the flat side on each AirPod. You'll hear a click in your ear with each press.Single-press: Pause/playDouble-press: Skip forwardTriple-press: Skip backwardLong-press: Switch between noise cancellation and transparency mode.Another cool feature that's included allows the user to check which ear tip is better to use for you by allowing the software check the quality of the sound.  To run the test, open the Settings app on your iPhone, select Bluetooth and tap on the \"i\" next to the name of your AirPods Pro. Select Ear Tip Fit Test, and then follow the prompts.I ordered a second pair for my better half.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    These actually work\n  \n"}],"title":"Apple AirPods Pro"}