{
    "reviews": [
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 22, 2017",
            "id": "amzn1.account.AEOCDEER6RGRUC22IF5HRC2Z372A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEOCDEER6RGRUC22IF5HRC2Z372A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    \"They don't make em like they used to.\"  I owned a total of ONE 360 controller and it did fine. Im currently ordering my FORTH One controller. Stick failure and a broken trigger in the first two, the original black ones. I had higher hopes for this one but stick drift after only having it a couple of months. It's ridiculous there's no more quality in official Microsoft products than this. I'd shell out for the Elite controller and come out ahead on money but from what I gear they eventually break down as well.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great....while it works\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 21, 2017",
            "id": "amzn1.account.AGOXTP62KGEW2LZGMAMX6WRUIDWA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGOXTP62KGEW2LZGMAMX6WRUIDWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Purchase this as a replacement for my old Xbox One controller. This one is a lot better! It has the textured grip on the sides, Bluetooth compatibility, and a 3.5mm jack, and has button mapping capabilities.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This one is a lot better! It has the textured grip on the sides\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 30, 2018",
            "id": "amzn1.account.AEYIT5HASB5EUIYVU5KNNQ6HPMLA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEYIT5HASB5EUIYVU5KNNQ6HPMLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have two of these controllers and both of them have broken inside for the headphone jack.  I would not recommend these.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Headphone jack junk\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 14, 2018",
            "id": "amzn1.account.AEAHLI3N2DS3IAL4MCDS7IZPOELQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEAHLI3N2DS3IAL4MCDS7IZPOELQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Works as advertised.  I bought this specifically to use via Bluetooth on a custom gaming pc (paired with an ASUS Z270e mobo), and it worked well with no setup required beyond the initial pairing under system settings.  I have noticed that its connection time varies, and that it tends to connect fast when I point it right at my tower (I have it underneath my desk), but that's not worth losing a star.  Once it's connected, I haven't had a single drop, and I'm happier having this to use on certain games than the standard keyboard and mouse.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Works Just Fine\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 25, 2017",
            "id": "amzn1.account.AGTFYL4ZAR3YDHETVDEYPSGGNFWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGTFYL4ZAR3YDHETVDEYPSGGNFWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Excellent original manufacturer equipment. Top is satin gloss and bottom is a bit grippy, which should be great when you've been playing for several hours. LFT and RGT joystick toggles are also grippy.All buttons, joysticks, bumpers and triggers moderately stiff, which is good for accuracy of play. Arrived with fresh Duracell batteries.Earphone Jack? Yes.Bluetooth? YesI've included some photos\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Excellent original manufacturer equipment\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 11, 2018",
            "id": "amzn1.account.AH77WNQJ6QMZGXEXNBGCOXRZ756A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH77WNQJ6QMZGXEXNBGCOXRZ756A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have had an Xbox One since the original launch and one of the controllers finally started to fade out (L joystick would keep moving in one direction even when not going that way). Picked up this controller on Amazon, due to the $10 off for Prime members and it works and plays as intended. This newer controller feels just a tad heavier than the launch day ones I have. I do like the slight textured finish on the newer models vs. the very slick finish on the older models. Yes, it does come with the 3.5mm headset jack at the bottom.Overall, does what it is meant to do and was a good value!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Replaced launch day controller\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 14, 2017",
            "id": "amzn1.account.AFR2KBPAK3BPWU2UPBSON2I2QZSA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFR2KBPAK3BPWU2UPBSON2I2QZSA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    When I ordered the controller, it came in 2 days. I opened the box and saw the controller in a Xbox one controller box just like if you would have gotten it from GameStop or Best Buy. It came with 2 long lasting batteries. Those batteries lasted me 2 months. They controller was in outstanding condition. The price was right. I extremely love the ice white color. The reaction time of the buttons are faster and smoother that the regular Xbox one controller. Thank you M&M Gaming.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Outstanding\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 6, 2017",
            "id": "amzn1.account.AED4UQMYNCA5OQSJ6XMYA3SCRHIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AED4UQMYNCA5OQSJ6XMYA3SCRHIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My new controller arrived on time and has been gaming hard every since. Seems to be a decent enough controller. The finish isn't as smooth as the older models, but I like the soft texture feeling. Easily sync'd with my Xbone and my chargeable battery pack fit perfectly. It is really nice to have a new controller that doesn't continue to walk when I release the thumb stick. The 3.5 jack works without issue with my regular Xbone headset. If you need a good controller for a decent price, grab this.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Happy Gamer\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 19, 2018",
            "id": "amzn1.account.AHYBPZFPVJTPR2PUVK6XVBAPFSYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHYBPZFPVJTPR2PUVK6XVBAPFSYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I hardly have time to get on Xbox... but I bought this controller in January... thinking it would have a good warranty... usually 1 year.  But the darn thing moves forward on me without even touching the controller... the seller said I had to call Microsoft myself and it had a 1 year warranty... but I contacted Microsoft and the controller is only a 90 day warranty item.  Very very disappointing that MS would put their name on such a horrible and CHEAP product.  Then Customer Service tells me... \"Next time buy an Elite\"  WTH???  wow!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not happy!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 20, 2018",
            "id": "amzn1.account.AE4GIOAEUILBSXS5FSVE64MMDARQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE4GIOAEUILBSXS5FSVE64MMDARQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    When it works, it's very good. It worked fine for 18 months and now has upwards drift in the right stick and the left stick skips when used for navigation in Xbox menus. I've tried various techniques for adjustment and cleaning of the controller and none have worked. I am the only user and I tend to play some every day. I'm an adult and I don't throw the controller around, my hands are clean and I keep food and drink away from it. It has never been dropped, thrown, hurled or chucked across the room. I know a bit about electronic and electrical components and there is ZERO reason for something like this to wear out in this period of time. Microsoft could spend like maybe 50 cents to a dollar more on the resistive components on the sticks to ensure they would remain free of dust and have a very long life.  But they don't because they know we will always need a controller. They know we won't throw out the Xbox and all our games because they chose to make a controller that won't last. They see us as dupes and as another income stream. As if the income from Xbox Live isn't enough. This is one small reason why people are beginning to realize that big companies are not something to celebrate or hold in esteem, but rather are manipulators and thieves who have no other goal than to find new ways of getting into our wallets. We can fight this, but we have to stop putting businesses and their leaders on pedestals and instead treat them with skepticism and disdain until they begin to behave in a more ethical manner.  Oh and we should regulate the crud out of them until they figure this out.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not durable enough\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 3, 2018",
            "id": "amzn1.account.AHVO45Y2TBUXFH52AXJBQSTMLI6A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHVO45Y2TBUXFH52AXJBQSTMLI6A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought on May 1st, 2018 and my controller  stopped working today June 3rd, 2018.  Won't charge or light up and now that the 30 days are up, I'm unable to return it to get a replacement.  Very disappointing.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Controller was defective.  No longer worked after 33 days.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 9, 2018",
            "id": "amzn1.account.AEOH3FTLY4WI2K6PBYS4SNYONJ2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEOH3FTLY4WI2K6PBYS4SNYONJ2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Owed two of these. Horrible! Get the cheap wired controllers if you want controllers to last more than one week. Strange, I know. The issue with official XBOX One controllers is they cut costs by buying really bad switches for the analog sticks. They will start drifting up or to the side even when your finger is not touching them at all. I looked it up on google and its a major problem. Some fixes work, but only temporary. You should not need to open your controller to fixes issues every month.I seriously bought cheaper wired controllers (2 of them) and have not had any issues. they were <$30 each and USB extending cables from Amazon (<$9) still cheaper than some of these >$70 controllers\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    NO, Please buy cheap wired controllers. They will last longer than these ( 1 week). Google these and see\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 21, 2017",
            "id": "amzn1.account.AHCKKAZGXJ54B23ZY75EVH6FHAWA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHCKKAZGXJ54B23ZY75EVH6FHAWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If you tend to switch between the keyboard and wanting a controller for your gaming habits on PC, then this would be your go to controller to get if you did love the Xbox 360 controller for the PC. The buttons all feel tactile and presses really fine to a high accuracy. What ever Microsoft did to manufacture and also the software to communicate so well from the controller to the PC is like 0 lag feedback. I can play FPS games real well with this if i don't want to use my mouse and keyboard. Plus factor to this is that there are also many skins out there to customize the cosmetics of your controller and you can switch between AA batteries or having the Play and Charge Kit.Highlights:- Connects seamlessly when using adapter- Switch between AA batteries or Play & Charge Kit- Huge market to customize your controller with accessories and decals- It's Wireless\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Your Only Wireless Controller You Need For PC/Xbox One\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 17, 2019",
            "id": "amzn1.account.AF46SLZUCHJV2LCG2FLA7OJ64ALQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF46SLZUCHJV2LCG2FLA7OJ64ALQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Any gamer will know that your sticks will break eventually from clicking left stick to run in CoD. This controller broke FAR SOONER than any controller I've bought, and I've been through maybe 6 in my time since starting on the 360. Im pissed right now. I've had it for 6 months and usually to break a controller it takes me at least a year or two. Do yourself a favor and look elsewhere bc I certainly will not be repurchasing model. Thanks for nothing Microsoft! They should really add some extra buttons on the back of the basic controllers to remedy this problem. Instead of making you pay the price of 3 new controllers to get an elite. Stop trying to bleed us dry\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Find a different xbox controller\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 11, 2017",
            "id": "amzn1.account.AFD6KROC2DHPNIJIR4743VTCDRTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFD6KROC2DHPNIJIR4743VTCDRTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Worked ok for about 5 months.  Now anytime we use it the cursor on the screen scrolls right like the thumbstick or d-pad is pressed that way, even though it is centered.  If you push any other buttons or hold the thumbstick left to try and counter this, it will register one press left and then start scrolling right again.  My original joystick is still working great after 2 years.  Now I cannot play any 2 player games with my son.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good while it lasted.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 8, 2018",
            "id": "amzn1.account.AG3TVZGBGRUJQH42R3YUYRULYP4Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG3TVZGBGRUJQH42R3YUYRULYP4Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have tried and tried to use this controller but it is constantly disconnecting. I have had several others to try and see if it works for them or if its just me but NOPE it will still constantly disconnect. The only way to get it back is to remove the battery and turn it back on.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Contant disconnection\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 1, 2017",
            "id": "amzn1.account.AGK7WFXLBOW2WOILPJHQWYAQPUUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGK7WFXLBOW2WOILPJHQWYAQPUUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So after using this controller for over a month I've had no problems...then all of a sudden today it turned off and would not turn back on. I took out the battery pack and put in new batteries to try to turn it on and it still would not turn on, I took those same  batteries and put then in a flash light and it came on. I even tried to recharge the controller using the charging cable that came with the battery pack and it wouldn't even light up as if some circuits or something are fried in the controller. I tried holding the power button for over 1 min and it still won't turn on. The controller hasn't been damaged in any way since I've had it and no liquid has hit the controller, nor has it been in extreme heat.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Defective after 1 month?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 3, 2017",
            "id": "amzn1.account.AH5WTJGJAXMEJTMZ6ZGIXQPSQ2XQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH5WTJGJAXMEJTMZ6ZGIXQPSQ2XQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    WARNING - Do not buy! Not as described. I don`t know if this is amazons fault or the sellers, but the product I was sold was labeled differently. This is not the White controller that originally came out in 2015, Special Edition white as described in the photos. What came was the normal Xbox white controller, which is much smaller, and does not have black on front, its all white. All I know is someone is intentionally selling falsely described products to customers and this is absolutely ridiculous.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    PURCHASED TWICE, DIFFERENT SELLERS, SAME RESULT\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 13, 2019",
            "id": "amzn1.account.AEWUZLJJM5RCN5RSONEEPFP7NA2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEWUZLJJM5RCN5RSONEEPFP7NA2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I play most of my games on my PC - I work in IT so building a PC is a trivial task for me - I haven't gotten a prebuilt desktop in decades. I always like to have a controller though - easier to play on the couch, some games are wonky with the keyboard, and it makes emulation easier.For the past few years I have been using a PS4 controller because I already owned one, but it's a hassle to use on Windows. You need to install third party software for Windows to recognize it, its very temperamental, and a chunk of the features don't work properly because you're using said third party software. Getting the PS4 controller connected wirelessly is an ordeal too - again, since you're using third party software the controller never wants to connect. Steam has built in PS4 controller support, but getting that to function wirelessly is an even bigger ordeal than normal. So you're generally stuck using a wire.I decided to order the Xbox one controller because my buddies were raving about it. The difference between the two controllers is like night and day.First thing is, the Xbox controller is more ergonomic. It takes a little while to get use to the button placement, but it ends up feeling better and more natural. The shape of the controller fits your hand better, and the triggers feel much better. I do miss having the touch pad sometimes, but most of the time I'm just happy I'm not hitting it by mistake. The controller feels much higher quality, and it looks nice too.But the biggest improvement was the ease of setup and reliability. All you have to do is plug it in. That's it. No third party software, no finagling with steam, nothing. It just werks™. Even the little Xbox button works - it pulls up a context sensitive menu. Heck, I can even use the controller outside games with no issue.Setting it up over bluetooth was a breeze too - i paired it one time and that was it. It turns out on it's own after a period of inactivity, and turning it back on just means pushing the Xbox button. With the PS4 controller getting it to reconnect each time watching an ordeal because of the software.One thing that excited me was the ability to plug a wired headset into the jack on the controller and still use the controller wirelessly. That meant I could use a wired headset from across the room just for discord or skype, while still having the sound for the game coming from my high end speakers. But there was a snag - you can't do that over Bluetooth. You can only do it plugged in over usb, or if using the Xbox one wireless adapter, which uses a proprietary format. Thankfully, that adapter was less than 20$ so I ordered one.But there is another snag - you either need to be using a headset with the special Xbox one headset adapter built in, or buy the adapter separately. Now this was a bummer - the adapter itself costs around 60$! So I tried plugging in a regular 3.5 headset to see if it would work anyway, but unfortunately it did not.I bought a Microsoft brand Xbox one headset today, and it works great. The quality isn't amazing, but that's the headsets fault and not the controller. I'm just using the headset for discord anyway - the quality doesn't have to be amazing because it's just for chat. It only covers one ear and is lightweight, so I'm perfectly able to hear the sound from the game itself coming from my nice speakers.Overall, this is a fantastic controller. Probably one of the best I've ever had. I highly recommend getting one, but just be aware that getting the headphone jack to function on a PC is more work than it appears and costs money.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Awesome controller for PC, but using built in headset jack is complicated\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 6, 2019",
            "id": "amzn1.account.AHXCV7INVGIGG4AFNXTBV2ZC5PLA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHXCV7INVGIGG4AFNXTBV2ZC5PLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I'm very happy with this controller, I am using it for a gaming PC.I've been using Xbox 360 wireless controllers for few years, and in my opinion this Xbox One controller is a true upgrade.The controller feels slightly less substantial in both size and weight, but I find the shoulder buttons and triggers to function better, and the d-pad is a very significant Improvement.A built-in Bluetooth functionality save me from having to buy a wireless connector, like I had to for the Xbox 360 controllers.  ( I find it odd that if I want to use the elite version of this controller, I have to buy the wireless dongle...)This controller also adds the option to turn it off by holding the center button, which the Xbox 360 controllers did not have.I also like the white color that I chose, the textured plastic surface is very comfortable, and the grip texture on the thumbsticks is out of this world.I've got about a dozen hours on it so far and everything has felt great, I was on the fence between getting this in the elite version...  obviously, that controller has more capabilities but the extra $140 I would have had to spend just didn't seem worth it...  Though truthfully, I might get myself an Xbox Elite controller for my birthday anyway.In the meantime, I am extremely pleased with this controller and recommended highly.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Significant Upgrade for PC/360 users.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 5, 2018",
            "id": "amzn1.account.AFOM6LUW3R7TDYVNVSQPUD3LSSTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFOM6LUW3R7TDYVNVSQPUD3LSSTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Xbox Wireless Controller - WhiteI have an Xbox One S [link below] and wanted to play my games with my friends and roommates locally. Needless to say that this was a necessary purchase. A year later, after heavy usage the controller still works great and is still being used a ton. Looks good with my white console as well!Xbox One S:Xbox One S 500GB ConsoleI am a part of the Amazon Associate Program\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Looks good and feels good after a year of heavy use\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 12, 2018",
            "id": "amzn1.account.AHNT7WQ2O2GOIHR4PTU3W3ZLQ4SQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHNT7WQ2O2GOIHR4PTU3W3ZLQ4SQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Purchased this as a secondary/backup controller as my original controller is 5 years old and the thumb sticks are finally starting to wear down.This one felt so crisp and new when I first got it and still feels that way compared to my original controller.This controller works at a much more extended range than my other and functions over Bluetooth which I really appreciate. Makes for a better connection and allows you to easily pair to a computer as well.My original controller is smooth and without grip, this controller, like most new XB1 controllers has an extremely fine grip where you hold the controller on either side. It’s the standard plastic (tons of tiny raised dots) and not a rubber grip. Some people like it, sometimes I do, but oftentimes I find it makes my hands sweat? This isn’t the case when I use my smooth original controller.All things considered this is still a nice controller and feels very responsive.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Subtle Grip, Responsive and Crisp, added Bluetooth Functionality\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 11, 2019",
            "id": "amzn1.account.AHO5XBZGNYIA2PD3Y6UJLZ6FPCEA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHO5XBZGNYIA2PD3Y6UJLZ6FPCEA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Ordered as a replacement for an old controller that finally gave out. Arrived quicker than expected. Upon opening the box, the controller had visible dirt/gunk/etc in the crevices between panels, buttons, and on the base of the control sticks. First usage also showed that the right control stick had a slow upward drift that makes many games unplayable and text chat unusable. I thought it could be fixed with a simple cleaning -- upon opening the controller the insides were full of the same dirt/gunk from before, it was a genuinely suprising amount for the inside of a controller. After  brushing the stick free of any dirt with a Q-tip, closing the controller up, and testing again, the same problem persisted with the stick drift. Now I'm stuck with a cleaner, yet still broken controller :/\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The shipping time was by far the best part\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 30, 2018",
            "id": "amzn1.account.AF67QMULRJ6GZSZVF6WWANEWQRXQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF67QMULRJ6GZSZVF6WWANEWQRXQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Exactly as described. My only dislike is for some reason my headphones are not as loud as the original that came with my xbox but still works as should.Updating. The analog stick came loose and pops out of place randomly.Update two: left trigger is now not going down consistently. Gets stuck from time to time.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Broken after a month and a half\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 7, 2018",
            "id": "amzn1.account.AGGQQUOZC6TA5N4W3UQOL4UYBV2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGGQQUOZC6TA5N4W3UQOL4UYBV2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Gave as birthday present for nephew who played with it for about a week or so and found problems with the left analog stick. It became \"stuck\" meaning, even though you'd push it all the way forward, the controller wouldn't recgoznie this as being pushed forward until you also pushed it out of the socket in order for it to move a character in game. (In game character/game not the problem.) Also it's not \"stuck\" as in sticky like something sticky was spilled on it. It's the chip inside the controller. As a pro gamer it's disappointing the product was defective and I can't get a refund. Maybe should have paid more for a better controller. Ordered this early in March because of the price compared to other stores such as Game Stop, Wal-Mart, etc. but wasn't eligible for refund because past three months.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Stuck analog stick!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 10, 2019",
            "id": "amzn1.account.AEGGJYGQ3EKDSNFTFHJYZSWKUV3Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGGJYGQ3EKDSNFTFHJYZSWKUV3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought this because the left stick and d-pad on my wired 360 controller was finally giving out, and it felt like it was time for an upgrade. And it certainly feels like an upgrade! The sticks, face-buttons, triggers, and triggers all feel marginally improved (snappier and more responsive, but that might just be due to how old my other controller was), but the BIG improvement is in the d-pad. It's so much easier to interface with quickly without accidentally toggling the wrong direction (Dark Souls, I'm looking at you!), and the area it occupies doesn't feel so raised. All that with Bluetooth compatibility and excellent ergonomics make for a great controller.Some things worth noting:If the controller fully loses power (for instance, if the battery is removed), its memory of Bluetooth connections will be cleared, requiring that you re-pair your controller to your PC. To the best of my knowledge, you can't turn the controller off manually when using it with a PC, but the controller will turn itself off to save battery after a period of inactivity.If you use JoyToKey to map your controller inputs to keyboard inputs (to play games like Fallout 3 or Oblivion on PC with a controller, as I do), there may be extra steps you need to take to restore compatibility. JoyToKey is receiving the inputs from the wireless controller, but for some reason, the inputs don't reach the game. However, if I plug in the wired 360 controller, it'll work again. I'm not sure why this happens, and I haven't found a way around it yet.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Excellent controller for Windows 10\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 10, 2019",
            "id": "amzn1.account.AFFWJTNN3QLUU2TDYH24FJKGFZCA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFWJTNN3QLUU2TDYH24FJKGFZCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have 3 of these where the headphone jack stopped working.  This one was purchased exactly 60 days ago and the headphone jack stopped working. The other two were purchased last summer and have not worked for a long time.  I thought it was a software setting, but this worked great when new and just stopped working this week. The quality is shameful, considering the cost.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Headphone jack stopped working. Piece of crap.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 12, 2019",
            "id": "amzn1.account.AHUKMBK7VGK7SPIBRNOHZBNHRVXA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHUKMBK7VGK7SPIBRNOHZBNHRVXA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Never have written a product review before but I was so annoyed by what I received that this will be my first. As far as design its an average controller and functioned well, however the audiojack was 100% non-functioning. No sound got through to my headset yet I could hear perfectly fine using other controllers. Received the controller on March 11th, took me about 15 minutes to realize I was going to have to return it and be refunded. Will return the controller on March 13th. Please take my advice and DO NOT buy.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Look Elsewhere\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 26, 2019",
            "id": "amzn1.account.AGOCISW5MBEFGYYIJ3AXN5E5LBIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGOCISW5MBEFGYYIJ3AXN5E5LBIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Next day delivery on normal Prime delivery. Genuine Microsoft product sealed in box. Very happy as my original controller’s LB button wouldn’t go up anymore. My original controller (Forza Edition) has rubber grips where your middle finger lies. This one has the same tread patterns there but is the same plastics the rest of the controller.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Excellent\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 13, 2019",
            "id": "amzn1.account.AHSMPF3M33JV7MV4QLZOU72ZSATA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHSMPF3M33JV7MV4QLZOU72ZSATA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have looked at over 100 controllers.I have purchased over 2 dozen. I use them for the PC, and consoles.For the price this one is probably the best value.Works with win 10 PC's and Bluetooth without any extra  configuration.Works with the Xbox one without issue.Its longevity is key - I use this sucker for multiple hours a day nearly every day. No sticky or loose buttons (which I have had in budget controllers) connects and works every day.This is a dependable great controller solution for multiple applications. If you have been doing a bunch of research and don't want to spend the hundreds on a \"Professional Gaming\" controller - this should work great for everything you need.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This is really the best controller for the price.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 7, 2019",
            "id": "amzn1.account.AGGLPIRZM2OVBCHA4HO46Q7EKJZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGGLPIRZM2OVBCHA4HO46Q7EKJZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    first time using this controller right out of the box i find out it is broken. the right analog stick will rest in the neutral position but in game it will register that the analog stick is being pushed down and makes the game irritating to play. This analog drift seems to be a common problem with xbox controllers as this is now my 4th one with this problem. It's advertised as new so i don't understand how this controller can have this problem already. I only bought it from amazon because i had a gift card but now that has made it more of a hassle because i have to return and wait to get a replacement shipped to me again.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    controller broken right out of the box\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 8, 2018",
            "id": "amzn1.account.AHG3S4ZJ6BFXFFAMGMFRA2VER66A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHG3S4ZJ6BFXFFAMGMFRA2VER66A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    YOU get what you pay for.  This was a little cheaper than the one I could buy locally.  I am so disappointed.  I do not claim to be an expert in electronics, but it feels poorly made, like the components are cheap.  The AUX plug broke out after four weeks and one of the buttons feels glitchy.  Funny... after the 1 month return option ran out.  DON'T buy this product.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This controller broke today!! 31 days after ordering\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 20, 2020",
            "id": "amzn1.account.AEJ67GZNIYKYF6M3AP5N5HWYAGSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEJ67GZNIYKYF6M3AP5N5HWYAGSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This controller works perfect with my Xbox One S. But, it's only a matter of time until it too develops drift like the one it replaces. The standard controllers should be recalled by Microsoft for faulty parts.I bought this as a replacement for a controller that developed the dreaded \"drift\". After I had a working controller back, I purchased a repair kit for the other controller. As soon as I opened the controller, I started to understand the issue. A small green colored piece of plastic fell out - which immediately was recognized as part of one of the analog sticks.The reason for the drift is that the control used breaks due to a parts flaw. The parts flaw is that the analog stick not built to handle downward pressure on the small switch. When it breaks off the stick the controller develops drift. Of course the downward pressure is what you need to make your character run in some games, so this will inevitably break quickly and you'll have a drifty controller.If you are handy with a soldering iron and desoldering pump, you can easily replace the analog stick in 10 to 15-minutes and save yourself quite a bit of money, especially if you buy several of them at a time.I'm not impressed with the build of Microsoft's controller and considering the price, beefing up the analog stick shouldn't even be a thought. The piece that breaks, the analog stick, is exceptionally flimsy and there appears to be no change being made to fix this well known and well document issue caused by under-engineered parts. Shame on Microsoft.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Works as intended, should be recalled\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 12, 2019",
            "id": "amzn1.account.AHS3JZ3ES5GSLPSPRT4B6LDD3YNQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHS3JZ3ES5GSLPSPRT4B6LDD3YNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I ordered this controller and since opening the A button doesn't operate properly it sticks and only registers about half of the taps. I called to get a new one sent to me but instead spend an hour talking to some nitwit in customer service. She kept asking me to reset the controller. I explained to her that's not much of an option. She kept telling me to look for a pinhole reset button like on a CD rom drive. Regardless after an hour she said she would need to consult with the manufacturer and see if there was anything else to do besides just shipping a new one. Said she would call me back in one hour and it's been a few weeks. No call back.  I would like a controller that's not bunk.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Doesn't work.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 31, 2018",
            "id": "amzn1.account.AGNBUK2MPJO2H4ABKNKPXGFY654Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGNBUK2MPJO2H4ABKNKPXGFY654Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I’ve had the controller for a few day now when I first got it my headphones wouldn’t work figured that they were broken now a few days later after getting a new pair of headphones those didn’t work either then I thought to try them both in a old controller both sets of headphones work in that one but not this controller\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Head phone jack broken\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 1, 2017",
            "id": "amzn1.account.AF5BIFQFWXYCE2EJSAJN32SQXF7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF5BIFQFWXYCE2EJSAJN32SQXF7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Great product . This was an upgrade to my xbox 360 controller I used on my PC to play FIFA and F1 2017 and it totally met my expectations. The only down side but that I'm ok with was that I couldn't connect via Bluetooth because apparently I need to have Windows 10 anniversary edition to do that so in case you want to use this on other Windows 10 version you need a charging cable. But like I said it is still worth it. If you are planning on buy a ps4 controller for PC please don't do it, I'm not against Sony or anything but I did research ps4 controller first as I actually like ps4 controller but I found a lot forums with people having issues connecting the controller to a PC . Also this seller is really good, the controller came in two days so that's a plus.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great controller from a PC gamer\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 17, 2018",
            "id": "amzn1.account.AGAHHQAPAWUBDDDYRYBBBPM2YKUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGAHHQAPAWUBDDDYRYBBBPM2YKUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I purchased a black Xbox wireless controller approximately 1 year ago (mid 2017) and expected this to be the same but with a different shell/skin, but the feel is not quite the same. The heft of the controller's weight feels slightly more in the front/body of the controller and less in the wings which sit toward the palms of the hands. It gives the illusion of the controller being lighter, but also wasn't a super pleasant change and made the controller feel cheaper and lower-quality. It should be noted that I doubt I'd have noticed if I weren't holding two controllers side-by-side, and the purchase price at the time I bought this was less than I anticipated paying so overall I'm happy with the purchase.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Less balanced than I'd like, but worth the price.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 29, 2018",
            "id": "amzn1.account.AGRITKP2WCV2YDOMJZ5ANPUKBL7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGRITKP2WCV2YDOMJZ5ANPUKBL7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Got them for Xmas gifts, none of them work correctly, they don’t stay sunk with the Xbox and they turn off repeatedly while in use. The packaging was tossed Xmas day so I can’t even send them back, I just have to be out a rediculous amount of money for 3 controllers that don’t work.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Do not buy these controllers 3/3 don’t work correctly\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 20, 2019",
            "id": "amzn1.account.AHOCSTOOF5WIQE3GQIRI6GQ6HQHA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHOCSTOOF5WIQE3GQIRI6GQ6HQHA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have bought Xboxes for years. Original Xbox day it was available. 360 and Xbox one I bought within 6 months of releaseI replaced one controller for the original Xbox over the whole time of owning it (it still works)Xbox 360 I never replaced a controller but many consolesAs far as Xbox one, I've bought 12 controllers and in need of another. These are garbage. They last about 4-5 months and you deal with them progressively getting worse. I'm gentile on my electronics so I don't think the same system that killed one controller over two console lifespans suddenly is torture to Xbox one controllers.Joystick drift is the biggest issue, along with buttons that suddenly won't respond. Pretty turned away and ready for a new generation of consoles so I can stop buying two controllers a year\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Garbage\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 10, 2019",
            "id": "amzn1.account.AELMG7PGF3CCTN5PL5ZHT7M72L7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AELMG7PGF3CCTN5PL5ZHT7M72L7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Hi everyone,I have been a PlayStation fan boy my entire life, but a lot of my friends swapped to Xbox and I decided to purchase an Xbox one. The first game I played was The Witcher, so I clocked a little over 40 hours.Next, I started playing Apex legends and clocked between 15-20 hours. After that I played around 10 hours of COD before my controller decided to break (right analog stick went haywire). Here is my review of the product:Handling:I really enjoy the Xbox controller. It is sleek and has a nice feel to it (But I still enjoy the PS controller over the Xbox controller). The button layout is top notch, but the issue lies within the left and right stick (for me anyways). After playing Apex legends, I started noticing my character would slowly look down and to the right. At first it wasn’t noticeable, but then it became apparent what was going on.Durability:I’m not rough on my controllers. If I drop it, it usually lands on my bed or my lap. But I have noticed after three controllers within a two year span, the right stick seems to break a lot.Price:I’m not the biggest fan of dropping $60.00 on a controller that tears up within a few months of gameplay. Whereas my PS4 controller has lasted a few years. And I contemplated purchasing the Xbox Elite controller, but both of my friends Elite controllers broke within a year.Overall, this is not a product I can recommend to anyone. I’ve heard the old Xbox 360 controllers were amazing, but I feel like Microsoft cheapened out on this product. I am giving this a two star review, because it showed me how amazing my PlayStation really is.Sincerely,A PlayStation Fan Boy\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Right Analog Stick Issues\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 27, 2018",
            "id": "amzn1.account.AH67UVB7LNYYSDQ4NVHVAO7LBGOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH67UVB7LNYYSDQ4NVHVAO7LBGOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The controller I received looked fine. Nothing seemed wrong at all and it looked almost brand new. The problem is when I tried the controller it didn't work. It was a pain to sync it because it just kept turning off. When I finally had it synced it would turn off after 1-2 seconds of use and I had to manually turn it back on every time but it would just keep shutting off. Terrible experience.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The controller I received looked fine. Nothing seemed wrong at all and it looked ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 7, 2019",
            "id": "amzn1.account.AGDCFOLID23BOU33IELQWY26XI7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDCFOLID23BOU33IELQWY26XI7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I didn't initially enjoy the Xbox One controller I bought, I shared a similar sentiment to many that the materials felt somewhat cheap and the ergonomics did not match how I felt about the former Xbox 360 controllers I've used in the past.My biggest initial problem with the controller is the feeling that the control sticks were too tall, narrow, and course to the touch, creating this somewhat uncomfortable play experience during probably my first 5-10hrs of using them.They got a LOT more comfortable to use after a little time of getting used to them, and before I knew it - it's become one of my favorite controllers I've had once I got a bit more accustomed to that nature of it's build/design.Overall Feel = 5/10Didn't quite live up to current expectations with $50+ controllers, materials feel plastic-y and feels rough to use at firstButtons/Feedback = 9/10Thankfully, the button feedback and overall control this gives when playing feels fantastic. Some would argue that the R/L triggers on the bottom take a lot of push to register input, but I personally thought it felt fine. Not as fast as some other controllers, like the Switch Pro or something similar, but responsive.Additional Features? 7/10There aren't a lot of bells and whistles here, what you're seeing is what you get. Once I got it setup on my PC the connection times were fast and simple. Hands down the best PC controller experience I've had once I got around a small Windows 10 hiccup. One feature I do really enjoy is the aux output in the bottom of the controller, I have not personally used it yet but being able to plug-in headphones into a controller is very convenient. And, while this may be a controversial choice to some, the controller's AA battery power is something I really like. I don't have to worry about charging the controller every day or two like I would if I was using my Switch controllers, very nice!All in all, I'm happy with this controller. I will be buying a couple \"mods\" for it improving on the triggers and thumb-sticks, but otherwise I would recognize the controller for use with PC gaming.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    First impressions were mixed, it got better.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 23, 2019",
            "id": "amzn1.account.AHM2Q3VZR67XLP3XVY4OSAG46OKA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHM2Q3VZR67XLP3XVY4OSAG46OKA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Was looking for a controller to use with Steam after a disappointing stint with the Steam Controller. Xbox controller are the best supported controllers on Windows, Mac, AND Linux, and this did not disappoint. Worked immediately out of the box with my OS (Ubuntu 18.04) and Steam. Battery life is pretty great, I've only had to swap batteries out once since I bought it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Bought it to use with Steam on my Linux laptop, works perfectly!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 15, 2019",
            "id": "amzn1.account.AHMCTM64XWFNNCTHB4HJA22IKDDA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHMCTM64XWFNNCTHB4HJA22IKDDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have confirmed that this works well with Windows 10 using Bluetooth. The older version used a USB dongle for wireless communication. The Bluetooth version is nice because it makes your USB ports available for other things.To set this up you have to 1) push the big X button on the top side to power up the controller and then 2) push the (hard to see) black button on the front edge of the controller to make it \"Bluetooth discoverable\". You can then add the controller from the Windows 10 Bluetooth setup. No special software or drivers is required.My only complaint is that I feel that the older version of this controller had more resistance in the knobs. More tension/resistance makes it easier for aiming a sniper rifle (for example). But, I am sure my hands will adjust as I use it more.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Confirmed that it works with Windows 10 laptop using Bluetooth\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 20, 2016",
            "id": "amzn1.account.AF7TMTEI26BEBATXMQG4LYSZXBTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF7TMTEI26BEBATXMQG4LYSZXBTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I got this on Black Friday for a huge discount. So I might be slightly biased on my review. However, I must say that I like this newer version a bit better then my older black controller. I like the new texture on this controller. It's very subtle and I got used to it immediately and I can keep the controller in my hand a bit easier. Plus it's white, it just looks sleeker. I don't have the new xbox one and I didn't test the new increased range on the wireless, so I can't give an honest opinion on that.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love it!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 6, 2019",
            "id": "amzn1.account.AF4RYFSMRSDQEW7M4PU52HT4HIZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF4RYFSMRSDQEW7M4PU52HT4HIZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This product came fast and looked identical to the one I got with my game. It was in a very professional styled box with instrucation and also a game access code for a trial however the only reason this got four stars is that the headset in it stopped working suddenly outhe of the blue. I have made sure to take extra precautions to not drop this control nor get any moisture in it by making sure my nephew had no access to it and it kept out of his reach so now I can't use a headset with it because all I hear is static...…….. So, update; the control is working fine I watched a youtube video and saw that there was a settings I needed to adjust on my xbox\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fast shipping great packaging\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 21, 2018",
            "id": "amzn1.account.AGLJBRIDJG3WADZE33CXS55P6B5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGLJBRIDJG3WADZE33CXS55P6B5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought this headset for my son's Xbox gaming. He was thrilled with it and said everything sounds awesome and really enjoyed being able to talk with his cousins across the country while running through the Fortnite world. About five months into only weekend usage, the microphone has stopped working. The sound still functions great but he can't use it for it's intended purpose. I've tried using the adapters on different media and it just won't work. I know it's not an expensive item, but it was probably used less than 20 weekends and only a couple hours at a time.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great for a few months\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 12, 2018",
            "id": "amzn1.account.AFPYU747J4IU4OK3FSLHVFU6BCUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFPYU747J4IU4OK3FSLHVFU6BCUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Rating a 2 b/c as good as this controller feels, it costs $50+ and broke the same way as my previous one. In addition, microsoft apparently requires that i own an xbox in order to register my controller which makes the warranty for repair process unnecessarily complicated.I love the feel of these controllers, however, within a month of use the left joystick broke. I would say it was bad luck but this is the second controller this has happened to. The design is great but the build quality seems to be lacking.I only use it for Rocket League on my PC and there are certain moments when my grip intensifies slightly. This happened while i had the joystick angled inward at about 4 o’clock and i felt/heard a piece of plastic snap.When i say grip, i don’t mean a full-force gorilla-strength squeeze. I’ve been playing games all my life and never had this happen. Whatever the material is that houses the joystick and the clicking isn’t very stirdy.The first controller this happened on was one of the elite models and is still playable, but the y axis has slowly becoming more over sensitive and i find myself doing involuntary backflips and summersaults.This model has loose pieces that occasionally get lodged in the triggers and the joystick is unable to click when angled between 1 and 6 o’clock, so i wouldn’t consider it usable now.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Joysticks can’t handle much pressure when angled\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 14, 2019",
            "id": "amzn1.account.AFT7JPQIP44X72TSSQVZBIVJC3PA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFT7JPQIP44X72TSSQVZBIVJC3PA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Flimsy but no competition in the market means nowhere else to go. I have been a gamer since Commodore 64 and have owned every Xbox console to date and the Xbox one line of controllers just don't last like the older 360 ones did. The plastic seems more brittle and the joysticks rather easily buckle. I have broken three Xbox one controllers to date and hate to have to buy yet another one but the only competition (non MS product) are wired controllers and given that I have kids and such that's not a viable option. So I'm going to have to shell out yet another 50 bucks to replace a product that keeps failing. Sounds to me like they designed them weaker so people would have to replace them. So far I'm averaging about 6-8 months on a controller before something intregal fails and I have to chuck it. And yes we did try to fix the first one that went bad and even bought a rebuild kit but it went from bad to worse and the design appears to make it so it will purposefully break if you try to get into it. Too bad I can't just use my old 360 controllers I still have them and they work fine...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Does not last plan on replacing if you use a lot\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 3, 2020",
            "id": "amzn1.account.AGCVOADVD7YGESI5WXYPN47QYKFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGCVOADVD7YGESI5WXYPN47QYKFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    A button janky out of the box. Pressing straight down rarely activates the switch, so it has to be hit on the button left comer only.  I've had to relearn how to use a controller to compensate and still sticks about 20% of the time. B button occasionally sticks as well.I just didn't even bother returning it. i've had nothing but issues with xbox one controllers. i have the cheapest 360 controller money can buy and it last 3 years and over 600 hours of gameplay and technically still functions. the grips just fell off the sticks...... but i've had 2 xbox one controllers break with the factory included batteries in them.This is the first one where the bumpers lasted 100+ hours so that's a miracle.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This is my 6th xbox one official controller\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 6, 2019",
            "id": "amzn1.account.AHIWDMUFIWRUKXJ36FAY7RHKPNMA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHIWDMUFIWRUKXJ36FAY7RHKPNMA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Just received this Xbox One controller Monday 11/4 by 5pm to replace my other controller that stopped working when it got knocked over onto the tile floor. It is very easy to sync with the console, I went by the sync instructions and done.Turn on your console and hold the black button for 10 seconds and immediately turn on your controller and hold the black button for 3 seconds, they should find each other to connect. The black button on the controller is to the right of the black bumper, on the console the black button is located on the black strip under the on button. $42 is a bit steep for a simple controller, but it is worth it. I accumulate on my credit card and use that to pay.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Works Perfectly\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 1, 2018",
            "id": "amzn1.account.AHSYDSGC227XUPW45QUIG6YI5HKQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHSYDSGC227XUPW45QUIG6YI5HKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The trigger buttons are a real problem. I don't see how anyone could use both the bumpers and triggers on this with normal hands. It does not feel right. Not happy with this.Otherwise, the build quality feels very good. The joysticks are the best I've felt. It does chip easily though. The controller took a light 3-foot drop onto the carpet, which made a dent in it, which I'm sure all my other controllers would have survived. Maybe it's because it's 2-3 times heavier than other controllers.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not happy with this\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 22, 2019",
            "id": "amzn1.account.AEKYQMCG3MZKPF3BZCQXLJZAS6OQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEKYQMCG3MZKPF3BZCQXLJZAS6OQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    At first, the controller worked great. After a few weeks of using, the headset jack no longer works. It's not the Turtle Beach headset giving the problem. I connected the headset to an older controller and they work just fine. The connector is real loose when connected to the jack. Other than that, everything else was working great. I am very disappointed with the controller.I'm updating my review because I contacted amazon and they sent me a new replacement controller without any problems. So far, it's working perfect. I've been using it for a couple of weeks now and no problems as of yet. If it gives my any problems like the first one, I will then update the review once again.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Headset jack no longer works. Replaced!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 11, 2019",
            "id": "amzn1.account.AFHTHIFBFYZNYXECYIR4BKB3U6OQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFHTHIFBFYZNYXECYIR4BKB3U6OQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have now replaced my second controller. These things just don't work. whether it is at the fault of whoever Im buying it from, or if it is just the wonderful crap quality of microsoft, but here I am, ordering my now third controller.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Ridiculous\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 21, 2019",
            "id": "amzn1.account.AFCLBBERXS7M5M7RR66QSZEOAGLQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCLBBERXS7M5M7RR66QSZEOAGLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Xbox one controllers have issues with headsets. We thought it was a bad headset, and bought a new headset and it would not still work. Then we purchased a two new controllers and the same headset worked on them. So we figured it was the old controller that was faulty. After a few months same issue, the two new controllers no longer worked with the headset. Updated controllers software when they were available and still headset would not work. Went through most YouTube videos on how to troubleshoot headsets and Microsoft forums and still it won’t work. So we repeated the same process of purchasing a new headset and it still would not work. This morning I noticed a new controller update, updated all three controllers. Now both headsets work on all three controllers. Moral of the story, you will tear your hair out because of Microsoft software issues and spend extra money on controllers and headsets you don’t need. My last Xbox console\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Software Not reliable\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 24, 2019",
            "id": "amzn1.account.AF4P5KQGM275WN2YW7OKPF5IEENQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF4P5KQGM275WN2YW7OKPF5IEENQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I haven't even had this controller for 2 months, and it is already broken. The headphone jack stopped working out of nowhere. What a WASTE of money. I should have heeded the warnings from other purchasers. Don't make the same mistake I did. Choose something else. Also, there is barely a month to be able to return this defective controller so I won't be able to refund of any kind. All around disappointed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY THIS PRODUCT!!!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 12, 2018",
            "id": "amzn1.account.AFXOSM3I5UFPQUQ4CB2T3ZNRXFYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFXOSM3I5UFPQUQ4CB2T3ZNRXFYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Very comfortable to use, and the bluetooth connectivity to my Windows 10 PC is consistent. Very nice to have for OTS action games.Microsoft has iterated on this design very effectively over the years. This controller is light but feels solid in-hand. The joysticks and buttons are all very smooth to operate, and the plastic on the back is subtly and pleasantly textured for grip. The ergonomic form of the controller is top-notch, and I see no reason to opt for the much more expensive \"elite\" controller.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Iterating on a classic\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 30, 2018",
            "id": "amzn1.account.AHJJB3TZTL6BB7MO2B24EB6BXOVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHJJB3TZTL6BB7MO2B24EB6BXOVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This baby is awesome. Wireless connect was no problem, all buttons respond exactly on Que D-pad and left/right joystic response is as original.I like that it has the original xbox oneside ear headset w/mic in the back of the controller.The 3.5 jack is exact size, and allows for micro usb charge in front.Warning: the controller has built in no cheating sensor.  holding in it in one direction too long reads as no movement and will turn off.6/9/2019: 6 months and the controller is still working good.  However the 3.5 jack is broken and I did n't buy protection plan for it, so, I will be spending 5 minutes to change it out and hopefully the jack is the problem.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    works flawlessly with xbox one using 3.5 jack\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 30, 2017",
            "id": "amzn1.account.AHCE7LGWZR47MDKUSNJZ6Z6SGT3Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHCE7LGWZR47MDKUSNJZ6Z6SGT3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This is the exact one that comes with the Xbox One Minecraft Version Console. Its great to have a second one exactly like my original. The buttons are made to withstand 3 million presses.  I've only had them for 4 months. They're nowhere close to being worn out. On the 360, controllers would last me between 1 and 2 years. We'll see how far these go.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Its great to have a second one exactly like my original\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 2, 2018",
            "id": "amzn1.account.AETZU6HYFQ3HKBRPTCETAQ5OBV3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AETZU6HYFQ3HKBRPTCETAQ5OBV3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I love the design of the Xbox controller, I also love that they made the light in the middle of the controller less bright as it is annoying in other controllers. however, I bought this controller based on it's ability to Bluetooth connect to a PC or steam link. While I can get a Dual-shock 4 to connect flawlessly, I had 3-5 connection issues each hour with the Xbox one Controller.I would recommend this product if you have an Xbox, but for PC fans I recommend a wired controller or a dualshock 4.Design 5/5Interface 4/5Bluetooth Functions 2/5\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Bluetooth isn't up to par.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 4, 2019",
            "id": "amzn1.account.AFP5QEPUIDEDK2XTP5GX64L6VHPA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFP5QEPUIDEDK2XTP5GX64L6VHPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If you're looking to buy an Xbox controller, This is it. It's hard to rate such a specific product poorly. If you want a good PC gaming controller, This is one of the best - That's why I bought it. My only minor complaint is that I swear these used to come with a USB wireless/bluetooth adapter - I expected to get one. I had to purchase one separately for my laptop, Which was annoying since this was advertised as being a PC controller when I searched for it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It's an Xbox controller alright.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 7, 2019",
            "id": "amzn1.account.AGIWPEZPKPSWXYIV22ZUWU6LUTTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGIWPEZPKPSWXYIV22ZUWU6LUTTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Purchased this in December of '18 and it's been a great controller. I recently began to play some PC games that play better with a controller than a keyboard. This replace my Logitech controller that I've used for a few years since the analog sticks on that aren't as 'precise' as this one.Overall I've enjoyed the controller, however recently I've run into a few issues..1. My initial usage of this controller was through the wired connection and occasionally would disconnect for no apparent reason (at the time.)2. Following the issue, I decided to add the Xbox to PC controller adapter and it's worked well on my main PC as well as been convenient.3. After roughly two months of wireless use I've switched to a cable again (See why at the bottom), and now the female port on the controller is unusable. I plug in the cable and it connects, so I move slightly to get comfortable and the connects and disconnects at a wild rate so long as I move. I have ~several~ of these cables strewn about the home and they all produce the same result. And it's virtually impossible to play a game without moving the controller slightly.I can continue using it via wireless, but only on a computer that has the capabilities to do so. Right now I'm unable to use the wireless adapter on my laptop because the drivers are supposed to be included with Windows 10 but for some odd reason my laptop refuses to update beyond a certain version of 10 therefore disallowing the use of the adapter.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A great upgrade, but expect possible complications\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 20, 2019",
            "id": "amzn1.account.AFSWDBEG2FVLQLM3PEQET6ZQ36EA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFSWDBEG2FVLQLM3PEQET6ZQ36EA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    For couple months this controller worked fine.  Then the headset plug no longer would connect to headset.  Almost $50 spent to use this item for couple months.  Getting in touch with Microsoft is not user friendly.  The phone number given is a voice message that disconnects after telling you to go online.  When going online, it is difficult to navigate.  Not happy with this product.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Don't buy if you want it to last more than 2 months. Save your money or buy a warranty.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 7, 2018",
            "id": "amzn1.account.AGX5BNFK6N3WE6YAOQ7YLGVQREIQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGX5BNFK6N3WE6YAOQ7YLGVQREIQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I love these controllers, but they are always defective in some way. I've ordered at least 5 of them, and each one had their own  unique combination of defects.Test everything about the controller. These are defects I've faced:- Bumpers make a loud, stiff, mechanical click instead of the normal smooth and soft click.- Triggers make a clicking noise when pushed down instead of the normal smooth feeling and no sound.- Analog sticks require excessive force to push down on them.- Back lining that hold the controller together is misaligned and sticking out instead of lining up normally.- The buttons stick down when you press down on them in certain directions (oh man I hate this one).- The D-Pad make a mechanical noise like something is loose inside when you press down on it in certain directions.- The battery cover is loose and pushing down on it makes an annoying noise.- The battery cover won't come off without excessive force.Yes, I've experienced all of these with the 5 or so controllers I've bought. Not fun.I luckily managed to get a white one that only has the bumper and loose battery cover issues. It works well despite its flaws. I would say that those two issues are the most minor of them all.I haven't been able to get a non-defective black one, which I really wanted. I even tried directly online from the Microsoft Store, but that was more broken than the ones I got from here. If you can, go to a Microsoft store in person and try it out right after buying it so you know.if you can get one that's not defective, they're amazing! Works natively on Windows without trouble. Although it is a little inconvenient that you need a cord (not included) to update the firmware. Takes a little time to get use to, but they feel so great in your hands. I've dropped it twice without damage. Keep trying until you get one that's minimally defective!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Getting one non-defective is impossible\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 26, 2019",
            "id": "amzn1.account.AHO2G5XOWIPIKB4HVPA7355MDYVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHO2G5XOWIPIKB4HVPA7355MDYVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Purchased here, through Microsoft. This is the SECOND controller I've ordered from them. Both had same problem, left analog stick won't work. Only now this new WIRELESS  controller will also not connect to the console unless with a USB. The seller, MICROSOFT, assured me this one was tested and works. They obviously lied. And their customer service runs you in circles. So I guess they win. They are horrible, and  I will never purchase from them again. Unprofessional. Beware.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    You will lose your money with Microsoft seller!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 6, 2019",
            "id": "amzn1.account.AGKJCAW5V4TYO6DWEEJV6S7WRNOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGKJCAW5V4TYO6DWEEJV6S7WRNOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Like many long time xbox users, the controllers have progressively become cheaper and less reliable. Had old black controllers that came with the purchase of the xbox that only recently stopped functioning. This controller worked for about 10 days of light usage, maybe 30-45 min about 5 times a week. The right stick started to stick and then kind of float up during a game. So long first person shooters. Couldn't use. Thought about fixing but then realized it voids the warranty. But then again is there a warranty? Seems Microsoft doesn't care to support their crappy controllers.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Cheap Components lead to Product Not Working\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 17, 2019",
            "id": "amzn1.account.AHTEICJQIIRDJC2E3IY7J6CHGC3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHTEICJQIIRDJC2E3IY7J6CHGC3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I got a Xbox One controller for my PC to replace my Xbox 360 controller which was used to play Apex Legends.And I got to call the Xbox One controller a Hit & Miss as the buttons are much better and the D-pad GREATLY better then ever before... but they cheapen out on the controller's plastic casing to have a snap on style and a part of the plastic is messed up. The middle finger part is hanging up and it's rubs my finger raw when gaming... Now this could be a manufacture error, but it's still a very poor design compare to the 360 controller case design.Lastly I still don't like that it still takes AA batteries and don't come with a cord and must be bought separately.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Hit & Miss\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 3, 2019",
            "id": "amzn1.account.AGRR2NDBTJ5PXBUHSIL7TYNYHBUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGRR2NDBTJ5PXBUHSIL7TYNYHBUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought the controller several months ago and overall it was good. The aesthetics convinced me but after only 3 months, the controller started having issues. Now, in the middle a game my character will look around as if I’m holding down the right thumb stick, my character moves backwards when I try to go forwards, Vice versa, when I press the triggers or bumpers, they don’t work in the game as they’re supposed to and I get killed, and even though the home button isn’t being pressed, as soon as my Xbox turns off, it turns back on again unless I take out the battery pack. The standard controller I got with the Xbox lasted at least a year without any issues but this one didn’t even last 3 months! Even more frustrating is that I don’t play as much nowadays as I did a few years ago during my CoD, Skyrim, and GTA days, that standard controller suffered serious use and thrown at walls and floors but still persisted, unlike this one!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 6, 2020",
            "id": "amzn1.account.AHOF5KVYSGSYDNLZX5WVYFZ7CGZQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHOF5KVYSGSYDNLZX5WVYFZ7CGZQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Not sure if I just got a dud or what, but this worked fine for the first few hours and then just stopped connecting. I tried changing the batteries, but no luck. Really a shame because with this new controller, I didn't have to use the microsoft usb adapter to connect the controller to my PC. Ended up returning it because it was unusable.Side note, it did come with a free 15 day XBOX live card, but the expiration date was several months ago so not even that worked.. really disappointed with this purchase. Thank god for amazon's return policy.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Worked for a few hours and now disconnects randomly\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 17, 2019",
            "id": "amzn1.account.AEGZ6D2UYERJ64PEU3LAUJHFBLRA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGZ6D2UYERJ64PEU3LAUJHFBLRA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Took a bit of fiddling to get it bonding properly with my PC but since then it works perfectly, as you would expect. I tested it with Halo: Reach, which wouldn't work with my old gamepad, and it's fine for vehicles but for shootouts aiming is much easier using the mouse. The headphone socket is interesting but after brief attempts at testing it seems it may only work with an actual Xbox.PS: A few days after starting to use it I noticed the right thumb stick was grinding when pushed upwards. I applied a small amount of spray lube, which reduced the noise but it is still noticeable in the feel. I checked and the lube is still there so the problem must be a mechanical one, most likely a manufacturing fault in molding or precision of component positioning. This would indicate issues with the frequency of checks on the production line and quality control, most likely due to inadequately monitored outsourcing, a common problem with major brands these days.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Just add Xbox Game Pass for PC and you got an Xbox without the Xbox\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 2, 2020",
            "id": "amzn1.account.AESYS7BAVXMGQXM2Y5VG4ZOX57FQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AESYS7BAVXMGQXM2Y5VG4ZOX57FQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Not that we have much of a choice, but these xbox one controllers are garbage. The fact that they haven't resolved this issue ever since the xbox one came out tells me one thing: they are designed to fail regularly so that we can keep purchasing them every six months or so, if lucky. The other controller that came with my xbox one is also malfunctioning right at 6 months. Thanks, Microsoft. I'm thinking Playstation for my next console upgrade. I can't afford $50 a month for a new controller (or two).\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Xbox one controllers from microsoft are garbage.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 12, 2019",
            "id": "amzn1.account.AEB3CRUL3NTUZUPQMOYXM2YVPLNA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEB3CRUL3NTUZUPQMOYXM2YVPLNA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The controller itself is pretty good, but if you buy it used just check if your getting the internal battery pack with it.amazon basics has a pack for a bit cheaper then the official one, but it actually puts it a few dollars above just buying a new controller outright.Still works with AA batterys or a phone charging cable anyhow, but not the point.This controller seems more responsive then the older one, and I like the textured grip on the joysticks/hand holds.It also is a bit quieter on button press, and seems to be a bit more ergonomically designed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Used does not come with batterys\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 25, 2020",
            "id": "amzn1.account.AESFA4U2XVWYE5QN5YT6PMPX4B2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AESFA4U2XVWYE5QN5YT6PMPX4B2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    When I first started to use this controller I noticed some differences from the controller that came with my xbox one system.- The casing where the two halfs come together has an edge that digs into your hands over time.- The shoulder buttons have a different click then the original.  This did not seem to effect performance.My big complaint is the hard edge that runs around the controller handle and that is why I rarely use this controller.  I waited to long to return it so I am stuck with it.  Oh, well....\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fit and Finish is not vary good\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 2, 2019",
            "id": "amzn1.account.AGUNBLNZTQWNUHADS2N37PTLCKTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGUNBLNZTQWNUHADS2N37PTLCKTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought this to use with my Gear VR because some games only allow this controller for some reason. I had been using a Steelseries controller and held onto it which comes in handy as every once in awhile the XBox controller will not turn on. This is the second time in the year I've owned it that it refuses to turn on. It's been 2 weeks and nothing is happening. I use Panasonic rechargeable batteries and they are fine. I've checked for updates and that's not the problem. I'm so happy I saved my \"backup controller\"  but hate wasting money on things that don't last. I posted on their website about the problem to no avail. This is upsetting.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Quit working within the first year\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 8, 2020",
            "id": "amzn1.account.AECIPZPGYQDJANMP53DV45KZBEHQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AECIPZPGYQDJANMP53DV45KZBEHQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I definitely do not recommend purchasing this as a Windows/PC Controller.I purchased Aug 2017. Within 6 weeks of owning, I encountered the \"stick drift\" issue (analog stick doesn't snap back fully center, stays slightly pushed in whatever direction it was). The warranty is 90 days. Luckily I'm covered under warranty so it should be a pretty simple replacement process right? Nope.No way to claim the warranty on the controller without first registering your Xbox One Console. Well if you're like me and bought it for the PC and don't own an Xbox what are you supposed do? After about 2 hours of chatting with support they finally figure out how to honor the warranty without me owning an xbox. Here's the kicker, I have to mail it back to them, pay for the shipping to send them back their defective product, and wait 2-4 weeks on a replacement.Not worth the trouble or effort.I'm going to purchase a new controller from a retail store, with a protection plan and recommend anyone else wanting to purchase this controller to do the same.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I'd recommend NOT buying. Broke within 90 Day Warranty Period. Warranty replacement\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 15, 2019",
            "id": "amzn1.account.AEROEK7NLNN26GDCWZ6JLY4P4QXQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEROEK7NLNN26GDCWZ6JLY4P4QXQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought this controller on May 29th, 2019. It's September 15th, same year, and the left analog stick is drifting to the right now.I bought this controller because my old Xbox One controller, which I've had pretty much since the original Xbox One console came out, was doing the exact same thing. It was my hope that I'd buy a controller that would not only replace the one I had for the Xbox One, but allow me to play games on my PC as well with its bluetooth feature (which is a nightmare to setup for some reason and takes incredibly specific steps to get right, apparently. Not just turn on a sync like you'd imagine.). This new controller lasted about 100 days, then sadly broke. I'm sure the warranty is up by now, and even if I was still able to send it back to Microsoft somehow, I'd be without a controller for who knows how long.Obviously, I'm extremely annoyed by this and will probably have to look elsewhere for a controller seeing how I won't be buying this one again. My wallet can't afford to lose 50 dollars every 3 months on a controller that should last me YEARS like the old ones did. They are making these much cheaper than they used to which really was evident by the weight and feel of the thing when I first got it in May.I should also note that I used my controller in a normal fashion and without applying harsh pressure to any buttons or controls in fear that it would break before I got a few years out of it...but then it broke anyway.Please, I know you're thinking how I did when I researched controllers for hours that week, \"This guy's review might be a rare case and my controller might not do that if I buy it,\" but trust me, based on the cheap plastic and bad engineering, it eventually will. And probably SOONER than you'd hope.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Left Analog Drifting After 3 Months\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 18, 2018",
            "id": "amzn1.account.AGJGT4BJ7I7CKXGGIBXTIQKHV76Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGJGT4BJ7I7CKXGGIBXTIQKHV76Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought my son an Xbox one s.  They only come with one controller per console.  In order to play multiplayer games with him I decided to get a second remote, and this was it.  I can't really tell which remote came with the console now and which I bought for a second remote to play games with him with.  That's great, right?!  If I need to purchase additional remotes in the future I will purchase this one again :).\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Exactly what it is supposed to be; a second remote for Xbox\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 29, 2017",
            "id": "amzn1.account.AELG3NQIAXTGAAVI3L7BSKHZSQYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AELG3NQIAXTGAAVI3L7BSKHZSQYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    great controller. a tiny bit smaller than the original xbone controller, so it fits my controller case better. The -1 star is because getting this to actually connect to Bluetooth on my windows 10 machine was an over and hour long nightmare. But now it's working fine just as you would expect any other bluetooth controller to.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    great controller. a tiny bit smaller than the original ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 17, 2019",
            "id": "amzn1.account.AE3PTASARXFHQ4R5B7HEN5AQY2ZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE3PTASARXFHQ4R5B7HEN5AQY2ZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Didn't work right out the box.Battery terminals were bent out of place and had to bend um back in place to get it working.Spent a good hour trouble shooting and was ready to return it and consider my buy a bad egg assuming something was wrong with the motherboard or something.But with patience and dedication I got it working.Just wish It didn't happen in the first place but it is what it is.As for the controller itself it's a xbox one controller you already know how it is.Works great but in my honest opinion the xbox360 controllers were built way better in comparison. And feel alot sturdier.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I'ts what you expect.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 20, 2019",
            "id": "amzn1.account.AFT6GVDVG6MDQUQW3Y4DWNR4TBMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFT6GVDVG6MDQUQW3Y4DWNR4TBMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought this controller that I could use with my PC. Over the coarse of the past several months my controller has begun to suffer more and more from Bluetooth disconnects. I will be using the controller and it works fine, then the controller will loose connection for around 7 seconds and reconnect to the bluetooth. When this happens, this causes a huge lag spike in the game I am playing. The frame rate will drop to the point of almost freezing and I will loose control of the game I am playing. This is a huge problem if I am playing a multiplayer game or a driving game.  Initially, thought it was due to the batteries dying, because when I replaced them, the issue went away for a while. However, I noticed that the issue would come back after only a short time with new batteries. I could just leave it plugged-in with a micro usb cord, but it is incredibly easy to accidentally unplug. Some other times I have to completely start over and re pair the controller to the Bluetooth as if it were a new because the controller sometimes can't reconnect otherwise. Overall I am disappointed with my controller and would not be surprised if I received a defective product. I find it frustrating that I am having all of these issues with Microsoft controller on Microsoft's Windows, but when I use a PS4 controller I have no issues.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Controller suffers from frequent disconnects via bluetooth on PC\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 16, 2019",
            "id": "amzn1.account.AH425XYLBV3Z72EHB33V626EH7ZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH425XYLBV3Z72EHB33V626EH7ZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I've never had an Xbox controller fail right out of the box, so this is a first.  The movement joystick gets stuck in one direction or another and does not immediately stop the movement even when the joystick is released or is pushed in the opposite direction.  It's either a problem with the assembly or quality of the parts used in the controller and is unacceptable.  My sons and I attempted to use the controller and each of us gave up after a short time.  Really poor quality.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Returning\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 1, 2018",
            "id": "amzn1.account.AFSKVA7F3LUSBIZ6ARXRKKDLCIPA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFSKVA7F3LUSBIZ6ARXRKKDLCIPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought this controller about 9 months ago with the suggested doc charger. I was very happy when I first recieved the product. It was weighted correctly and had textured grips and a 3mm jack of course. After about a week the right stick was sticking. After contacting amazon I could return but I decided to look closely and it was just a small nub on the plastic that was catching. I used a small nail file to file it down. Then months later it would disconnect mid game and a month later wouldn't connect at all. Now its past my return date and I have a useless controller. Would I buy again? No. The fifty dollars was not worth the 9months when i can buy one from microsoft for just about the same price. I am disappointed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Stopped working/sticky joystick\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 24, 2017",
            "id": "amzn1.account.AEZI73BYKI33PP6XGEFZAVREI5MQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZI73BYKI33PP6XGEFZAVREI5MQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I don’t usually write reviews, but here is why I am this time, controller arrived very prompt in original box, controller is sleek looking and feels very good in your hands, my only complaint, at least twice a day while I am playing it disconnects and makes me reconnect the controller, also will say batteries are about to die, then I disconnect and reconnect and shows full life? I have never had these issues with my other controllers, maybe a software issue or a controller defect not sure.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good and bad.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 3, 2018",
            "id": "amzn1.account.AGHDH57ORPBUKN3SLTYQLJNYILGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGHDH57ORPBUKN3SLTYQLJNYILGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Comfortable to hold, nice feeling plastic. Buttons are surprisingly clicky, especially the shoulder buttons. I'd say unnecessarily and annoyingly loud, but I know that's a matter of preference for some.Bluetooth connection cuts out surprisingly often when used with my laptop only a foot or so away, but is still consistent enough to be my main controller. I've got some superstitions about how and where to hold it to make this happen less often, but who knows. Other bluetooth devices don't seem to have this issue.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good feel, disappointing bluetooth performance\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 20, 2017",
            "id": "amzn1.account.AEE3I7O4H6Q6XFIUCLL65T5IPTWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEE3I7O4H6Q6XFIUCLL65T5IPTWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The controller was/is broken upon arrival.  It works but there is a plastic chunk missing so my son doesn't use it, it was worth about $20, I paid $40 from tech62, not recommended seller.  If you can't take two seconds to inspect the controller then you are an idiot seller.  The controller itself works okay.  Xbox One is an inconsistent machine and has some stupid procedures - needing to upload games to hard drive but still need disc to play for example or everybody needs microsoft acct but I digress - this controller is very mediocre at best.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    More mediocracy from microsoft\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 31, 2019",
            "id": "amzn1.account.AH66T4LHZ5O4OG7DXN4UULARJS6Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH66T4LHZ5O4OG7DXN4UULARJS6Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    yes i said third time buying.. u may ask why a 2 star if u have liked them  enough to get them 3 times// well its real simple  they break down very fast.. i have had to buy multiple controllers  for the x box one  system since its launch. and only reason i still buy them is the consols are still working .. i dont know if all havecome from this company or  a dif one but fullfilled by amazon  ..  triggers break, thumb sticks drift and buttons stick.. and if u like chatting  well expect the  mike ports to stop working  ..\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    third time  buying\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 9, 2020",
            "id": "amzn1.account.AG66LWPBI5Y75DN7DBYTKUJDUJCA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG66LWPBI5Y75DN7DBYTKUJDUJCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I would give five stars,  but one controller out of the two  I purchased has a faulty left bumper button that doesn't register every time it's pressed.  So only one controller is actually usable.I was able to pair these to my PC using bluetooth and the gaming experience is great (other than the one button that's broken).I'd say definitely buy these, but check that all buttons work and that they register all the times they're pressed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Hit or miss / but great controllers\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 10, 2020",
            "id": "amzn1.account.AFPUUIKQKYE6TSEEW3DZXJOGHABQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFPUUIKQKYE6TSEEW3DZXJOGHABQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Xbox controller has one of the best button layouts as well as shape among gaming controllers. Nothing seems as comfortable or as responsive as these controllers. The downside however, is that the quality of the build has not improved much and in fact I’m pretty sure they’ve gone down in quality.The plastic has a texture to promote a better grip which has minimal effect. There is no built in battery which you can take it or leave it depending on your preference. You can’t enable steam control for the home button. The vibration functions suck compared to DualShock 4 and even the switch joy cons. You absolutely need the PC dongle if you plan to use it on pc because Bluetooth has connectivity issues. And very fragile, if you are a rager just get a third party controllerThe pros do outweigh the cons... very very low latency. Comfort is at its best. Decent battery life if you shut off vibration which you get used too really quick. Best joysticks and buttons/triggers of any controller I’ve used. Actually works great for mobile games with controller support if your into that.All in all, it’s not perfect but it’s pretty darn close.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Greatness but at a cost\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 6, 2020",
            "id": "amzn1.account.AHV7O3465AE4ZVQYWRJLNGATUYLA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHV7O3465AE4ZVQYWRJLNGATUYLA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Just the way it goes sometimes.  Have it connected to a gaming PC via bluetooth and the A button clearly has issues.  Otherwise, it's a step up from my older version of this controller.  The grip is nice and the hip buttons feel better.  Bluetooth connect is instant and only disconnects from RDR2 once in a while for some reason...all other games have been fine.  This was for my wife who plays Borderlands alot....didn't even notice the issue lol.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A button takes two presses almost every time.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 24, 2018",
            "id": "amzn1.account.AFPZHF3C7RUUFKLR2ER2NRXKV6KQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFPZHF3C7RUUFKLR2ER2NRXKV6KQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Not even 7 months in and this controller had stick drift. I don't think it was new at all. Now they list as used, but I know it wasn't that way when I bought it, because i wouldn't have. Not sure it was the seller, because Microsoft is ultimately to blame for the terrible build quality of all xbox controllers (I don't know HOW many I've had go bad over the years).\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    ANOTHER xbox controller with stick drift...how many is that now? All.\n  \n"
        }
    ]
}