{
    "reviews": [
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 20, 2017",
            "id": "amzn1.account.AEIE2UJDKWR3NG3CE34PT7R3QSVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEIE2UJDKWR3NG3CE34PT7R3QSVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Size: I like that these shoes last for a long time because of the sizing. With the strap that goes around the back of the foot it fits a size smaller than the marked size (e.g., a size 9 toddler fits like an 8 toddler when using the strap around the back). Using with the strap behind the foot will make the shoe too tight if you actually need the length marked on the shoe. It is a very short strap. Once the strap makes the shoe too tight to wear, I flip the strap forward so it rests on top of the shoe and the shoe lasts though the marked size (so a marked 9 toddler will fit 8T with strap and 9T without the strap). The shoe is very wide and this fits chubby feet that don't fit into other summer shoes (sandals or flip flops).Style: I don't like the look of Crocs, I wouldn't buy any if my child's foot to wear regular summer shoes. These are a slightly more stylish verision of the regular crocs. The colors are great, true to the stock photo.Function:I love that these are easy to clean, easy to put on, great for chubby feet. These are durable, they stand up to toddler abuse.Overall:I love this as my best alternative to traditional summer shoes for my chubby toddler's feet. I love that they are durable and long lasting, but I have bought these for years so I am aware that a 9 is too tight to use strap for a size 9T length foot (so size up if you want to use strap).Photos:You can see both styled with strap on top and behind. The strap is very short. Colors. And red pair is a 8T and using strap as shown has more room to grow.***please let me know if you found this review helpful by clicking the “helpful” button below. Thank you!!!***\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Cute for Crocs... great for chubby toddler feet... fits two sizes\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 31, 2018",
            "id": "amzn1.account.AGBBWL3RR3QQS76NKWAD7VYORZXQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGBBWL3RR3QQS76NKWAD7VYORZXQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Horrible the back strap is too short.  I will be returning these.6/13 Update....I contacted Crocks, customer service and was told that the back strap should not be that short.  They asked for proof of purchase and to have the tags on the unworn clogs and they would issue a a return authorization # and will send me a replacement for the defective ones. After that I have also purchased additional pairs from Crocks the strsp is normal.  I noticed that the ones purchased on Amazon were made in Mexico apose to the ones purchased from Crocks that were made in Vietnam.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    One Star\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 30, 2018",
            "id": "amzn1.account.AF4FXDGEGTVBEUPHFJCNXY3X6IFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF4FXDGEGTVBEUPHFJCNXY3X6IFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My son loves his crocs, my daughter has a couple pairs too. But we left my sons in sun while at a pool party and when we went to put them back on a couple hours later they were way to small! They were about 2 sizes too small. He had to go home barefoot. I read on a few blogs that if you put them in hot water and put them on your feet and walk around they will stretch back a bit, but I’m not gonna put my 2 year old through that. I did try hot water and pulling at them trying to stretch them out w my hands but no luck. I reached out to the company and their response was just “they tend to shrink in sun and we have no way to fix this”. Not helpful. They wouldn’t even replace them. These shoes aren’t cheap but i keep buying bc my sons feet are so thick and chunky they don’t fit in anything else. I wish company would replace and be more outspoken about the fact that they shrink in the sun. I mean, isn’t the sunny days what these shoes are for? They have holes!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Beware - they shrink in sun !!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 9, 2017",
            "id": "amzn1.account.AFRAW5G7F4ZYPR3ESAI2GTMVIK7A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFRAW5G7F4ZYPR3ESAI2GTMVIK7A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Crocs are hands-down the best shoes for toddlers - they can put them on by themselves, they cover the toes and they provide pretty good traction for stomping through mud.  Now if you are grown man or women who does not work in the medical field then you shouldn't be wearing Crocs.  If you do, you will be an embarrassment to your family for generations.  If this was 2007, then by all means, wear your Crocs with pride.  I did.  In fact, I wore my Crocs Off-Roads to Machu Picchu AND I hiked to the top of Wayna Pichu wearing those bad boys. Proud of that.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Crocs are the official shoe of small children\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 10, 2017",
            "id": "amzn1.account.AGLW6R3WZF3AJ2CNO6IWDEOSFUFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGLW6R3WZF3AJ2CNO6IWDEOSFUFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Great shoe for toddlers. My 22 month old wears a 6 and I ordered a 6 and it fits well and with enough room to fit all summer. They go with everything so cute!(Have have ordered crocs in size 1 and 2 for my older boys and they are waayyy to wide, fyi)\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great for toddlers\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 5, 2017",
            "id": "amzn1.account.AEEHAJ5OP3K2N72MKY2TLBCB5BMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEEHAJ5OP3K2N72MKY2TLBCB5BMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We bought these in a size 12 for my 5 year old and although they are a narrower fit than his Star Wars light-up crocs, compared to his other shoes (see pic of Carters sneakers, size 12) they really aren't narrow to the point of uncomfortable. If anything, they are TOO comfortable for him (must be the foam cushion) - he never wants to wear his regular sneakers - which I don't like because although these crocs give his toes more wiggle room, the rubber toe seems to constantly cause him to trip when running outside. Adorable shoes, but since he started school this year, I prefer him to wear these when at the beach or a pool, vs. as an every day shoe he'll be running in on the playground.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Definitely fit narrower than his previous crocs ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 25, 2017",
            "id": "amzn1.account.AEDGNXUKLCHLIYKQTBVAALIBBAEA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEDGNXUKLCHLIYKQTBVAALIBBAEA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My daughter lives in Crocs all summer, so I got these crocband style Crocs in purple (very bright and cute!). Unfortunately, they run small for a size 9. She's 4 years old and a true size 9 in gym shoes. I ordered a 9 in these based on reviews that they run true to size or even a little big... nope! The 9's just fit. I'm hoping they get her through the summer. It's nice they come in whole sizes and not double sizes like some Crocs do. I'll know for next year to size up. Beware that after size 13 the crocband style gets enormous in width for sizes 1 and above. My older son is in a size 2, and I had to return the ones I bought for him. They were so wide that he could almost fit both feet in one shoe! No idea why they make this style so wide after size 13:( We bought him the Electro and Bump It styles which are much more narrow for Crocs anyways;)\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Cute but Small\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 23, 2017",
            "id": "amzn1.account.AFDDZU3SSBPQ6UEHWPVNWBAT6JTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFDDZU3SSBPQ6UEHWPVNWBAT6JTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I ordered these for my toddler to wear while we play in the creek this summer. There are two parts to this review.1.  I ordered them in her current size thinking they would soon be snug with the strap down and then wouldn't slip off in the water. They were WAY too small. Her foot wouldn't even fit in the shoe with the strap up. There was absolute no way of putting it down. I re-ordered them two sizes up from what all her other shoes are. There is a bit a room to grow. But with the strap down they fit perfectly. I should add that when the strap is down it does not meet the heal of the shoe but comes down about half an inch in. They will fit for this summer with the strap down and then still for a while after that with the strap up.2.  Now that we have a pair that fits, they are wonderful shoes and perfect for what we wanted. She's able to go from the creek to the yard and play comfortably in both places. If the sizing had been more accurate I would have given them a  higher rating.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Caution - runs small.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 3, 2019",
            "id": "amzn1.account.AENRY5O66WAAZIZDQQINVD3PLFZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AENRY5O66WAAZIZDQQINVD3PLFZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My 5 year old granddaughter absolutely loves her Crocs ... in fact they are the shoes  she first learned to walk in.  I believe the wide, firm base was what did the trick.  We have gotten her about 2 pairs per year as she outgrows them.  They get a little worn and scuffed from wear but they have never even gotten close to wearing out ... nor have we ever had any breakage.  She does love to dress them up with jibbitz that I let her pick ... her latest fad is unicorns which are really adorable on these crocs.A great selling feature for me is the ease kids have getting them on and off QUICKLY and with no frustration.  We also go to the beach a lot and they are perfect. ... especially on the hot sand ... another benefit if they get swept out in the water by a wave they float and can be rescued! !!!Crocs are the only sandals we buy for her and they are highly recommended by this grandma.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Crocs are fun\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 20, 2018",
            "id": "amzn1.account.AGOOF54DHHCUPMS22IB2EZVXNRWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGOOF54DHHCUPMS22IB2EZVXNRWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My toddler loves his \"dog walking shoes\"... these were a great value (our local stores generally sell Crocs for about $30). I noticed a lot of reviews saying they were way too small and that the strap didn't fit, and that's exactly what I thought when I first got them. However, I kind of forced them on the first couple times because my 2 year old isn't coordinated enough to walk in them without the strap, and once they were one his feet he had no complaints about them being tight. And the more he wore them, the better they fit--the strap does seem to stretch out a bit the more they're worn, so definitely don't give up on that aspect. (If the foot bed seems to fit, the strap probably will too if you give it a try). That being said, I ordered an 8 thinking it would be big (he's generally a 7), and the 8 ended up fitting just right.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great value. Runs a bit small, but the strap does stretch further than you'd think.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 21, 2016",
            "id": "amzn1.account.AGV5XLEMIEYQBKNM33RTOUZMJEHQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGV5XLEMIEYQBKNM33RTOUZMJEHQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My daughter loves these Croc's. I bought in a size 4/5 (she wears a 5 now and still has plenty of room).  We've been buying crocs since my son was born who is now 4 and these were the first pair I bought my daughter who is 2.  She is always asking to wear these, I assume because they are so comfortable.  I love them because they are durable shoe that my kids can wear to school as sandals since they are closed toe in the summer, to use as water shoes, and because both kids have to wear Croc's at Montessori as \"indoor\" shoes.  We own several pair in each size.  Can't say enough good things about these.  Highly recommend for toddlers.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great toddler shoes/sandals\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 5, 2019",
            "id": "amzn1.account.AE3OQ6FLFJ24TY42F4P4UI5LFZYA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE3OQ6FLFJ24TY42F4P4UI5LFZYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My daughter is firmly a size 8 in toddler shoes and the size 8 champion tennis shoes I bought her are a perfect fit as are her size 8 boots from target. These definitely run large but since we bought them for going to the pool and beach and she really likes them, we just are rolling with it and she’ll grow into them. I was surprised how short the back strap is but since they are too big anyway (even with the short strap), we flip the strap up over the toe and let her wear as clogs and she’s happy. Plus at 3 years old it’s nice for her to have shoes she doesn’t need any help getting on and off. Perfect for car rides where she tends to kick off her shoes and these save me the headache of putting laced shoes back on her every time we get out of the car because they just slip on. I won’t let her wear them for lots of walking until she grows into them more but for the pool at our Disney resort vacation and walking around the resort, they were great.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Too big but my kiddo loves them\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 9, 2019",
            "id": "amzn1.account.AGLJDXE7WOBXDIJDHVQMZOLP3Z5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGLJDXE7WOBXDIJDHVQMZOLP3Z5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These are exactly what we needed for my 3 year old son this summer. We were looking for a water shoe that would also be comfortable, supportive, and protect his feet while he played in the woods and pond of our yard. He is currently wearing a 7.5 in the stride rite made to play sneaker and I ordered a size 8 and they fit him perfectly. I ordered a 9 as well just in case we ran into the problem of the heel strap being too short/tight, but it wasn’t an issue at all. We’ve tried a few other water shoes and none of them fit well. I’ll definitely continue to buy these for his summer shoe!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great water/summer shoe\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 26, 2019",
            "id": "amzn1.account.AF3PMSUPRPMCPYWUC34PH5S7ZUTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF3PMSUPRPMCPYWUC34PH5S7ZUTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Purchased a size \"1M US little kid\" for my 7 yr old. This is supposed to be equivalent to crocs size J1 measuring 7.875 inches (according to the size chart.) The shoe received is labelled as a J1, but is closer to 9 inches. Images next to a tape measure for reference. We have a hand-me-down pair of size 3M crocs, and the 1Ms we just received are larger than the 3Ms. They are also extremely wide. Needless to say they won't fit a 7 year old. Will be returning.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    HUGE! Size 1M US received measures closer to a 4-5M US according to the size chart\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 9, 2019",
            "id": "amzn1.account.AEB7GKB5U6QFYY3HKHQMFV6VQHSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEB7GKB5U6QFYY3HKHQMFV6VQHSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I practically live in the classic 'cayman' crocs, which are the original crocs.  I wanted to try the crocband style. According to the croc site, the crocband style is a 'relaxed' fit (tighter) and the classic are a 'roomy' (roomiest) fit. I normally wear a W2/M4 classic croc and tried a size J3 in the crocband. While it's a tad long, it's a lot wider than the classic. Going down to a J2 probably wouldn't make any difference. Too bad, as I like the style. The sizing of crocs is quite confusing and not accurate. Maybe it's only a problem in the kids' sizes. I have small feet. Maybe it's not a problem for toddler sized ones. The J3 were too sloppy for me.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Relaxed are roomier than roomy fit.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 24, 2017",
            "id": "amzn1.account.AE6TTBPLU7ZT37TYCK7ITKU6FGGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE6TTBPLU7ZT37TYCK7ITKU6FGGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We ordered this shoe 3 different times and were disappointed every time.  We ordered a size 7 (during Amazon prime week when they were on sale) and when the first pair came, the tag said \"7\" but the shoe itself was actually a size 6. Mistakes happen, I get it. A replacement was sent immediately. Second pair came and the sizing is correct but the strap that goes around the heel is unbelievably short. No child's foot could comfortably fit with the strap around their heel. I compared it to his other Crocs that we bought at a store and there is a large difference. We had a beach trip coming up in two days and stores here were sold out, so I thought I'd give it one more shot. Amazon wouldn't accept another exchange so I had to return and re-order (meaning I lost the discount I should have had on the shoe). The third pair came and had the same issue with the strap on the shoe. We kept it because we had to have something, but my son could only wear them without the strap which was no fun for me. Very disappointed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    We ordered this shoe 3 different times and were disappointed every time\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 14, 2018",
            "id": "amzn1.account.AHPJUPMTSL56DWLEJLL6DCDAIT2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHPJUPMTSL56DWLEJLL6DCDAIT2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought the gray/navy Croc in size 4/5 toddler for my one year old and thankfully!!!!! it was the perfect fit for him.It's difficult to buy shoes online for growing feet but these fit him great with room to spare. Hopefully he won't need another pair until at least the end of summer.Crocs is my go to shoe for both my boys because they're easy to slip on and off, are comfortable, breathable, water proof, and easy to clean. No need to throw in the washer- just soap and water on a paper towel or use a hose ;)I love that they're affordable and have such a variety of colors and styles.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I love Crocs for my boys!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 7, 2019",
            "id": "amzn1.account.AGTC6XEUTALIXMTOMC7I6QHV7JDQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGTC6XEUTALIXMTOMC7I6QHV7JDQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Disappointed in these Crocs. My toddler had a different outdated style of Crocs in 4/5 size and they were our go-to all summer. I bought a size 6 in these thinking they’d be a perfect next pair, but the strap in the back seems way too tight/short causing them to be much smaller than we’d hoped. Barely getting any wear as they’re a pain to put on. Wish they were the same style as his previous pair! Like Crocs brand, but disappointed in these.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Disappointing\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 5, 2018",
            "id": "amzn1.account.AFRJL262GMHFWIGGEHAW6CBYJ35A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFRJL262GMHFWIGGEHAW6CBYJ35A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My child with chubby feet will only wear crocs or wide size sneakers. I like the look of the crocbands so he gets a new pair every time he outgrows his old ones. There are no 1/2 sizes so when he sizes up, they are always a little large. He soon grows into them, however. Unlike his sneakers, he doesn't usually wear his crocbands out before needing a new size. So the durability is great. We will continue to purchase these for a long time. I often buy them on Amazon when they offer a good price.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Crocbands\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 7, 2019",
            "id": "amzn1.account.AHJ7HZ4ALEYVN5XNQM3DPE7ZEM5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHJ7HZ4ALEYVN5XNQM3DPE7ZEM5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought these for my 19mo yo wear to his swim lessons. We had originally tried flip flops with the ankle strap but ultimately they did not have any support and he would end up stubbing his toe.Then I decided to try the water shoes but they also did not offer enough support or protection and I really wanted something that would transition should we decide to grab lunch or run errands afterwards.These are a nice firm rubber but comfortable, my son can walk easily (added bonus is the ankle strap) and he loves them but the best is they keep his little feet protected.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great for pool and beach outings!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 29, 2019",
            "id": "amzn1.account.AGEX26IPFWYIIGYN453QLRF5QQ6Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGEX26IPFWYIIGYN453QLRF5QQ6Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought two sizes: toddler -6 and little kids - 2.Size toddler 6: I have no comments. Size, width and quality are good.They look good.Size 2,little kids🤔🙁Strange size.  It is good in length, but in width I have no explanation why the model is so?!?! Too wide !!!  They are wearable, my son likes them, but they are really weird wide (as many people say in their reviews) Anyway, these are just some slippers - sandals. We like Crocs, but this model surprises us a little  with this width.  ..... as wide as a big man, short as a kid...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    So much wider than expected🤔\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 5, 2019",
            "id": "amzn1.account.AEFLD4PTQEGWEXRQ7T54Q5W4G3DQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEFLD4PTQEGWEXRQ7T54Q5W4G3DQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I loved these on my toddler’s feet when I first got them, and he loved them too, didn’t wanna take off. But it doesn’t look exactly like in the picture. It doesn’t have the ‘button’, rather there the circle is printed. The biggest disappointment though was one of the pairs shrinking a couple sizes down. Apparently that was because of the heat? I got a new pair and was careful not to leave the shoes in the sun, but the same thing happened. I don’t know if it’s because these are fake crocs or not? Haven’t seen this happen before.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Shrinking shoes :(\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 28, 2019",
            "id": "amzn1.account.AHGYXB25HIUZYHMAECP4G4GOMNHA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHGYXB25HIUZYHMAECP4G4GOMNHA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I ordered these sandals for my 22-month-old after sending back several other brands of sandals because they wouldn’t fit on his chubby feet. These are heaven sent! He usually pulls all shoes off his feet but not these...he wants to wear them even when he is lounging around the house! He is usually a size 6 but he could only wear the 6 with the strap over his foot. The 7s fit perfectly with the strap behind his foot - I was worried about it rubbing but that hasn’t been an issue at all. To all parents/guardians looking for sandals for toddlers who still have all of the baby fat on their feet and are losing their minds because most toddler sandals don’t come in wide, try these! And a huge thanks to the other reviewers who sold me on these sandals to begin with :-)\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Perfect sandal for toddlers with chubby feet!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 12, 2014",
            "id": "amzn1.account.AF5YTIPSAQJOXQ3A7J2D2PEGWR6A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF5YTIPSAQJOXQ3A7J2D2PEGWR6A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really wish Crocs would make in-between sizes instead of jumping from 6-7, 8-9, etc.  It's only logical there should be a 7-8!  Our almost 3-yaer old is pushing the threshold of his 6-7 pair but he is absolutely swimming in the 8-9.  I doubt I'm the first to raise this issue but it's pretty annoying when you have a pair of great toddler shoes and then have to basically wait for a growth spurt to continue comfortably wearing the brand.  Otherwise they are, well, CROCS...the same as they've always been which is durable, waterproof and generally a good option for kids (save for the inevitable blisters!).\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Wish Crocs Made the In Between Sizes\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 7, 2017",
            "id": "amzn1.account.AEWEEYQT5OZGMBIMDJUL2SCOI7JQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEWEEYQT5OZGMBIMDJUL2SCOI7JQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I ordered two pairs because I thought the first pair was a lemon. The croc strap is much shorter this year, making the strap utterly useless. My daughter either wears a size incredibly large for her but with the strap fitting, or a properly sized shoe but the strap is too short. I'm disappointed in crocs for changing this vital design element and hope they rethink it next year. I'm keeping them but only because my daughter won't give them back. I foresee many trips and falls as a result of the years designs, they will only be beach shoes I guess. Included is a photo, the purple pair is last year's crocs for comparison, the light blue pair is for this year. We have the same problem with my younger daughters crocs in a smaller size.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Shorter croc strap is disappointing\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 5, 2019",
            "id": "amzn1.account.AEUUSNRPQPYWLSE7N4XX5OTUJVUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEUUSNRPQPYWLSE7N4XX5OTUJVUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My 17 month old son loves these Crocs! We just got them today and he never took it off! It's easy on and easy off but not too easy that my son can do it when I don't want him to. Lol I got this because we are flying and going to the beach. I definitely like this better than his Velcro shoes that he knows to take off now. I foresee myself buying another pair when he outgrows thus one.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fits great!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 4, 2018",
            "id": "amzn1.account.AHJFC3LULE4DOKKELUNI3LAZ6FSQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHJFC3LULE4DOKKELUNI3LAZ6FSQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Based on the other reviews I have seen, I was initially worried about the strap being to small for the shoe. but when the shoes arrived, the straps were proportional to the shoe. I would not have ordered but my son's school requires a shoe of this type, but now that my son has been wearing them quite comfortably, I will consider getting another pair or two. This is also good for kids with wide feet.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great fit and quality.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 28, 2019",
            "id": "amzn1.account.AH66Q5QTQTBCSP4FHLTAOOXVP5QQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH66Q5QTQTBCSP4FHLTAOOXVP5QQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My baby girl wears size 5 . After reading reviews  some ppl wrote to get size or two bigger. She is 18 month old and when the shoe is too big it’s not really easy to walk, so I decided to order her normal size which is 5 and go from there. And it fits her just right. I am so glad I got the right size. I took them off after she tried them on and she was so upset and was really trying to put them back on so I know that she is really comfy. The size chart  is true to what we got. Very happy with our purchase\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    True to the size\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 26, 2016",
            "id": "amzn1.account.AFLMZXFSIIVNOG3L7OOFXAAW63JQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFLMZXFSIIVNOG3L7OOFXAAW63JQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought these for my oldest grandson who is 5 but they were way too wide for his skinny foot. I gave them to my oldest grand daughter who they fit perfectly and bought a different Croc style for my grandson. Everyone is happy. I buy my grandchildren Crocs because they are easy to clean, lightweight and can be passed down to either boy or girl. My grand daughter's have the sandal for summer and the boys usually get the beach shoes but we've been trying some other styles now that they are getting older. I love Crocs!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I love Crocs!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 13, 2019",
            "id": "amzn1.account.AGJ5I7ZNXRGAM3UCSKAAFTDOHWWA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGJ5I7ZNXRGAM3UCSKAAFTDOHWWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My toddler loves these. They are easy for her to put on by herself. They are a little big on her but the strap helps keep her foot in. She seems comfortable in them and walks well in them. I order one size smaller just to see if they were in fact too big but those didn't have a roomy fit and just seemed too small. I think these will last her a bit because they have some extra room. Overall we are happy with these. Amazon was the only place I could find this model.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Easy to put on\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 9, 2019",
            "id": "amzn1.account.AFEAZZY6HIMUMGH53CXHZ4SWKHOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFEAZZY6HIMUMGH53CXHZ4SWKHOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This is my toddler daughter's second pair and they are the best! She has worn them all summer and we only had to get the second pair because she grew out of the first. She wears them all the time, and they are great for playing in her pool or running on wet pavement and keeping her from slipping. She always runs to pick them out of the closet when I tell her it's time to put shoes on. Great for an active toddler, easy to clean and well made. Would highly recommend.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love These!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 25, 2016",
            "id": "amzn1.account.AGIGZKVOYIG23GHFGOYOGLEGJNMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGIGZKVOYIG23GHFGOYOGLEGJNMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My 4 year old wears a size 10.5 and I ordered the 10/11 and they fit him well. They are able to be worn comfortably with the strap in the back. They are also just the right width. My son has a wide foot and these fit him great and don't look big. I tried a different pair of crocks in the same size which looked much bulkier and were much looser on him. I ordered these in the blue with white and green trim. They go with many of his outfits and are just an easy shoe to slip into to go to the pool or just out in the yard.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fit and look great!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 24, 2017",
            "id": "amzn1.account.AGGJC3KK76CW2A2FF6ZN4U3LSKTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGGJC3KK76CW2A2FF6ZN4U3LSKTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Slimmer design than original Crocs. Love that they offer single sizes now! My son is wearing a size 11.5 in regular shoes and order size 11 in these Crocs and they fit. I expect he'll need a size 12 before the end of the summer. Just FYI, originally ordered a size 12 in Crocs Electro and too big. Held onto them and that's what he will grow into when these are too small. The Electro is a roomier/more generous fit obviously. If you can get sizing right you can't beat Crocs!!! My boys live in them everyday/all day!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love new single sizes!!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 9, 2020",
            "id": "amzn1.account.AFFIXZ4O3RDBDFVK3WVVW6DVDKVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFIXZ4O3RDBDFVK3WVVW6DVDKVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Crocband Crocs are my go to outdoor play shoe. I buy the crocband style rather than the classic style because my children have wide, thick on top feet and these fit the best. Classic style has been too small in the past. Crocs are durable and last a summer to then be worn next summer when ordered a size up or passed on to the next baby.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Crocband Outdoor Go-To Shoe\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 9, 2018",
            "id": "amzn1.account.AGFY3BJEFECBOXRQV535C4Z57V2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGFY3BJEFECBOXRQV535C4Z57V2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This is the third or fourth pair of crocs I’ve bought from amazon. I put them on my list and wait for a sale so I try to spend around $20. I’m very pleased with croc shoes as they have a wider base and good sole. My child likes to wear them to the beach, on walks and all warm months which is 9 months out of the year where we live.They are 100% rubber so easy to rinse off.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Buy on sale\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 15, 2020",
            "id": "amzn1.account.AHH2OMHWMQ7V4XT2FVR4Y3O7ZDWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHH2OMHWMQ7V4XT2FVR4Y3O7ZDWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I get it without box, only plastic bag, my baby hates it, I don’t understand why until I measured them - they’re different, same size but different, that way it wasn’t feet. Now I feel so bad because I tormented my child to wear it...Be careful, do not repeat my mistakes..Now we need to go to the orthopedist.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Difficult size\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 2, 2020",
            "id": "amzn1.account.AGJ5D7DZLMCRPUW35UQZBG5NE4OA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGJ5D7DZLMCRPUW35UQZBG5NE4OA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Went by the size chart and measured my grandsons (2 yr old and 7 yr old) feet exactly to ensure proper fit.  Just got them today and each pair is WAY too big.  Probably 2 sizes too big!  Great shoe it seems, but only getting 3 stars because it will be winter before they fit, or maybe next summer.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    RUNS BIGGER THAN SIZE CHART\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 7, 2017",
            "id": "amzn1.account.AHHOTVJ56VYB6XBX3RFIHZ32RCLQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHHOTVJ56VYB6XBX3RFIHZ32RCLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I am a croc hater in general.....but for my toddler, I LOVE these shoes. They are so easy to slip on and off of him. They never fall off and can be easily cleaned. So from this croc-hater to another...buy this shoe for your toddler. It really makes life easy!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This croc-hater loves these\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 3, 2012",
            "id": "amzn1.account.AEZPCGWGLAXGSXHUZTZ6F3Z36B2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZPCGWGLAXGSXHUZTZ6F3Z36B2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Crocs are THE all-purpose shoe for the busy toddler or preschooler. My 2 year old son puts them on himself, and they literally take us through the day. They can go from the mall to the playground, to the pool, wherever. There is no need to pack extra shoes for different activities. At the beach this summer, I saw very few young kids without crocs. One day at a popular park, the adults took notice that every  child was wearing Crocs (we had about every color of the shoes represented). Again, the versatility is key. My son trotted down the boardwalk, went on rides, and played on the beach and in the ocean--all in the same pair of shoes (and I packed about 6 pairs for him!). When the day is done we just scrub them up with the hose and set them out to dry.One thing that can be a little tricky is the sizing. Since they come in what I call \"double sizes\" (6/7, 8/9), his current pair is a little loose since his shoe size right now is a solid 8. Once in awhile one will slip off, so that is something to keep an eye on. But you don't want these to fit too tightly or the back strap will rub (he's still a bit young to wear the strap flipped up without back support).I didn't start putting him in crocs until he was about to turn 2. I know some people use them earlier than that-- it depends on the physical development and steadiness of each child. Kids who need super supportive shoes for weak ankles may not be able to wear these all day. But all in all, this is a sturdy, versatile, comfortable shoe.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Best shoes for toddlers!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 24, 2019",
            "id": "amzn1.account.AG2WJUWNRYVUGM2ZYW7QIWI43DMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG2WJUWNRYVUGM2ZYW7QIWI43DMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    We love these crocs for both our kids and have bought them over and over as they grow. Easy to get on and off for the kids, lightweight with a back strap so they can run, covers toes so if they fall they don't get all bloody, rubbery material that dries quickly and easy to clean, and holes in them so the ultimately are perfect summer shoes.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Perfect for children!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 7, 2016",
            "id": "amzn1.account.AGOJQW46GRVT7QSR3ODPSVSN5U5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGOJQW46GRVT7QSR3ODPSVSN5U5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Great color! My 4 year old daughter loves these shoes.  Perfect for the park, for after swimming or a full day at Disneyland.  She loves these shoes and wears them all day long without complaints.  She loves that she can customize the shoe by adding different characters to the shoe.  Overall I was very happy with the purchase since the price was right and the shipping was great.  I recommend these shoes as the perfect summer shoe for your toddler.  They are easy to put on and take off and easy to clean.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great shoe for my toddler!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 22, 2020",
            "id": "amzn1.account.AEWKIOPCUNKZGTYZSZLSA577MM4Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEWKIOPCUNKZGTYZSZLSA577MM4Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Love the look of the crocbands on kids. 9 yo loves the ease and comfort. Will usually last everyday use throughout the summer if you can get a good deal, they’re worth it. I have found that Crocs bought here are slightly smaller then those purchased directly from the manufacturer or in a brick and mortar store.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great purchase for a rugged boys summer shoe.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 4, 2019",
            "id": "amzn1.account.AGBHCGCJ3AG73HQ4QHRSIQJHXYMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGBHCGCJ3AG73HQ4QHRSIQJHXYMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Love the crocband style. What I don’t understand is why crocs sizing jumps so much between a youth 13 and youth 1/2. My son wears a size 1.5-2 in Nike and Sperry’s. Yet we had to get him a size 13 in crocs which are honestly a bit small. Yet the next size up is too wide and large. Overall great quality and as long as he leaves the back strap up fine.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 4, 2018",
            "id": "amzn1.account.AGL5NQ3Z66GD6OIG5XKKU5BTP3YA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGL5NQ3Z66GD6OIG5XKKU5BTP3YA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Crocs are great but at the time my 17 month old kept tripping on our driveway (which is smoothly paved by the way). After three falls, we concluded that it was the sole which is thicker than her other shoes. After three falls of her getting her knees scraped, we decided to retire the shoes. I would recommend this style for indoors or for just walking around on a beach or on grass. OrJust wait till they’re 2 and older.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Thicker soles take time getting used to for 17 month old\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 28, 2017",
            "id": "amzn1.account.AFUFV6DU5AIHN2OJIAH7VSRMR3HA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFUFV6DU5AIHN2OJIAH7VSRMR3HA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I scored these in black for my 18 month old to wear this summer for $12.99  and I can not be happier!  I always mention in my reviews that I only buy prime because I believe that matters when it comes to what gets delivered and therefore reviewed.  These came in Crocs retail packaging and are exactly what I expected.  These are going to be a life and time saver when the warm weather gets here!  No matter how you feel about crocs, crocs for babies are acceptable lol\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Baby crocs will save my life this summer!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 14, 2017",
            "id": "amzn1.account.AEY6XELU4YMUPBYWUEAA5TEBNV5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEY6XELU4YMUPBYWUEAA5TEBNV5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My son has wide and thick feet, just huge all around. I've tried Stride Rite and several other brands in extra wide size and they didn't even come close to fitting. Although I'm not a huge \"clog\" fan for adults, these are super cute on my tot and he loves them. He can run and play with no problems. The bottoms have great grip, they don't slide on our hardwood and laminate flooring. I liked the wide variety of colors.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great buy for puffy feet\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 30, 2020",
            "id": "amzn1.account.AHMUXF77PHXNZ3Z2IVC3GFODC23Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHMUXF77PHXNZ3Z2IVC3GFODC23Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Child usually wears 1.5 youth size purchased a size 1. Fits well n has room to grow. Good quality and price.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 13, 2019",
            "id": "amzn1.account.AELISRTMIPLX5J2Y2NKQV2JNWJCA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AELISRTMIPLX5J2Y2NKQV2JNWJCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These are great summer shoes for my son! He typically has to have an extra wide shoe, but these fit perfectly. I like the look of these over the traditional crocs clog. Only rated ⭐️⭐️ because my son had only worn these twice when the back piece split apart (as seen in pic). I would just hope for better quality, especially in a child’s shoe. I’m hoping that the piece stays intact and doesn’t peel off.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great for wide feet\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 28, 2017",
            "id": "amzn1.account.AGXQISFSTSGYAAV53LN4URC6BGGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGXQISFSTSGYAAV53LN4URC6BGGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I noted some crocs being sold have a small band at the back. This type has the normal band we are used to in crocs. The blue and lime looking color is a great combination. Crocs are great for hot weather and they are easy for my little person to put on. The sizing is correct too. I would recommend these ones.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great color, accurate sizing.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 19, 2019",
            "id": "amzn1.account.AEFBGJ3HZHDLKKPB7CFBYJN7L5SA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEFBGJ3HZHDLKKPB7CFBYJN7L5SA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought these sneakers for my 2 year old son and he absolutely loves them. They fit to size, but allow enough room for his foot to not be constricted (he has somewhat wide feet and other shoes are too narrow). Due to the nature of the material used, they allow for some give while still being structures. They are also easy to clean off. And the shipping time is SUPER quick, which is awesome. Thank you! I have decided to order another pair for the future!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love these sneakers!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 9, 2019",
            "id": "amzn1.account.AE4RZMXXXM4HT6JWSTQOPZK77FOQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE4RZMXXXM4HT6JWSTQOPZK77FOQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I ordered my son a pair of crocs size 7 (the one on the right) because the 6/7 he has at home (the one on the left) are getting too small. I found a pair of 8 at the store and they were too big so I thought a 7 would fit perfectly. The 7s arrived SMALLER than the 6/7s! They fit like a 5/6! Not sure how that happened!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Size doesn’t match the shoe\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 2, 2020",
            "id": "amzn1.account.AGS3OWCOQJKUFPRVMDYGR4NYNJAA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGS3OWCOQJKUFPRVMDYGR4NYNJAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The shoe is great. It's a good color, style, etc. The fit was the problem. It is WAY too big; could have easily been my fault, but the sizing chart along side Amazon's sizing chart made it really confusing. Luckily she'll be able to grow into them, but I have a feeling it'll be just in time for the snowy winter months and not summer. I really like this company though. Crocs rocks.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great ... but way too big\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 6, 2019",
            "id": "amzn1.account.AFCB3FFMSDH33TJJH24F2X7BFZXA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCB3FFMSDH33TJJH24F2X7BFZXA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Unfortunately, my toddler never wore these as the strap at the back made the shoe much smaller (shorter) than expected.  I purchased these to encourage learning to put their own shoes own but it wasn't possible with the strap making it way too difficult and obviously uncomfortable.  The size as far as length was as expected.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Shorter in length because of the strap\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 4, 2018",
            "id": "amzn1.account.AEVLOQB7SF3VVU76PSY5AM7HOIZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEVLOQB7SF3VVU76PSY5AM7HOIZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Love these crocks for my toddler.  Originally purchased them true to size and since the back strap is too short they were way too tight for him.  I exchanged for the size up and they fit good with the strap, though the strap does seem a little short for the size of the shoe.  They slip on very easily and I love that they fit a little wider so they aren’t so snug.  Great overall but you might want to consider sizing up.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Overall great - back strap is too short.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 2, 2019",
            "id": "amzn1.account.AHM7ZU3XCUAAEYFCJPQL7R6MI3QQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHM7ZU3XCUAAEYFCJPQL7R6MI3QQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I love these shoes for my kids for an easy on and off but still protect their toes. My kids love the colors too. Definitely think these are a great shoe for toddlers and little kids!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great sandal\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 23, 2019",
            "id": "amzn1.account.AEM4MI7A7VOMFFDRNHBDLISMJVMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEM4MI7A7VOMFFDRNHBDLISMJVMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My 3 year old lives in these. They are meant to fit wide, so I would not buy them for a baby who is not totally stable walking. But my toddler loves them because he can slip them on easily and they are ventilated so his feet don't get hot. They are also easy to clean off with a wet rag or even hosing them down. We purchased them in two colors, and will likely buy more when he grows out of these.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    My toddler's favorite shoes\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 30, 2018",
            "id": "amzn1.account.AEGFUPGEKRFB3MITL5CTH53R6NRA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEGFUPGEKRFB3MITL5CTH53R6NRA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It only fit for size 7 kids without the belt in the back. If you want to put it on u have move the belt up and use it, but if you try to put the belt to the back of the heel its very tight for a 7 size kid.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It only fit for size 7 kids without the belt ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 26, 2017",
            "id": "amzn1.account.AFQ5F2CGSMOKCUXADIJ3DCA3ZIXA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFQ5F2CGSMOKCUXADIJ3DCA3ZIXA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These little Crocs for toddlers are perfect! They are snug fitting which makes it great for toddlers to walk in. They are easy to clean, comfortable, and very stylish. We're constantly getting compliments on our little guy wearing them and they go with his wardrobe perfectly!! So happy we found these. Can be worn with/without socks too.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Comfy, Stylish, Easy to Clean\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on September 6, 2019",
            "id": "amzn1.account.AGM2EUCSNA7NAREE256FSMEN6AKA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGM2EUCSNA7NAREE256FSMEN6AKA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My little boy outgrew his previous pair, and he picked out this yellow pair of crocs.  The yellow leans towards a neon color.  Not my taste, but he loves them!  I love the quality of crocs as well as the ease of cleaning when they get dirty.  These shoes hold up to a lot of rough wear as they are primarily worn as play shoes.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Long lasting shoes\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 7, 2017",
            "id": "amzn1.account.AHHS3VNK7RNYN5GNYQLCKYNVOAQQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHHS3VNK7RNYN5GNYQLCKYNVOAQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Trying to find the right summer shoes for my toddlers has been difficult. Most sandals aren't comfortable for their little feet yet, and don't provide support. I have a 1.5 yr old and a 3.5 yr old. They both love them. The little crocs are surprisingly easy to run around in. They definitely have to wear the heel strap though.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good to go\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 3, 2018",
            "id": "amzn1.account.AEWL7U2DKTDK7W4IMTNL7BVKSR5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEWL7U2DKTDK7W4IMTNL7BVKSR5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    BEWARE these shoes are big and wide. I don’t know why most of the reviews are claiming they run small. Maybe those reviews are taking in account the straps in the back. Yes, the straps do shorten the length of the shoe but not considerably.My 6 year old normally wears a 13 or 1 in Nike/Skechers yet turns out is a 12 in Crocs. I know because I ended up taking him to the local Crocs store to try on the shoes in person. Cost of 29.99 online is comparable to store pricing. The shoes are not bad per se, it is just a hassle to have to deal with returns.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    These Crocs runs big!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 13, 2013",
            "id": "amzn1.account.AFMDMC7G3KTJ7LPPNJWED6V2G5HQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFMDMC7G3KTJ7LPPNJWED6V2G5HQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This was my first purchase of Crocs.  I bought them for my 4yo daughter to use outside in the yard or on a quick run to the store.  But they are really cute enough to use as regular shoes in the summer.  They are comfortable and easy to put on and take off.  I like that you have the option of using the heel strap or not.  My daughter is between an 8 and 9 toddler shoe at the moment and this size 8/9 fits her perfectly with zero room to grow.  As she starts to outgrow the shoe we'll probably move the heel strap out of the way and get another couple of weeks use out of them before moving up in size.  She has had her Crocs for a few weeks now and they seem to be very sturdy.  I don't see any way that they will wear out before she outgrows them.  In fact, I plan to hand them down to her little cousin when she is done with them.  Bottom line, we are more than satisfied and will buy them again.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Worth the money\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 19, 2019",
            "id": "amzn1.account.AF55ML5H47QG7KMOYVKN4MQRPLJA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF55ML5H47QG7KMOYVKN4MQRPLJA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Crocs are prefect for quick trip out. Slip in and out of toddler easily. My baby loves his crocs so much, he wanted me to put it back on his feet after I took them off. I didn't have any issues with the band being too short like other reviewers have said. I'll be purchasing another pair.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Perfect for toddler\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 9, 2020",
            "id": "amzn1.account.AFO6THRZ2MAC7I47ICH2K46EW3AA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFO6THRZ2MAC7I47ICH2K46EW3AA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I love the colors on this crocs so versatile matches almost all everyday outfits, my son also loves to be able to put it on by himself to get outdoors. Easy to put on and off avoiding temper tantrums it’s just priceless 😊\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Classic color matches many outfits and my toddler loves it\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 18, 2019",
            "id": "amzn1.account.AFLPJT7K57CIOLWANJYIRFLATBZQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFLPJT7K57CIOLWANJYIRFLATBZQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So cute! Shipped quickly and the Crocs are perfect. Size is right on. We bought size 7 toddler. If you have seen Crocs in local shoe stores, like I have they usually say size 7/8 toddler. These are true size 7 only.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Cute\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 6, 2019",
            "id": "amzn1.account.AHSK66KQ2PATASL3FN2DSAZFRMLQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHSK66KQ2PATASL3FN2DSAZFRMLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My little girls got so many compliments on these crocs and they loved them, too! We're going to be the next size up (in the same color) because they go with everything and are easy to throw on in between extracurricular activities. Love them!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Super Cute Crocs!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 29, 2019",
            "id": "amzn1.account.AHM7PWHPWT7RTOFD3TSLKOBPGLFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHM7PWHPWT7RTOFD3TSLKOBPGLFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My daughter loves her Even though size 6 is still a bit big for my Petit 2-year old girl, she wears them all the time. Crocs are also great during potty training... if there’s a pee accident, you can just rinse the shoe, dry it with paper towel, and it’s good to go in no time!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Great for a lot of activities, including potty training!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 21, 2017",
            "id": "amzn1.account.AFQZRO5ECXHVVRYKSWH67C3TCP2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFQZRO5ECXHVVRYKSWH67C3TCP2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I like the color and style of the shoe but after a week of my son wearing the shoes I notice that the top part of the shoes are peeling. I would have never thought that Crocs would be made so poorly. I bought a pair of clogs that was an off brand name and that did not happen. My son loves them and said they are comfy and that is why I gave 2 stars.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Crocs Kids' Crocband K Clog\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 28, 2019",
            "id": "amzn1.account.AEXGISIVX7WBUNI7UHHERVB3DF7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEXGISIVX7WBUNI7UHHERVB3DF7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Ever since purchasing these shoes my daughter has been crazy about them! She literally wants to wear everyday! The pink color is adorable, they are very durable, and fit true to size. Very comfortable too (my daughter says so)!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    My daughter’s favorite shoes!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 17, 2018",
            "id": "amzn1.account.AF55D2EJI5LALJ7EMDTOMV4TWEFA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF55D2EJI5LALJ7EMDTOMV4TWEFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My 5 yr old wears a 13 I didn’t want to get his size and have them not fit by summer (it’s january) so I went with a size 1 and it’s totally fine he’s got some room but not too much that he can’t walk or play in them. He loves his crocs favorite play and summer slip on\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love our crocs\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 6, 2019",
            "id": "amzn1.account.AHUFPESDJ4DJ7LMYHLQSEINNVIOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHUFPESDJ4DJ7LMYHLQSEINNVIOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These are my son's \"go to\" summer shoes when he's got his choice of what to wear. He'd wear them every day if I let him. And even now in the cold weather, he still wears them in the house. He loves these shoes.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Will buy again in the future\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 5, 2019",
            "id": "amzn1.account.AGE77NLBWBK6Z7DQHDUINEA67DCQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGE77NLBWBK6Z7DQHDUINEA67DCQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My son wears size 6 in shoes so we got these Crocs in 7/8 and the shoes were way too small his feet would go in. We have purchased Crocs before and bought size 7 and they fit him perfectly. Idk if these are made elsewhere because they felt chaperone made than his store bought Crocs.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Shoes run small\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 11, 2019",
            "id": "amzn1.account.AH3MQUI3ZUVV2UEFVFHE7VBZ7Z5Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH3MQUI3ZUVV2UEFVFHE7VBZ7Z5Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have always loved crocs & they really are great for kids.  Each time my daughter grows out of a pair, we get another pair.  She loves this pair especially because of the pink color & I love them because they are even more slip resistant that regular crocs!  Thank you!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I love these & so does my daughter!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 29, 2019",
            "id": "amzn1.account.AE3W2ZQ6LCZS5KWS4ICNFESPBTQQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE3W2ZQ6LCZS5KWS4ICNFESPBTQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I am not sure what kind of a size 3 shoe kid could fit these shoes, but my daughter's leg are swimming in these shoes. extra extra extra wide, too large ... hoping they would fit her in a few years!! kept them but not sure if she will ever use them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    kids?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 10, 2020",
            "id": "amzn1.account.AGJDFBATAM5NZOTDYQJMNBJQFKTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGJDFBATAM5NZOTDYQJMNBJQFKTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My son wears size 7 in all other shoes, but these size 7 are small-and they weren’t cheap. I can’t return them now because it’s too late. A discount on the a larger pair would be nice.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    But 1 size bigger- too small\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 3, 2020",
            "id": "amzn1.account.AGTWPFOSGRB5HD7DWYHAOR3Q5E3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGTWPFOSGRB5HD7DWYHAOR3Q5E3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought this crocs for my 4 year old son to wear to the pool when he has swimming lessons.  So for this reason this crocs are just perfect! Get in quick get out quick. They dry fast too.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 1, 2020",
            "id": "amzn1.account.AGRU3YBNDAOCYRMRACFRO367G3PA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGRU3YBNDAOCYRMRACFRO367G3PA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I ordered the first pair of this style of crocs for my grandson in his show size.  I had to return that pair and reorder in one size up.  These are slightly large but more comfortable  - and his feet are only going to get bigger!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Order one shoe size up\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 21, 2019",
            "id": "amzn1.account.AGDSFSEPLHPROYZBVWX7ZPPTMM2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDSFSEPLHPROYZBVWX7ZPPTMM2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It is partly my fault for forgetting to take into account the width of the shoe, but it should have also been listed. The shoe is so wide, it's too wide for my adult foot, and preposterously wide for my 8 year old's foot. Good grief. Deceptive advertising is ridiculous; it only creates inefficient time and cost waste in the end for everyone.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Wider than my adult foot.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on August 20, 2018",
            "id": "amzn1.account.AEUB3XJOEOVRFFJ4WF25WVK4OFHQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEUB3XJOEOVRFFJ4WF25WVK4OFHQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    They are so cute! But definitely smaller than expected. My daughter is 2, wears a size 3 shoe in every other brand. We have a pair of 2/3 crocs that we’re getting pretty tight, so we ordered these in a 4. They don’t fit with socks on at all and are very tight without socks. I love the look. But I wish we would have sized up.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    We have a pair of 2/3 crocs that we’re getting pretty tight, so we ordered these in a 4\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 23, 2018",
            "id": "amzn1.account.AHSNIIDI66RYC7PPFPBFL5OV6TTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHSNIIDI66RYC7PPFPBFL5OV6TTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The color and fit are fine, my little boy loves them. I’m just disappointed in the product. It is not the same tough and sturdy shoe it once was. The bottom and sides are already peeling and scuffing. I have a rough and tumble boy, but the croc brand has always been able to hang with him. I’m not sure if the material has changed or if this is a knock off.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Ok, but not the same.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 28, 2017",
            "id": "amzn1.account.AGBQ2BNHXPYRDB2F4YAL53XNCS2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGBQ2BNHXPYRDB2F4YAL53XNCS2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The fit is ok, the problem is that the heel strap is MUCH smaller than the shoe itself. It shortens the shoe by about half inch. SO while the shoe fits fine with the strap up, it DOES NOT fit with the strap down. Bought for the beach and leaving in 2 days, so not returning but not sure if the toddler will be able to walk in them without the shoe being secured by the strap.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    SO while the shoe fits fine with the strap up\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on May 18, 2018",
            "id": "amzn1.account.AHDDCEK2FCJRR3BFB7UDV7M7CFBA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHDDCEK2FCJRR3BFB7UDV7M7CFBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This Croc is very wide! It may have stated that somewhere in the description, but I didn’t see it when I ordered them. I had to buy my son a different pair that were narrower. Otherwise, if your child has very wide feet, these are fine.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Wide width\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 18, 2019",
            "id": "amzn1.account.AE36LAX64DYFAA5OAVXXNFJFP4UQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE36LAX64DYFAA5OAVXXNFJFP4UQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Crocs is the most comfortable footwear for kids. I have always bought classic crocs sandals for my daughter but her size was not available in amazon, so I ordered this and my daughters like wearing them. It doesn’t slip from feet for my 20 month old and she wears it on her own.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Most comfortable crocs\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 25, 2019",
            "id": "amzn1.account.AHSZREAHPC7YBFE7A4KTFIJK32ZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHSZREAHPC7YBFE7A4KTFIJK32ZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    My daughter (almost 3) now has her own pair of Crocs to match mom and dad lol. She loves them. Super easy for her to slip on by herself to go outside or to gymnastics or wherever. They will last her a long time which is great.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love these\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on June 27, 2019",
            "id": "amzn1.account.AESEYEOCEMMSMFSMNU7UEXBZATBA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AESEYEOCEMMSMFSMNU7UEXBZATBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Easy wear, good price, good productGood explain about sizes. My boy's shoe size is 5 but coz it's wide, wears size 6 od other shoes and hard to keep then on. This product is quite and just same as it is explained. Very satisfied.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good for kid with wide foot!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 26, 2019",
            "id": "amzn1.account.AEBK3AAH2YHZM4YR4KHJ5FDYYUIQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEBK3AAH2YHZM4YR4KHJ5FDYYUIQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These were not the size I ordered. I wanted toddler crocs in a size 3. They arrived and are “junior size 3” and almost large enough for me!! They were supposed to be for my 1 year old!! Bummer. I’m a busy mama. I forgot to send them back. They’re still sitting on my desk in the original packaging!! 😕\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not the size I ordered.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 17, 2018",
            "id": "amzn1.account.AF3CEATBR5M2H6KCD2THMTALAZ4Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF3CEATBR5M2H6KCD2THMTALAZ4Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These are really cute, but as other reviewer's posted the strap does reduce the size by one. If you really want to get wear out of them might want to order 2 sizes up. This may make it difficult for a still toddling at times walker.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    These are really cute, but as other reviewer's posted ...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 29, 2018",
            "id": "amzn1.account.AEHES5U6COITS3B3NQUFW2SAVDAA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEHES5U6COITS3B3NQUFW2SAVDAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought these for my three year old son for next summer. They look and fit great. We love Croc shoes for our kids because they are easy for them to put on themselves and easy for the parents to clean. Win, win!  The color of these will go with lots of his outfits too.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love Croc shoes for kids!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on February 18, 2020",
            "id": "amzn1.account.AFMX6EUGDXXIMJLKTSQGXCOPG4ZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFMX6EUGDXXIMJLKTSQGXCOPG4ZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought these for my grandson which he is size 7 and were to small which I saved them for my other grandson because I really like the bottom grip and order 8/9 and those fit perfect. They are so so cute...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Size are small order one size bigger\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 17, 2018",
            "id": "amzn1.account.AEOOUM5ARC6HNGYMNGE26CFT55MA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEOOUM5ARC6HNGYMNGE26CFT55MA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It is really good because you can just put your feet in it and you can go. You don't have to tie your shoes, you don't need the thing to help adjust your feet. Just put in your feet and you can go! Also, you can adjust the strap to the top or to the bottom. Depends on what type of person you are. Crocs rule!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Good\n  \n"
        }
    ]
}