{
    "reviews": [
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 31, 2019",
            "id": "amzn1.account.AFC7C27TX2CRYZ4BHIC7YMRUGIYA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFC7C27TX2CRYZ4BHIC7YMRUGIYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I purchased my OnePlus6T on December 12 -- and the power button and volume up/down buttons do not work.  I have to call my phone to 'wake' it up.  I've been chatting with OnePlus on line and the warranty is good to the party who purchased the phone from them.  It appears they are willing to work with me to get it repaired but I will have to send it to them -- not sure where yet.  I am in Alaska so would be without my phone for some period of time -- one, two, three?? Who knows.  And the phone is less than two months' old!!  I had the 5T and no problems for a year.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    How does the manufacturer's warranty work when sold through a reseller?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on March 19, 2019",
            "id": "amzn1.account.AHEJUCKVJPBAR63LWNPCXD32QWDA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHEJUCKVJPBAR63LWNPCXD32QWDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    This phone is stuck on mute! I’ve tried everything to turn on the ringer volume and nothing happens. The battery life is also not what they say it is and a phone’s most basic function is to RING, right? Well, not this one. Now, I have to return it and go through that drama. I really was excited to get a phone with this much memory. So disappointed!!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Phone doesn’t ring and battery life is not what they say it is!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 1, 2019",
            "id": "amzn1.account.AFCXBO4MAWPZPFNZM7DANGFLTJWA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCXBO4MAWPZPFNZM7DANGFLTJWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Best phone ever\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Chinese Tec\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 26, 2019",
            "id": "amzn1.account.AFD4V5IP76ZHG263ZDQKMWUZCSQQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFD4V5IP76ZHG263ZDQKMWUZCSQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If you looking to save koney this is not the phone. I realised after I wasted time and money on this unit. Even after purchase was made there is virtually no one that can help you with return or service. Screen quality is from 90's photos suck, options are a waste. They have marketed the crap out of this phone but do you want to save 200 bucks and end up with usless crap? I assume not, hold on to your Samsung and Apple at least you know where to go if there is an issue.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Waste of money, complete absence of customer service\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 8, 2018",
            "id": "amzn1.account.AHBPBWTA3SXRQPNMK5E56BRUGUJQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHBPBWTA3SXRQPNMK5E56BRUGUJQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I think that 1+ Makes some of the most competitive phones and I've always wanted to have one. I have a few friends with them, and the display was in fact, super immersive. I really like how they do things and hier phones seem as if they've come straight from the future.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The best phones ever.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on July 1, 2019",
            "id": "amzn1.account.AGBUST7TPANQAP2Y3Q2S5YB7KLYA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGBUST7TPANQAP2Y3Q2S5YB7KLYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I was so excited to try OnePlus. I had big hopes for this phone, but sadly it has been a disappointment from day 1.  It first started with the OneSwitch app that's supposed to help migrate your data and files. Didn't work the first time, froze, and I had to restart. But it's ok, I was ready to forgive. Things happen. However, multiple small but really annoying glitches started to come to my attention. First, the wifi connection. After saving the wifi networks I connect at work and at home, I started to realize that when I get to work or when I get back home the phone would not connect automatically and show an interrogation mark in the status bar. To work around that, I had to turn off and turn on the wifi each time in order to properly connect. Annoying right? Customer support told me to wipe my cache, which eventually helped. But man, seriously it felt like having to work my way around Windows XP while I had in hand, supposedly, the latest tech. Second glitch, oh god the most annoying. The screen locks itself at random times for no reason. Imagine to be in the middle of typing a text, browsing online, or worst shooting a video and boom! Magically screen turns black and you have to unlock it to resume what you were doing. I have reported this to OnePlus support. One of their multiple \"John Smith\" or  other \"Philip Smith\" told me to hard reset the phone. Basically go through the process of backing up all of my data, wiping the phone, and reinstalling everything. Is this called \"support\"??? I complained, but another Mr Smith insisted, you need to hard reset. I did, and ah! The issue is still happening. So at this time all of what OnePlus is offering, since they refused me to return this faulty device to get a refund, is to get it repaired. Shipping my phone to them pauses multiple concerns: 1/ I need to wipe my data, I don't want anyone to access it - which means annoyance again. 2/ I will have NO phone for the entire time of the repair. 3/ I have no guarantee that they will successfully repair it since the repair form only allows for 200 characters - not enough to describe all the issues I have. Because hey, I'm not done with glitches. Let's add to the list: when shooting a video, the white balance and exposure varies from a second to another. Meaning that if you are shooting a moving person, or scene, the brightness and color temperature will flicker in the most unpleasant way.  Same with the photos - change the angle slightly and the result will change dramatically - so forget about consistency of exposure and color throughout an event you are shooting. I thought OnePlus had a good camera - well not at all. Another glitch that started today: my phone is on silent, all volume down, even the media output. But, magic again, when I send a text I hear the \"swoosh\" sound notification of the message being sent . But whyyyyy?? I can't stand it anymore. Now I hope I can get it repaired and sell it to someone asap. Anyone interested?\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Waste of money. Full of annoying glitches. Lack of customer support.\n  \n"
        }
    ]
}