{"reviews":[{"author":"Not found","date":"Reviewed in the United States on December 10, 2018","id":"amzn1.account.AHF7QTTV2K7R3TFAXR6VHH6UJNIQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AHF7QTTV2K7R3TFAXR6VHH6UJNIQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":2,"text":"\n\n\n\n\n\n\n\n  \n  \n    I have always been a thought WD was a good brand,Well I bought  2tb this last July to Hold keep that word in mind. Today I brought it out to share some photos that I keep on it for Safe keeping, and it started up just fine, moved 1 picture all is well ,went to move the second one and stop responding. Hmmm. So I restarted it and to my dismay  I hear nothing but click click click coming from the hard drive,not responding,this can't be happening, So I removed and restarted it about 3 times ,finally no clicking..Now I am transferring  over 300 gigs of family pictures and important stuff to my old one for  temp safe keeping..So remember I the word Hold . well this Hard drive was last updated in August . so with today its only been ran 3 times..I am so upset be careful  if you buy this.it could be a fluke or they have downed their quality\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Trouble\n  \n"},{"author":"Not found","date":"Reviewed in the United States on May 6, 2019","id":"amzn1.account.AE4ITYM5F66XFNZIXF6F4GPPW7OQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AE4ITYM5F66XFNZIXF6F4GPPW7OQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    I'm not a Youtuber, or a Video editor, but I am my family's archivalist. I kept all the tapes and pictures from the last three generations. I had about half a dozen multi-GB flash drives, some 64-GB micro SD's, an old 40-GB hard drive, a few dozen DVD-R's for storage, and a 250-GB SSD laptop.This beast gladly put all that gear in one place, looked at me, and laughed saying \"What else you got?\" And by George, I had nothing else. I greatly overestimated my storage needs and underestimated the technological advancements made in mass media storage.Speed wise, I don't know how it compares. I did everything I needed over the course of a couple days. Is there something better out there... maybe, but this was way more than I actually needed. Highly recommended. There's a reason it was an Amazon Pick.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Digital Hoarders Rejoice\n  \n"},{"author":"Not found","date":"Reviewed in the United States on March 1, 2019","id":"amzn1.account.AG5UC37U53BLTJYVLI6WV37AYFNQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AG5UC37U53BLTJYVLI6WV37AYFNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":4,"text":"\n\n\n\n\n\n\n\n  \n  \n    Update: 3-8-2019 4 starWill try to update this after 1 yr.Rcvd replacement very fast. Only used for a few days. It's working as expected. Except it's transfer speeds on a USB 20 is a little bit faster than I expected. Added 1.83 TB of files almost non stop coping in large File folders. Smallest about 50GB & largest 800 GB. I also set my drives on bottle caps for air flow. If you do the same make sure the caps & drive don't slide around..Original review 3 star:Arrived in tact in a bubble bag & rigid cardboard store shelf box. Plug & play add a few GB of movie files to test it. All as expected. (My USB 2 max 50 MBS) it topped out at 34 MBS. Drive is USB 3 backwards compatibile with 2.0PROBLEMS Wouldn't disconnect with Win 7 & Quad core 2.3GHZ.In use light WOULD NOT GO OUT. Even after 10 minutes AFTER PC was shut down..I have 17 USB hard drives Toshiba, And mostly Seagate. They all stop the in use light a few seconds after shut down. Only one drive Won't disconnect from Win 7 (a Seagate refurbished replacement of the newest Seagate drives). The new drive began its rapid demise by not disconnecting..I've returned/exchanged for a new drive same day I received it. Hopefully that was a fluke of mass production. AMAZON RAPID RESHIP NEXT DAY!.AMAZON IS ABSOLUTELY THE BEST RETAILER YOU CAN BUY FROM!\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Had to return exchange/ replacement arrived very fast\n  \n"},{"author":"Not found","date":"Reviewed in the United States on April 8, 2020","id":"amzn1.account.AGR5X32JLZTUVA5NGZOU3RJCGY3Q","link":"https://www.amazon.com/gp/profile/amzn1.account.AGR5X32JLZTUVA5NGZOU3RJCGY3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    My long-time backup drive died after months of agony.  One day, there was the dreaded \"Disk Utility cannot repair\" message.  Ugh!!  So, what to replace it with?  Read a bunch of reviews on Amazon and elsewhere, and decided on this one.  I have a 2011 Mac, so it had to be something that doesn't require a Thunder port, or some other exotic interface.  I'm no computer genius.  Let's get that out there up front.  I wanted something that had sufficient capacity for all the work documents, photos, music, and whatever else, all in one place.  And if it has a small profile?  All the better.Plugged this in and waited... Cannot read disk.  :(  Ok, now what?  Right!  Reformat!  So, I did.  That took a few minutes, then I tried again.  Success!  Click click, and now Time Machine is silently backing up to this new drive.  Perfect!  It takes up almost no space (slightly larger than a deck of playing cards), doesn't use an electrical outlet, doesn't whir and grind next to me (as the former backup disk did), and I'm backed up and ready to go in case of emergency (or the inevitable replacement computer).I've had this now for a couple of weeks, and I can say I'm very pleased.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Almost plug and play for a 2011 Mac desktop!  Excellent!!\n  \n"},{"author":"Not found","date":"Reviewed in the United States on April 14, 2019","id":"amzn1.account.AHNLYH5AIEIEB7TIBQQ66OMQV33A","link":"https://www.amazon.com/gp/profile/amzn1.account.AHNLYH5AIEIEB7TIBQQ66OMQV33A/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    Several Western Digital Passport drives purchased in the past and the reliability made it an easy choice to purchase this Elements WD drive.  It is the same size as the WD Passport drives.  It's the first over 2TB drives owned.  It's great having a greater amount of space rather than multiple smaller drives.  The portability is good as well.  Previous, but not all, WD Passport drives came with a felt carrying case for easy portability along with some protection of the device.  This drive does not come with a protective pouch.  It easily installs and is recognized so no drivers are necessary.  The price was good at the time of purchase.I just wish FedEx or UPS delivered.  Amazon used to have a place or would invite to comment on shipping or packaging.  Since they are hiring anyone to deliver packages I watched the delivery person literally toss the drive from about 8 to 10 ft away onto my porch so I hope this drive doesn't fail as a result of any potential damage.  It arrived in a bubble-wrapped envelope.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Positive results with other Western Digital Portables Made this an Easy Choice\n  \n"},{"author":"Not found","date":"Reviewed in the United States on April 9, 2020","id":"amzn1.account.AGSN2CPGLO53IVJMO36FL5UUTNZA","link":"https://www.amazon.com/gp/profile/amzn1.account.AGSN2CPGLO53IVJMO36FL5UUTNZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    My bad, I replaced a 5 yr old 1 TB Seagate drive in a WD box -with Thunderbolt connection- with this Elements portable drive.  I should have paid more attention to  the USB3 specs and the 5400 rpm drive speed.  If this drive is operating up to it's ratings, it's slooowww relative to what I was used to.  Maybe I can swap the internal disks with the Thunderbolt box.  hmmm.  Time Machine has taken 18 hours to get to the 12% mark encrypting the drive.  Otherwise, I like the drive.  Everything else is great.  It is easily portable, quiet, and nice looking.  Plug and play.Downgrading my rating.  I've never had a problem like this on a modern external drive.  It took 7 days to encrypt this drive through TimeMachine (TM).  The next TM backup (5 gigs) was estimated at 21 hours.  Perhaps the drive is defective?  Perhaps USB 3 is dysfunctionally slow? Perhaps the cache is too small?  Perhaps it's great for single small files but a large file such as the TM file (or Photos files, or Music files, or any other large bundles) are too big?  I really don't know why it's a problem, but this drive simply will not work for me.  I can't imagine that anyone would be happy with these speeds.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    oh my, it seems slow / Update:  IT IS SLOW.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on September 5, 2018","id":"amzn1.account.AEPH6MT522NVW6XPENFUWHGC3CMQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AEPH6MT522NVW6XPENFUWHGC3CMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    Tiny but perfect. Data transfer is fast! Was able to partition the drive so I could use both time machine and store actual files, perfect for a MacBook. I have a 500 GB (ish) MacBook Pro, I partioned for 1 GB for time machine and 1 GB for files I want to either save or just be sure they are easy to access otherwise. Feel comforted that my essential files are saved two ways with the tiny drive. I might buy another one in a bigger size to do it all over again but save the drive in a different place. Also for instructions, when in doubt Google! The instructions are great but there’s always more information out there for you.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    So tiny, love perfect for a laptop.\n  \n"},{"author":"Not found","date":"Reviewed in the United States on December 7, 2018","id":"amzn1.account.AHY3ABKWXE3TXCWG2W5RTOXUNNAQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AHY3ABKWXE3TXCWG2W5RTOXUNNAQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":5,"text":"\n\n\n\n\n\n\n\n  \n  \n    I've had this drive for about 6 weeks now so I've had a good chance to extensively play with it.  Simply put, the drive is gold!  I'm using it to back up over 1000 movies, documentaries, and tv shows from an internal 2.5\" 4TB hard drive in my desktop computer and it's been rock solid.The external matte black plastic case is absolutely beautiful and the chamfered gloss edges on top is a nice touch with a nod to detail. Western Digital has a reputation for reliability and top quality which is the primary reason I purchased this drive but the external case is so attractive I would have be tempted to get this drive just for the case alone.  Luckily, I didn't have to make any compromises here, the drive is both reliable and attractive and the cost very affordable.Final verdict... I highly recommend to anyone who may have a need for a reliable external hard drive with a wink to style.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Reliable External HD with an Eye on Style\n  \n"},{"author":"Not found","date":"Reviewed in the United States on April 4, 2019","id":"amzn1.account.AHMSDMAEU2NBSZX7RYCRPLP7BKVQ","link":"https://www.amazon.com/gp/profile/amzn1.account.AHMSDMAEU2NBSZX7RYCRPLP7BKVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    I received the product on time and the shipping packaging was fine. I opened the package to find the original hard drive box was already opened and the hard drive appeared to be used. The hard drive was loose inside the packaging and there was no user manual. There was a piece of shoddy parchment/packaging paper in there that was crinkled and folded. The wire was shoved in the box next to the hard drive. It appeared as though someone got this, took it out of all the original packaging and then returned it. When I plugged the drive in, it would not register on my computer (windows). I contacted Amazon to see about getting a return and could barely understand the woman on the line. She did not seem to understand that I wanted to return the item and attempted to troubleshoot the item. This would have been fine if the item was new, but it was used and I did not pay for a used item. After about 30 minutes of talking to this woman and going through multiple steps trying to troubleshoot, the line disconnected. The woman could not grasp that the drive was not showing up on my computer, or in the disk manager so we went in circles over and over. I did some research on Google and eventually figured out how to fix the issue. Apparently the drive I had bought, which was supposed to be new, had been formatted for some other computer system. I worked through the process and re-formatted the drive to Windows. Now the drive works fine...The reason for the one star was the crappy customer service and the fact that I received a used item. Thanks Amazon.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Eventually it worked\n  \n"},{"author":"Not found","date":"Reviewed in the United States on March 16, 2020","id":"amzn1.account.AHKJBTBL3ZXTPMECI2SQ7OTOALFA","link":"https://www.amazon.com/gp/profile/amzn1.account.AHKJBTBL3ZXTPMECI2SQ7OTOALFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8","rating":1,"text":"\n\n\n\n\n\n\n\n  \n  \n    I bought this a week ago and I started using it the same day and as I started to download videos and photos onto on the FIRST DAY it started messing up. It would give me a message about the attached device is not working. I contacted amazon twice to try and help me with this issue. I ran diagnostics everything is supposedly “working”. It’s not. Amazon said they won’t an email to WD to help me further and I haven’t received an email from them or a different device. I should have listened to the people who wrote bad reviews on here because they are right. This does not work. Do not waste your money. Find a different hard drive. Do not recommend.\n  \n","title":"\n\n\n\n\n\n\n\n  \n  \n    Horrible hard drive\n  \n"}],"title":"WD 2TB Elements Portable External Hard Drive - USB 3.0 - WDBU6Y0020BBK"}