{
    "reviews": [
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 30, 2019",
            "id": "amzn1.account.AGMWACNMAG74AXBF7IJ22IOZSZPA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGMWACNMAG74AXBF7IJ22IOZSZPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Like iphone 11 Pro, Macbook Pro, Airpad Pro; the \"Pro\" denotes a higher end product.Compared to the Airpods (version 2) highest end model (with wireless charging case*); the Airpods Pro is $50 more MSRP.Compared to the non wireless case version it's $90 more*Airpods Pro does have wireless charging case by default. Only one version.Let's go through the differences1. Physical Appearance:Shorter Stem, but larger bud or headThere's a large black airflow grillA mic inside and outside the AirpodsCase is same thickness, a lot wider, but shorter. Still uses lighting cable to charge, but it does come with a lighting to USB-C cable2. In-ear, instead of on-earIf your ear has a small cavum and the original airpods fit perfectly, then the Airpads Pro may be a tight fit/more uncomfortable, but seeing the in-ear design, the ear piece will go into the ear canal and the rest will float in place.Those with normal or larger cavum it'll fit well.Some may not like the ear piece going into their ear canalThese ear phones are more for a closed environment than an open oneSeeing that it's an in-ear design, you may feel this hollow air effect going on unless you turn on transparency mode (more on this later) or play music with active noise cancelling onSeeing that it's in-ear, it has a tighter grip, better for joggers, those who shake their head around a lot for some reason, or if you run up stairs often. If you have an intense workout regimen and/or do extreme sports and not mindful it still can fall outThere's a Ear Tip Fit Test on app. There's several ear tips in box. When you turn on this feature in app it'll calibrate and suggest what ear tips are best listening experience for youIf you lose the tips or get them dirty overtime, you can go to the Apple store and get replacement pair for around $4 or get cheaper 3rd party ones when they come out3. Squeeze instead of tapInstead of tapping on the earbuds, you are pinching or squeezing the stem.1x to play, pause, and answer calls2x to skip forward tracks3x to skip back tracksPress and hold to switch between active noise cancel and transparency modeStill able to say \"Hey Siri\" to do voice commands/adjust volume anytimeNo physical volume controls on buds4. Battery lifeBattery life varies depending on how far away you are from the device and volume you set. Battery depreciation over time. These are just rough estimatesPro in general has 4.5 listening time with active noise cancelling or transparency on. Airpods version 2 has 5 hours. Note Airpod version 2 does not have active noise cancelling or transparency mode.  You can get 5 hours with noise cancelling and transparency off, but most likely you're not going to unless you're really desperate for batteryPro has 3.5 talk time. Airpods have 3 hoursCase both old 24 hours battery lifePro: 5 mins in case = 1 hour talk or listen time. Airpods 15min in case = 3 hours listen, 2 hours talk5.  Water/sweat resistantNow you can go to the gym and do cardio with them on.As mentioned before, tighter grip seeing that it's in-earMay survive light rain. Do not recommended going in the shower or dunk in the pool with it though 6. Active noise cancellation, Transparency modeAirpods pro has 3 modes: Active noise cancellation, off and Transparency modeActive nose cancellation tries to block out outside noise while listening to music. I'd say it drowns out may 70%. If you focus to outside or aren't focused to music; you still may be able to pick out what's going on, but in general it does it's job.Off is just like the standard in-ear headphones, but with the hollow air sound when no music is playingTransparency mode. The black airflow grills let in outside sound so you're able to hear both outside sound and music same time. Think of it as open ear headsets.Unlike some in-ear headsets the black airflow grills prevent you from hearing yourself in your head when you talk7. Sound QualityBetter than the previous version seeing the active noise cancelling and in-ear with more focused sound direcly into your ear canal. It's not $250 audiophile quality sound.  Better quality sound in lows and mids compared to non-pro version. If you ever tried the Power Beats Pro, it sound very similar to thoseYou can hear callers better in a noisy environment and less likely raise your voice--Conclusion:Other than that, all other features are the same. Meant to be used on Apple devices. Very good ease of use for Apple users, and is in-style these days (shows social status). Sound quality is better that the non-PRO version, and you do get noise cancellation. There are other headphones that do it better sound in this price range, but may not be as convenient with pairing to Apple devices.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    List of Features/Changes compared to Airpods (v2)\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 11, 2019",
            "id": "amzn1.account.AEEUMZI5G3NOLDSOPGCRXZGP24WQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEEUMZI5G3NOLDSOPGCRXZGP24WQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n     Edit after 1 month:This  is popular in North America, and wearing it has become a fashion. I think it is the best electronic product after iPhone and Echo in the past 10 years.iPhone 4 Steve Jobs 2010Echo Jeff Bezos 2014Airpods Pro Tim Cook 20191. It is suitable for sports enthusiasts. Airpods Pro has a new anti-sweat function, so you don't have to worry about sweat damaging the headphones during exercise. Noise reduction function can isolate external sounds, so you can enjoy music at the same time2. Battery life. I tested the battery box for about 16 hours, and the headset has less than 5 hours. The noise reduction function may consume more power.3. It's not suitable for sleeping. When you wake up, you may find headphones everywhere. In addition, when the power is off, the beep is very annoying. It is recommended that friends who want to sleep use sleep earplugs.4, I found that the low-frequency sound quality will be more impactful and fuller than Airpods 2, but the overall sound quality is not much different from Airpods2Old review:I give this product 4 stars. I got this product before Black Friday and have been using it for 10 days. Here is my experience using headphonesAppearance: 3 stars1.The surface feel is the same as the previous two generations, and it is easy to scratch. It is recommended to buy a third-party protective case or a charging case with a protective case.2.Portability personally feels better than the previous two generations, because the appearance is flatter and the earstems are shorter3. There are three sizes of earbuds. The default is medium size. The little ears are still a bit painful after wearing them for a long time. Changing the trumpet is much better. The silicone sleeve is not easy to remove and replace. In addition, the silicone of the earphones is a bit smelly.4. Uneven gaps are found in the charging case. I don't think there should be any problems with the workmanship of the product at this price, so the appearance is only 3 stars.Comfort: 4 stars1. In-ear AirPods Pro is not as comfortable as non-in-ear AirPods.2. At present, it has been about 40 hours with earphones. It is said that there are stomata to regulate air pressure, so there will be no pressure in the ear for a long time. Ear pressure balance is better than Bose3. AirPods Pro will have better air tightness to the ears. Sony WH1000XM3 will have some air leakage, but Sony WH1000XM3 is a headphone. Among in-ear active noise cancelling headphones, AirPods Pro may be the smallest and integrated The highest degree and the most complete function4, running without worrying about falling, squat without worrying about pressing the neck. Its presence is much stronger than AirPods. You ca n’t expect to wear it for a long time like AirPods before. You will forget its existence. In fact, it will always support your ears to remind you of its existence. One advantage is that compared to AirPods, AirPods Pro is stronger and harder to drop. For sports-loving users, AirPods Pro will be more suitable for you.5 stars1. Active noise reduction is the biggest difference between Pro and AirPods 2. AirPods Pro has three noise reduction modes, namely noise reduction on, off, and transparent mode. The official said that Apple ’s innovation in transparent mode, but I see other brands (Samsung, Sony) The headset also has a similar function.2, AirPods Pro's noise reduction is not as good as Sony WH1000XM3 on-ear noise reduction headphones, but it is the best among real wireless headphones. As for how to achieve such an obvious noise reduction effect in such a small volume, I don't understand. The intuitive feeling is that the noise reduction effect is obvious.3, I can feel quite quiet on the road, so it is strongly recommended to use noise reduction off or transparent mode on the road.Sound quality 4 starsThe AirPods Pro's sound quality has not been significantly improved compared to the previous generation of AirPodsSummary: This is an excellent headset. If you value the noise reduction function more, it is suitable for you. But if you are more concerned about the sound quality and have no need for noise reduction, I suggest you buy AirPods 2, because AirPods 2 is cheaper. In addition, the charging box and headphones must not be lost, the official charging box and headphones accessories are expensive\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    This is good\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 31, 2019",
            "id": "amzn1.account.AEWJAJGFSH3O3EWPUD3H7PW2WWUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEWJAJGFSH3O3EWPUD3H7PW2WWUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    With the new transparency mode, I can listen to music knowing that I will never be ran over by a car on the street again. Another W for Tim Cook and the boys\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Saved my marriage\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 30, 2019",
            "id": "amzn1.account.AGJCHWGCZOBETEYAGU2XVYYQDIIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGJCHWGCZOBETEYAGU2XVYYQDIIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    They fire\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Lit\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AGNJH2WW6KJ7RKYR2WJW7LHL5ZOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGNJH2WW6KJ7RKYR2WJW7LHL5ZOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Love Apple products but I’m tired of their gamesWith the iPhone 11 they introduced the new charging end (not the one that goes into the phone, the one that plugs into the cube then into the receptacle).The AirPods pro comes with the same cable but no cube. This means if you don’t have an iPhone product you can’t charge these period. And the charging wire it comes with is worthless unless you’ve already bought an iPhone 11Apple charges a ridiculous premium for their products. They should back it with the proper hardware\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Apple forgot to pack a few components\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AGFCWLZJ44WVNWEU4XI6IMVL26TA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGFCWLZJ44WVNWEU4XI6IMVL26TA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These earphones are top of the line.Here are some Highlighted FeaturesThey HaveIPX4 rated to resist sweat and water, making them ideal for sports and exercise.Internally tapered tips conform to your ear shape while vents help equalize pressure for maximum comfort.Active Noise Cancellation continuously adapts to the geometry of your ear and the fit of the eartips to keep you isolated from the world around you.Press and hold the force sensor on the stem to switch between Active Noise Cancellation and Transparency Mode, which allows outside sound in to keep you aware of your environment.Expanded mesh microphone port increases call clarity in windy locations.H1 headphone chip features 10 audio cores for low processing latency and real-time noise cancellation.Bluetooth 5.0 for reliable, high-quality reception.Automatically on, automatically connected.Voice-enabled access to Siri.Audio Sharing enables you and a friend to enjoy the same song or movie by simply bringing a second pair of AirPods close to your iPhone or iPad.More than 24-hour battery life with charging case\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Authentic and Beautiful, Love these way more than ever expected They are Great earphones\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AE52QV7N2YNGS2QRPJ6I3PH7SZBQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE52QV7N2YNGS2QRPJ6I3PH7SZBQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Wow! I never liked the original air pods. They always fell off. I’m so glad Apple came out with these and that I waited to splurge on headphones. The sound is beautiful, the fit is perfect. I literally just got these out the box and I fell in love! I have always been an Apple product lover. Well worth the wait!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    WOW\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AHNAZSRNGYRJZN7F6MZW4RHKU6BA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHNAZSRNGYRJZN7F6MZW4RHKU6BA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So I will say I'm never wearing my bose 700's out in public (other than planes and other modes of transport that are too loud for the small in ear noise cancelation the Airpods pro have) there just too bulky and, but these new airpods are just so sleek and convenient, I'm an audio nerd if you want convenience these are probably the best buds to buy right now. Obviously sound could be better but for what you get I'd say it's worth every penny.Seif Afyouni.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Pro\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 1, 2019",
            "id": "amzn1.account.AEFCCBQ2CF67OC4YWMNYSRCNRTMQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEFCCBQ2CF67OC4YWMNYSRCNRTMQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    They feel a lot snugger, 100% worth it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Definitely worth the upgrade\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 13, 2019",
            "id": "amzn1.account.AFHMFEAOLUHAAV4YBV3FPJTRHRFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFHMFEAOLUHAAV4YBV3FPJTRHRFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I’m gonna start off saying that the noise canceling is amazing ide rate 10/10. Where the problem is is after wear for 3 minutes it begins to hurt my ears dramatically. I tried every tip and none of them work. It seems to be the design of the earbud itself. I’ve personally loved all of apples products but I think they should have worked a little harder on this one. I’ve done research and I’m not the only one experiencing pain. There is thousands who say the same thing. The original AirPods are great and feel amazing in my ears where sometimes I forget I’m wearing them. If you have normal AirPods I would say your better off just using them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Hurt really bad. DO NOT BUY\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 6, 2019",
            "id": "amzn1.account.AHE2RQ7CI5LKXKL5JPNNC45VG7BA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHE2RQ7CI5LKXKL5JPNNC45VG7BA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Received my AirPods Pro a couple of days ago and have been using them day and night since. I also have the new Bose 700's, which I've been using daily for a couple of months so I'll compare to them.I commute each day on a noisy city bus. Sometimes there are people talking and sometimes there's nothing but the loud noises of the bus. The Bose headphones are not sweat or weatherproof, and so are not useful outside unless the skies are clear. With winter coming, the Bose also prevent wearing a winter hat, so I decided to buy the Air Pods for use in commuting and then use the Bose once I get to my desk at work.I have never owned AirPods before. A friend at work has regular AirPods (not Pro), and the photo attached to my review shows the difference in size. These were easy to set up -- you just hold your unlocked iPhone a couple inches away from the AirPods in their charging case (with the case open). It's all seamless. They automatically showed up in my Macbook bluetooth menu once connected with the iPhone, so all I had to do was click \"connect\" in the bluetooth menu.Interestingly, the play/pause squeeze of the stem doesn't seem to work for controlling the laptop -- maybe it only works for Apple Music, which I don't use so I didn't test. And the other thing different -- and worse -- than the Bose is that if I pause on the laptop and then play again on the phone, the AirPods are not automatically connected and the music came out of the phone directly. The Bose connects to two devices at once so it will play whichever one is playing sounds (which can be annoying if the phone is playing and the computer gives a notification sound or vice versa). But in order to play again on the phone, I had to go into the phone Bluetooth menu and reconnect (not re-pair, just reconnect). So my conclusion is you have to manually reconnect for device switching. You get a little alert sound when connected -- no voice, no battery status, no \"connected to xxx\" like the Bose does -- nothing else.For music quality, the Bose quality is a fair amount better -- which would be expected since they are full size over the ear headphones. The AirPods Pro are still very good though, and unless you are an audiophile, you won't be disappointed.Charging the AirPods case uses a standard iPhone/iPad lightning charger. It comes with a cable that will connect to a later model Macbook USB C port -- so USB C to lightning. If you want to use an outlet, you will need to have an existing lightning charger, which most of us have plenty of anyway. It's hard to tell when the case is completely charged. The orange light comes on but goes off after just a few seconds, instead of just staying on and changing to green once they're fully charged. The first night I got them, I charged them in the case overnight before using them. When I connected them, they said the AirPods were only 58% charged, so I'm not sure why they weren't 100% if left in there overnight.There is a nice new longpress feature on the volume of the iPhone that appears when the AirPods are connected to the iPhone. You can control the volume (you can't control the volume right on the AirPods, which is a slight bummer but it's okay) and noise cancelling from this new interface.There's no tapping on these AirPods -- you slightly squeeze the little stem. There is a soft click when it registers, almost like pressing a touch pad. It took a few seconds to figure out how to do it, but it's been fine since. A longer squeeze toggles between the noise cancellation modes. There's a slightly different sound for going into transparency mode and going into noise cancellation mode, but in a quiet room it's hard to tell which mode you're in, as opposed to the Bose, which literally tells you in a voice.Transparency mode uses microphones to let in the sound around you, so that you can keep them in while still talking to people. This is how they differ from noise isolating earbuds, which block your ear from hearing anything but don't have active noise canceling. These have noise canceling I'll talk about in a minute. But there is also an \"off\" mode available only (that I've found) through the volume long press described above. These just put them in basic noise isolation mode -- I'm guessing similar to previous AirPods.For noise cancellation, they are surprisingly very effective. More effective than I thought they would be. They are best at blocking out white noise -- bus engines, office sounds, fans, etc. They are good at voices if it's just people talking in a group at a normal volume. But when I walked through the busy office cafeteria at lunch time, they did not do as good of a job as the Bose at blocking out the loud talking and other uneven cafeteria noises. Interestingly, they do a great job at blocking one-off noises like a door slamming or someone dropping something. The Bose have a hard time with sounds like that for some reason. I would say they are 80-90% as effective as the full size over ear Bose overall, which is very impressive.For comfort, obviously the Bose are better (and sound better) for hours of desk usage, and also given that the battery on the Bose is about 19 hours and these are about 4, the Bose will be what I use all day at my desk. But for moving around, walking the dogs, commuting, and portability, the AirPods are terrific and don't hurt at all or cause my ears to sweat like the Bose do after a while.Would definitely recommend.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Excellent all around earbuds\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 12, 2019",
            "id": "amzn1.account.AFTPN5DGPASVNUIDR5LQWGK5H7XA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFTPN5DGPASVNUIDR5LQWGK5H7XA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So, they don’t come with a charging cable that can actually be used—so don’t forget to buy one. That kind of sucks. Since I can’t use them, overall review... yeah... 1 star. 🤷🏽‍♂️\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Okay Apple\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 14, 2019",
            "id": "amzn1.account.AEPJVQ37KZ3TNFTUR5LNTHLTIGFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEPJVQ37KZ3TNFTUR5LNTHLTIGFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Looks like a knock-off. The touch functionality doesn't work at all and the box didn't even come with a wall adapter and I paid almost $300 for this?UPDATE - right airpod stopped working. 100% a knock-off. DO NOT BUY.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not worth it\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 3, 2019",
            "id": "amzn1.account.AGDMOJWE7YH3ACQN7KAYSHSZUV2Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGDMOJWE7YH3ACQN7KAYSHSZUV2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Not worth the money. New  Features are not worth the difference from AirPods . WAit till they come in different  colors\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not worth it .\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 18, 2019",
            "id": "amzn1.account.AGP55FO5UGJWQW522R52R6UCPQEQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGP55FO5UGJWQW522R52R6UCPQEQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I thought they were pretty nice at first. Sound quality is good. They charged quick in the case. But transparency mode amplified sounds like crazy. At the gym someone was moving weights, the cling of them hitting was so loud it hurt my ears. When I took the airpods out it was much quieter in real life. Even in noise cancelling mode they pick up voices and then they end up sounding robotic. There's a white noise in the background too. It's like a little static, annoying as hell.Just now I started hearing a popping noise in the right bud. It kept happening even when the music was off. When I turned to transparency mode that popping became a buzz.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Expensive garbage\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 10, 2019",
            "id": "amzn1.account.AGEETAL3QMMEJ63UCMUDMP4IP2PA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGEETAL3QMMEJ63UCMUDMP4IP2PA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Apple AirPods Pro is one of the best noice cancelling in-ear headphones available in market. Price is on the upper end but the quality is also on the upper side compared to other models.I have QC35 and the noise canceling is comparatively good but being in-ear, the listening experience is much better.The transparency mode is awesome. It is like you NEVER wore the headphones. You have to try to experience it. I use it all the time in car and it is true “your gasoline car sounds like an electric car”.Fit is snug and with extra tips, most of the people can get accurate fit. Make sure to run sound seal test from Bluetooth setting of AirPods.Each earpiece is about 1.25 inch, little shorter than earlier versions but they still stuck out of your ear and look little weird.Out of box, it comes with Airpods with wireless charging case, extra tips and USB-C to lightning cable. Note that it does not come with charging brick which is a bummer. But you can charge it with any other lightning connectors.Overall these are pretty decent noice cancelling headphones. Price is on the upper end, but I think quality is also on the upper side and I do think these are worth it. Would definitely recommend.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Transparency mode is game changer\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 26, 2019",
            "id": "amzn1.account.AHZUSHOMR3B6HGWA4E2FQFUXBRBQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHZUSHOMR3B6HGWA4E2FQFUXBRBQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If you’re thinking about these and currently own the original style of AirPods, please check out my review below!Are these a replacement to the original AirPods? Not necessarily. I own these and two original style AirPods. I am an Apple fan girl and own one of everything they’ve got. But even then, I’m on the fence about the Pro’s. First off...Comfort and FitIf you’ve ever tried out the PowerBeats by Dre, they fit just like them minus that extra ear anchor. It takes some getting used to but thanks to transparency mode, I don’t think I could really wear another pair of IEMs / earbuds again. They 100% will not make you feel like your ears are clogged and not can you hear your own voice as one would with earbuds.However, I’m hung up on the fit. I was one of the lucky few who the original AirPods fit just right. However, these just hurt after 20-30 minutes. I tried all the different sizes  of ear tips but none work. Ultimately, I wish Apple included foam versions of their ear tips. So be warned that these might hurt! Assuming they don’t hurt, then...Sound QualityThe sound quality is great. It’s nice and clear, balanced and at times not packing the bass I was possibly expecting. The HomePod has a very, very strong bass signature and I thought these would be similar. But, nope! When third party foam air tips come out, I’m pretty sure that will help the bass out. (Bass needs a good seal when it comes to earbuds.)Are these better than the original AirPods? Maybe. Because of that seal from the ear tips, the sound quality is drastically improved. With third party ear tips, the original AirPods sound pretty similar to these. I do appreciate the dynamic EQ which helps the sound a lot. But, be warned that they will sound like garbage if you have an EQ set in Apple Music on your iPhone. Make sure to set it to off or Late Night, otherwise they’ll sound a lot worse! Ultimately, you won’t be disappointed and they sound great, better than the originals because of that sound seal, but not mind blowing!Battery LifeThey’re pretty in par with the original AirPods with battery life even with Transparency and noise cancellation on. You can go all day with these just like the originals!SpeedThis is what I love about them the most! This is the reason why I prefer these over the original AirPods. The Pro’s are so much snappier with Handoff, switching from device to device, pausing and restarting, etc. They also more accurately get picked up by your iPhone and Apple Watch. I really wish they would upgrade the hardware in the original design just like these. (We’ll see!) also, the Pro’s more intelligently go on standby when out of your ear, resume faster when they go in your ear, etc. They just do everything faster! I also appreciate the fact that you pinch the stem instead of tapping them. Whoever thought of tapping didn’t realize how uncomfortable that “gesture” would be in practical usage.OverallI love them but they’re like the cousins of the original AirPods. They’re not a replacement but a different flavor. These are great for working out and stay in my ears during running. The new features and speed in combination with the improved sound delivery makes them an easy upgrade — so long as you find them comfortable, that is!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    AirPods vs AirPod Pro Review: My experiences\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 28, 2019",
            "id": "amzn1.account.AEOGAKEQIATAMQ7RCVNW4CGJGARQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEOGAKEQIATAMQ7RCVNW4CGJGARQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    1 of them only lasted 3 days and then this happened. Call support and they said to return them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Red Exclamation Already\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 11, 2019",
            "id": "amzn1.account.AHVOCIW7FIHM2V6PCWLE2WRNIIRQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHVOCIW7FIHM2V6PCWLE2WRNIIRQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Charging box came broken, visible dent and damaged hinge...quality control questionable.Actual working life on one charge not impressive, not practical to carry charging box around....if You need to use them, product has quality sound and very good noise cancellation with pretty short life - 4 hrs new.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Check the charge box for cracks and damage.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 21, 2019",
            "id": "amzn1.account.AG7ZQ3VY3HTTNDGWKMDECIVXEM3Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG7ZQ3VY3HTTNDGWKMDECIVXEM3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So uncomfortable to wear... to make the noise canceling effective I have to shove the rubber tip into my ear which starts to hurt my hear. I have to sit absolutely still otherwise they begin to lose the seal required to get ANC. I have tried all 3 sizes too. They fall out of my ear in the gym. People are just high on apple.Sound quality is laughable. The most over hyped piece of garbage.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    So uncomfortable, Sounds quality = Garbage... Over Hyped Trash\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AFNCZ7VLDGFIY6VPZSC6DRPGP5XA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFNCZ7VLDGFIY6VPZSC6DRPGP5XA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Apple hit a home run with these... I wanted the original AirPods but couldn't get them to fit in my ear. I have tried other true wireless earbuds and never liked the look or fit of them. With the AirPods Pro, Apple has answered my prayers, and they're even better than I could have imagined. The sound cancellation is LEGIT. I own the Bose 700 noise canceling headphones and while they're not as good at noise cancellation as those, I'm blown away by how close it is.The sound quality as well sounds very good to me. I'm by no means an audiophile but I'm a little picky as far as this goes and I'm more than pleased.The ability to switch from noise canceling to transparency mode is awesome as well.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Amazing product!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 10, 2019",
            "id": "amzn1.account.AHKXLTEATGMETEUXQYT7ZX34BCGQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHKXLTEATGMETEUXQYT7ZX34BCGQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really like the old air pods and have bought a few for my family, also used them everyday for 8+ hours straight  without any problem. Although the new air pods pro cost more and sounds great with some extra features, I don't think it's for me. If I use it for less than two hours or so there won't be any problems as it preforms very well. The main problem is that if I wear them for over 2+ hours they start to hurt both my ear which is weird because the older models \"wired/wireless\" I have no problem with while they are in my ear all day long. \"I have tried changing the rubber from large to small still doesn't help.\" It seems like the new design are a little thicker than the older generations. Also a minor problem I have is taking them out which doesn't bother that much. So I would advise testing them out at least 2-4 hours to see if they are for you before keeping it. Overall they look and sounds great.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Honest review. I prefer the older version...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 5, 2019",
            "id": "amzn1.account.AGBCFGJEVGBD7XBKKWYP5RV4DTQA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGBCFGJEVGBD7XBKKWYP5RV4DTQA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    When I thought the old Airpods were already very good, Apple came out with something that's even significantly better.Pros:- Fits: very well. The old Airpods fit my ear well, these new ones fit even better. My ears do not get hurt after hours of wearing. And these do not even come close to falling out when I run.- Noise cancellation and transparency mode: both work amazingly.- Waterproof. However these are only splash proof. Meaning rain/spills/sweat are ok, but no swimming yet.- Sound quality: very decent. But probably not too insane to satisfy audiophiles.- Build quality: superior, as expected from Apple. Especially when consider small details like the silicon eartips. They snap extremely well into the Airpods and are very, very hard to remove.- Sync: very well with iPhone and Mac, as expected from Apple. Have not tested with Android, Windows.- Size: very conveniently small. You can easily wear them lying down in bed. Traveling case is also pretty small (just a tad bigger than old Airpods' case)- Design: this is very subjective. But I think the Airpods are the best looking earbuds in the market right now. Big reason why I choose them over other headphones.Cons:- Battery life: they're ok, I wish they last longer. Quote from Apple, battery lasts up to 4 hours 30 minutes of music time. In reality it lasts a bit more than 4 hours. But sometimes I wear them continuously way longer than that. Very sad.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Pretty much perfect\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 25, 2019",
            "id": "amzn1.account.AHCGATO3VVLHMK446NSV5WJT4GGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHCGATO3VVLHMK446NSV5WJT4GGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I watched all YouTube videos, reviews, unboxing, and find this perfect price on Amazon, but after using 1-2 hours i keep moving AirPods because its Really hurts my ear canal and inside of ear, i keep feel the pain even after i took them off. I owned Airpods 1, which i sometimes  forget that I’m wearing  on. Long story short - I end up returning. I don’t want talk about sound quality, noise cancellation and another features, because you are going to get ear fatigue after 1 hour.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It really hurts\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 18, 2019",
            "id": "amzn1.account.AFRS7UFNAE4VKUMH4GMMBIUJ4EYQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFRS7UFNAE4VKUMH4GMMBIUJ4EYQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Sound quality and the noise cancelation feature are decent, nothing like Bose though. My main issue is the fit. They just fling out randomly while you are on the go or working out. I have tried all of the different ear buds provided by Apple but in vain. The price is very high compared to what you get. There are better options in the market for this price.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Disappointed\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AGXTE27LO65HN3TSSTCZR524UXTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGXTE27LO65HN3TSSTCZR524UXTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Sound isolation and water resistance are my favorite features! Was super blown away by how it silences a lot of the noise around me until transparency mode is active!If you want louder headphones than the previous, these are definitely NOT it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    LOVE THEM\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 13, 2019",
            "id": "amzn1.account.AFVFF5W7FFYMCMIQWCNSH4HSMRGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFVFF5W7FFYMCMIQWCNSH4HSMRGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    For me the earbuds wouldn't stay in my ears. Sound was good. My bad review is with Amazon and returning the airpods pro.The item was returned, but never updated on my account. They said I didn't return item and then I called and chatted andI have never had this bad experience with Amazon and returning something. I was told when we get your item we will refund you in two weeks. UPS tracking shows they received the item already.I spoke to a rep who was very disrespectful and was supposed to be a supervisor.I am canceling my Prime Membership.  I wish Amazon would hire more first level CSR's\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Worse product I have ever ordered from Amazon as a Prime Member\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 21, 2019",
            "id": "amzn1.account.AGC5O5MD2VX45OPZARRNELA4SWGQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGC5O5MD2VX45OPZARRNELA4SWGQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really wanted to love these but they simply do not stay in the ear. Tried all three tip sizes and no luck. The sound and noise cancelation is good but so far this is useless to me.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Do not stay in the ear longer than 1 minute.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 8, 2019",
            "id": "amzn1.account.AECCHVGLOW2FJ5LBQRFRA5GNYLTA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AECCHVGLOW2FJ5LBQRFRA5GNYLTA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Pairs immediately with nice controls. Did not keep long enough to evaluate battery life. Problem is the sound quality is OK, but not what you'd expect for $250. The first generation airpod sound quality is EXCELLENT. The second generation was terrible. Now this third generation is better then the second generation, but nowhere near as good as the first generation. I returned this third generation and went back and bought two used first generation airpods while they are still available. I figure there might never be another airpod that matches it.Also, the noise cancellation is worthless. This is not too surprising. It's really hard to do any serious noise cancellation without over-the-ear coverage.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Poor sound quality relative to first generation airpods\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 16, 2019",
            "id": "amzn1.account.AFWDSRC3QQRBFPWFH6UWS7ZF4EYA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFWDSRC3QQRBFPWFH6UWS7ZF4EYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    As a big fan of technology, I own Apple AirPods 1,2, AirPods pro, beats studio3 and couple other headphones. And AirPods pro is definitely one of my favorite.Pros:• It is very easy to get into and stay in my ear. It won’t fall out. Also it is much more comfortable than Powerbeats pro.• The ANC works surprisingly well. It is very similar to my beats studio 3. It is amazing how Apple fits everything Into such a small body.• The bass is better than AirPods 1 and 2. It feels more bouncy.Cons:• Since AirPods pro doesn’t support tap control any more. 2 fingers are required to pause or to control the AirPods, which IMO is not as good as tap control.Overall, it is good although a little pricy.Update:After using it for couple months, I have to say I was wrong about not falling off. Sometimes they do fall off. And AirPods 1 and 2 stay better in my ear.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    I love this little AirPods pro\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 15, 2019",
            "id": "amzn1.account.AFKGGAQZ3DOIHWIFZDQCDSPUXUUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFKGGAQZ3DOIHWIFZDQCDSPUXUUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I'm sorry I bought the new AirPods Pro.  I have owned the original AirPods for years.  I wore the originals almost constantly and honestly can only remember once that they came out of my ear.  I just never worried about them.  This is NOT the case with the new Pro.  They fall out of my ear everyday and many time more than once a day.  I mean you bend over to pick something up and they are likely to fall out.  I have tried all three ear bud sizes that come with the Pro, and while the new design looks like it would be better beware, they fall out!  Sick with the original AirPods!The sound of the Pro is great!  The new noise cancelation is excellent.  The battery life seems to be a bit better than the original and I really like the ability to pause the playback by touching the Pro.  (If only they stayed in my ear! )\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Airpods Pro Falls Out!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 3, 2019",
            "id": "amzn1.account.AEL2A3OGS37H4ICWW4B4MF6UXDGA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEL2A3OGS37H4ICWW4B4MF6UXDGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Best earbuds I’ve ever purchased. For years I wanted wireless noice canceling earbuds after using the beats studios and Bose qc lines. Being an iPhone user I always saw the appeal of AirPods but never could use them due to them not fitting my ear correctly and always falling out. As soon as I saw the design of the AirPods pro I instantly came to amazon and ordered them. If you’re at all contemplating on ordering these I 100% recommend. The noice cancelling is slightly above average and the transparency mode is extremely useful on the go or whenever you need to hear your surroundings with your music. Amazing product definitely worth the steep 250 dollars\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Simply Amazing\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 4, 2019",
            "id": "amzn1.account.AHCFZ7IIBN52JZE3KBM3THTPENGQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHCFZ7IIBN52JZE3KBM3THTPENGQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    It’s a little hard to know what is good or bad about my new $250 airpods because they do not come with a way to charge, you have to go out and buy some adapter or a charging pad.  I cannot believe they sell you a device, includes a wire but not plug.  Ridiculous.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    No way to charge right out of the box\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 4, 2020",
            "id": "amzn1.account.AGW2L534MSSS4NJ64PZDBP43TULQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGW2L534MSSS4NJ64PZDBP43TULQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought a pair of these after Xmas. It took over a week to get here but I thought ok they are from Warehouse and its worth it. Maybe someone got them as a gift and returned them new. It was described \"like new\". When I paired them with my phone only the right ear of the AirPods worked. The left ear barely displayed sound. It was defective.This is the 2nd time I have bought Apple products from amazon that were problematic. That were \"inspected\". Just buy from Apple. They have a great return policy and if they are \"refurbished\" from Apple- the quality is the same as a new product. Whereas here if you buy from the Amazon Warehouse- most likely they have an issue.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Do not buy from Amazon Warehouse any Apple products!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 29, 2019",
            "id": "amzn1.account.AEPOVRSOCS7GMVGS4LMKFMQN5SBA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEPOVRSOCS7GMVGS4LMKFMQN5SBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n     La caja me llegò vació\n  \n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n    Caja vacía\n  \n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 14, 2019",
            "id": "amzn1.account.AGMWTTN7YSN77IZU3POAOCIJKS6A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGMWTTN7YSN77IZU3POAOCIJKS6A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I was very excited to try the new Airpods Pro, but unfortunately they are not for me. The main issue was the active noise cancellation (ANC). These were the first pair of ANC headphones I've owned, and it seems that I am in the minority of people who experience a strong negative reaction to ANC. Within moments of turning it on, I experienced head pressure, mild headache, and mild nausea. If you have never used ANC headphones before, be aware that the experience may not be as comfortable or magical as other say. Here is a breakdown of my thoughts on these Airpods:The Good:Fit: The fit was very comfortable and secure. I haven't tried the regular Airpods, but these fit great and seem very secure.Size: Both the Airpods and the charging case are compact and very portable. I have a pair of Bose Soundsport Free headphones and the charging case is at least 3 times larger than these.The mediocre:Sound: Based on reviews, I expected these to sound better. In fact, I thought they sounded worse with ANC on than off. Overall, I think my 2-year-old Bose Soundsports sound better, which is maybe not surprising but a bit disappointing given the price for these.The bad:ANC: Your mileage may vary, but I found using ANC a profoundly uncomfortable experience. I also felt like it did not cancel much more noise than having it off. Both of these factors negate one of the main selling points for these Airpods.Color: The Airpods and the case are dirt magnets. Even using them for less than a day, they were already picking up lots of dirt. I can't see keeping these clean in the long run.Overall: If ANC worked better for me, I could overlook the other shortcomings of these earbuds. As it is, I'll be sticking with my Bose Soundsports and sending these back.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Active Noise Cancellation Not For Me\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 14, 2019",
            "id": "amzn1.account.AFB3AJNXDVYLXDMVI5BGSEW5T5ZA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFB3AJNXDVYLXDMVI5BGSEW5T5ZA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really wanted to like these. I thought the audio quality of the original AirPods was great, especially if you held them snug in your ear. With the new design, I was hoping the seal would produce the same effect, ensuring high quality sound under all conditions. While they are comfortable and have excellent noise cancellation, I would almost go as far to say the sound quality is the same or worse than the original model. Maybe mine were defective; but, all of my music sounded crisp on the high end and peripherals, while feeling completely empty in the center. It is almost like Apple included an artificial surround enhancer or DSP, by default. Regardless, with the $250 price tag, I was told to expect better. Yes, there are new features and a new design; they are pretty and interface seamlessly with your iPhone. However, if sound quality is your primary concern, I would look elsewhere, or stick with what you have.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Audio Quality, ehhh\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 3, 2019",
            "id": "amzn1.account.AHAPVOPGQ3UJZ7L4MDYYQVVQYKKQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHAPVOPGQ3UJZ7L4MDYYQVVQYKKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    As someone who can’t use standard AirPods because they hurt my ears, I’ve been thrilled so far with the AirPods Pro. The adjustable fit is great and they are very comfortable. Sound is incredible considering their small size (even smaller than the standard AirPods!). I’ve tried lots of competitors such as the Jabra Elite 65’s but these are smaller, better, and more seamless than anything I’ve tried. Very happy so far\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Finally a perfect fit\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 16, 2019",
            "id": "amzn1.account.AHXAP7R7YWVOBAWV6B6W66BRNQDA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHXAP7R7YWVOBAWV6B6W66BRNQDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    they do not fit in my ear even with the smallest size ear piece they are still to large. Surprised apple put a product out like this.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    THEY DO NOT FIT\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 4, 2019",
            "id": "amzn1.account.AGZQZQVTGCCTYCV4FMGRPL5X67AA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGZQZQVTGCCTYCV4FMGRPL5X67AA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Enjoy immersive sound and optimal comfort with the Apple AirPods Pro with Wireless Charging Case, sweat- and water-resistant wireless Bluetooth earphones that use optical sensors and a motion accelerometer to detect when they're in your ears. The all-new, lightweight, in-ear design boasts a customizable fit while providing complete sonic performance. Use Active Noise Cancellation to keep you focused on enjoying your content, or switch to Transparency Mode to stay aware of what's going on in the environment around you.To ensure a rewarding listening experience, the AirPods Pro utilize Adaptive EQ to automatically sculpt the tonal output to suit your unique ear shape. Their custom high-excursion drivers and high dynamic range amplifiers deliver clear, detailed sound with bass down to 20 Hz, all while keeping distortion low and upholding extended battery life. The flexible silicone eartips come in three sizes and advanced algorithms allow the AirPods Pro to analyze the fit and let you know if the current eartip size is giving the ideal seal.Following a single-tap setup, these AirPods automatically turn on and maintain their connection to your iPhone, Apple Watch, iPad, or Mac computer; forget having to manually engage or disengage power. Enjoy music, answer calls, or communicate with Siri on your mobile device without having to pull out your iPhone.These AirPods automatically play audio as soon as you put them in your ears and pause when you take them out. A simple double-tap during music listening will skip forward. To adjust the volume, change the song, make a call, or even get directions, just say \"Hey Siri\" to activate your favorite personal assistant. Plus, when you're on a call or talking to Siri, an additional accelerometer works with dual beamforming microphones to filter out background noise and ensure that your voice is transmitted with clarity and consistency.Additionally, they deliver five hours of listening time on a single charge—or 4.5 hours of listening time in Active Noise Cancellation mode, and they're made to keep up with you thanks to a wireless charging case that holds multiple additional charges for more than 24 hours of listening time or over 18 hours of talk time. Just 5 minutes in the case gives you approximately one hour of listening time. Charge the case via a Lightning connector or take advantage of its compatibility with Qi mats (available separately) for true wireless charging.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Works wonders\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 4, 2019",
            "id": "amzn1.account.AHJU7QCHW46YS2V2G3IXORHP45TQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHJU7QCHW46YS2V2G3IXORHP45TQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I wish I could give more than five stars. I’m a very picky person when it comes to what sounds are flooding my ears and I tell you, I’ve owned Bose and thought those were the game changers. I was more than pleasantly surprised at how these sound and fit. I’ve never used any Apple products in my ears, especially with the price of Apple nowadays. These are hands down the best ear buds I’ve ever owned! They stay perfectly in place through some rigorous working out as well!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Needs more stars!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 2, 2019",
            "id": "amzn1.account.AH365OCYSWDW23H7OBVZCLKFSDMA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH365OCYSWDW23H7OBVZCLKFSDMA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Pre-ordered from Costco day they were available to. Was very excited until I actually received them. Sound quality is average at best and battery life leaves A LOT to be desired. As with most apple products they appear to be designed by a child but was willing to overlook that if functionality was on par with the price. It wasn't so returned 2 days later and bought the top of the line Sony version for about the same price and couldn't be happier! No more apple products for me and will be buying elsewhere from now on...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Way overpriced for quality and looks\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 8, 2020",
            "id": "amzn1.account.AHLPWPW53CLE6FX4PTIRN4MPSECA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHLPWPW53CLE6FX4PTIRN4MPSECA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Item came in apple packaging but when I opened them up I noticed they did not look like AirPods. Then I turned on bluetooth and they said TWS. TWS is a knock off. Someone put knockoffs in apple packaging and was selling for AirPods pro pricing. HORRIBLE!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    SCAM!!!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 28, 2019",
            "id": "amzn1.account.AEVQDOSNXMARHWJXDRV6GKS4ISUQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEVQDOSNXMARHWJXDRV6GKS4ISUQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Bought these for a Christmas present for my wife.  Could not believe it does not come with  a wall plug to fit the other end of the lighting plug.  The end that plugs into the AirPods is a standard lightning plug.  The wall end IS NOT a standard USB plug..  it is a USB C plug???? This apple product does not include the wall plug for this to work.  So we are charging our $299 air pods with our IPhone charger.An Apple gimmick to sell something else that should be included in the initial purchase.  What do people do that do not have another Apple produce to do double duty as a charger.EXTREMELY DISAPPOINTED in Apple.Should spend less on their packaging and include the wall plug with the Air Pods\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Apple get less CHEAP!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 16, 2019",
            "id": "amzn1.account.AEIINLQ4DVSNAHIWRYEM6CDW67PA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEIINLQ4DVSNAHIWRYEM6CDW67PA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    the first gen AirPods sound better than these, save yourself some money\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Sound quality is terrible\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 24, 2019",
            "id": "amzn1.account.AFNUKDQI25LBILR7X6X5R77ZNBWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFNUKDQI25LBILR7X6X5R77ZNBWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have Bose, Sennheiser and Jaybird bluetooth earbuds, all with the wire.  The Senneheiser's have the best sound.They give me trouble saying \"connecting and disconnecting\" to my iphone so I figured I'd buy the Apple product to go with my Apple phone to solve that issue.Pros:It did solve my connection problem I had with other brands.  I also like being able to pop just one earbud in if I'm on a call and overall they are very comfortable.  They aren't super loud so I was having trouble using them to listen to a movie on the airplane.  So, I turned on the noise cancellation and voila, they worked great.  I like the noise cancellation and passthrough features.Cons:The fit just stinks.  They use a proprietary silicone ear piece and the large is not large enough.  They fallout when I exercise.  I don't have this problem with any other earbud.  They need to make more options for a better fit but since the earpiece is proprietary, you have zero options.  The sound quality is just above average but at this price point, it should outstanding.  It's not.  Value for the money...its not quite there.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Nice features, slightly above mediocre sound and a poor fit\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 25, 2019",
            "id": "amzn1.account.AGILIXYC4D2KFSAU6IOTJN7ALFUQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGILIXYC4D2KFSAU6IOTJN7ALFUQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Connectivity issues abound when connected to Android devices and MacBook Pro.  Constant connection issues.  Can't update FW as I don't have an iPhone.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Glitchy, can't update firmware even with my MacBook pro\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 17, 2019",
            "id": "amzn1.account.AFCT6H3GJKVUZORRL5H3IFBKO5BQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFCT6H3GJKVUZORRL5H3IFBKO5BQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Noise cancelling means tight fit - that achieved with soft silicon tips. Even with pressure regulators for equalizing internal and external pressure  the tight fit is uncomfortable, sounds travel through you body and you hear low frequency impact every time you make a step.  I have tried every size silicon tip, but it did not help. Sound quality is not even close to the free set included with iPhone. It useful when you need to make a short call in a room full of people...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    It it a torture to use when walking or jogging, plus the sound quality is mediocre\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 17, 2019",
            "id": "amzn1.account.AEICWTMERJDGKTCPM37TPHVKKKIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEICWTMERJDGKTCPM37TPHVKKKIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Whatever my studio speakers and pro headphones sound, they sound. I have no problems at all so far. They stay in my ears without problem.These sound really good. The highs, mids, and bass are all really defined and don’t blend like on other pricey earbuds/phones. The sound cuts and every instrument can be heard at all times. can’t hear anything at the gym. I enjoyed the music very much!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Sounds better than the others\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 22, 2019",
            "id": "amzn1.account.AHHBITB76NRGAC5LMKX3VSROYAKA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHHBITB76NRGAC5LMKX3VSROYAKA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Compared to the original AirPods, the form factor of the case and the earbuds just look awkward, but the functionality is great.This is the kind of the ugly older brother to the originals that is more powerful.TRANSPARENT MODETo me,the best feature is the “transparent mode” sound. This uses the microphones from the noise cancelling feature to actually pass ambient sound through to your ears while you listen to music or the phone.  It seems like such a small feature, but ultimately, the ability to walk around with full environmental awareness AND music or your phone is pretty awesome. It makes the music presence more like high quality background sound All the time.NOISE CANCELLATIONI put these in when I was on a plane alongside my Bose Noise Canceling headphones. The performance was comparable or possibly even slightly better because these seal your ear. Given the match in performance, I’d rather wear these because it’s easier to sleep.SOFT BUD TIPSThe soft bud tips aren’t magic, they just work the way all other bud manufacturers have been doing for years. “Oooh, but Apple made them white and...“ nope, just soft tips. Move along.CHARGINGCompared to the originals, these function the same. If you have OCD and use your earbuds all day long, you may find they need to go into the case sooner by half an hour or something ... but I’ve seen no real difference in regular “in/out/in/out” daily use.CASEWith a millimeter difference here or there, it’s the same size as the original case, rotated 90 degrees.IPHONE INTEGRATIONSame special proprietary features as the originals, but the icon looks like a pair of confused ducks.OVERALLI wear them every day, leave them in when I’m not using them and consider them a key part of my work life for phone calls and music. Do they constitute a full upgrade to the originals? Not totally, but somewhat.The transparent sound is the main “wow” feature, and the noise cancellation is solid. If the loose feel of the originals bothered you, the new tips solve that. If you don’t care about the cost of buying new ones so soon after getting the originals, these are a worthwhile improvement on the originals and you’ll be happy.If I lost mine, I’d pay for another pair.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    A COMPARISON TO THE ORIGINALS\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 12, 2019",
            "id": "amzn1.account.AHCVIW5QAKJRQ4RILZVORE4HAS2A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHCVIW5QAKJRQ4RILZVORE4HAS2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The Pros are so much better than previous Airpods:-  Fit:  The small pads that come with the Pro fit perfectly and don't budge even when running. The default size of the old Airpods were too big for my ears and they were always falling out.- Comfort: I can wear these for hours and forget they're there. The old Airpods hurt my ears after an hour or so of wear.- Sound quality: Better fidelity all around, especially in noise canceling mode. No comparison to the old Airpods.- Noise canceling: Crazy good - if it's on, don't expect to hear any outside noise at all. Not available with the old Airpods.- Transparency mode: Perfect blend of being able to hear what's going on in the larger environment while still listening to music/calls/audiobooks, etc. comfortably. Easy to switch between transparency and noise canceling. Not available with the old Airpods.- Battery life: Delivers long life as promised, and charges quickly. I was constantly having to use a single earpiece with the old Airpods while the other was charging if I wanted to use them for an extended period.Price is the one major downside. If you can afford the Pros without breaking the bank, I'd say go for it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Pros - so much better\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 12, 2019",
            "id": "amzn1.account.AGPPVSAOGOEH2KNU7LQNDQQ2QC5A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGPPVSAOGOEH2KNU7LQNDQQ2QC5A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I got these as a pre-order on amazon, and when they arrived I instantly began to love them. Now you may think im weird for using these with my google pixel 3, but I have tried samsung gear iconx and jaybirds x3 in the past, and neither were a suitable option for me, despite their good passive noise cancellation. I love the active noise cancellation on these airpods, and it makes tasks such as leave blowing and other loud low tone things much more tolerable.!!!!!ANDROID COMPATABILITY!!!!!!I am amazed at how quick these were to pair with my android phone. This may be a new thing apple has allowed, I dont know, because these are my first pair of airpods. Connection is almost instant, and the airpods pro are always connected by the time I get them in my ears. Also, noise cancellation works and so does ambient mode of course. I have an iphone as well, but it is old. I used this iphone for the sole purpose of doing apple's proprietary fitment test, to see if I should change my eartips. On android hey google works, and I was surprised at how strong the connection signal, sound quality, and ease of use are on these airpods pro. I would highly recommend these airpods, because despite being on android, they are a very seamless experience, and once you hear the surrounding worlt melt away with the nosie cancellation, the steep price should no doubt be justified!!!!!!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    BEST WIRELESS EARBUDS HANDS DOWN EVEN ON ANDROID\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 5, 2019",
            "id": "amzn1.account.AFJ4HVXSIEL3ASBNP4YU2D75GCRQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFJ4HVXSIEL3ASBNP4YU2D75GCRQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    For the size of it, please do not expect stunning sound quality. But functionally perfect as the previous versions.The noise cancellation is not bad. I used it in my office, most talk from others can be ignored.The only complaint is still the battery. Drain fast and two of them do not have equal amount of juice, which means one is always dead before the other and the noise cancellation function needs two pods to work.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Almost perfect\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on October 30, 2019",
            "id": "amzn1.account.AEBRQQRPBOWKNJZGI7H2EF7VQHAA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEBRQQRPBOWKNJZGI7H2EF7VQHAA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    First review yeh heard about these excited but I’d rather get the AirPods 2 for like almost 100 dollars less\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Cool but expensive\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 8, 2019",
            "id": "amzn1.account.AGPF2YHD2UO3KLQEQGRXVDCG26EQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGPF2YHD2UO3KLQEQGRXVDCG26EQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    For background, I am a recreational music producer and have typically used studio monitor setups ranging in price from $400 to over $1000. I have also owned a variety of Bose products including the QC15 noise cancelling headphones and multiple generations of SoundSport earbuds. I listen to at least 2 hrs of music a day. The listening experience on these earbuds vastly exceeds the Bose products I have owned and also rivals my professional grade KRK studio monitors. I will break down my review into a few categories:SIGNAL TO NOISE RATIOThe signal to noise ratio of these earbuds is truly exceptional. I have never heard any headphone or studio monitor with anywhere near as good of a signal to noise ratio. I am hearing details in music that didn't even come through clearly on my KRK studio monitors.NOISE CANCELLINGThe noise cancelling is very good. Better than my Bose QC15s (headphones!) which were the industry standard years ago (granted, I haven't tried recent leaders like the Surface or Bose QC35s because I don't own them). For earbuds, I am impressed at how well they can block out sound.FIT and SEALI have average size ears so I chose the standard \"medium\" ear tips. My right earphone stays planted, but my left earphone slowly slips out over time. I believe this is due to the shape of my ear. They're not the most comfortable earbuds I have used because they have to press against your ear to make a good seal. After about an hour of listening I'm ready to take them out of my ears for a bit.FREQUENCY RESPONSEThe AirPods Pro have a pretty good frequency response. Mids are very clear and highs are sharp but are not piercing which is not easy to do. Bass is surprisingly a little heavy.. And I have a 1500W subwoofer in my car and a 8\" KRK sub connected to my studio monitors. So I'm a bit surprised at how much bass Apple decided to put in these. It's not at the point that it's distracting but I would say it's a little more low end than would be present in monitor grade equipment. For reference I listen to Hip Hop and Electronic music that tends to place a lot in the low end.TRANSPARENCY MODEThe transparency mode uses the microphones to amplify ambient sounds if you want to be more connected with the world around you such as when in an office where you might be approached. It definitely works. It sounds a bit artificial and not quite like real life but it surely helps hear what is happening around you. I would say this is not the setting to use for the best listening experience. Noise cancelling mode really helps engulf you in the music and is my preferred listening mode.CONVENIENCE:Pairing to Apple devices is a breeze. I have a Mac, iPad, and iPhone and it is very quick to switch between them when I need. I have not tested connectivity on other devices, but it should work just fine as a normal bluetooth device for other equipment.OTHERFor some reason I thought these came with an app that would allow EQ modifications but they do not. Luckily the standard tuning is pretty balanced but like I said the low end is a bit inflated.Overall, these earbuds exceeded my expectation for the price point and are worth every penny. I am very happy with these!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Best signal to noise ratio I have ever heard.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 25, 2019",
            "id": "amzn1.account.AFVY466CIP2M4PMFSRHBD54LKWFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFVY466CIP2M4PMFSRHBD54LKWFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    As an owner of the 1st gen and 2nd gen AirPods I can honestly say these are worthy of the upgrade.  The ear tips are much more comfortable than I imagined they would be for extended wearing and also hold them in place.  With older AirPods design they would fit but when moving around and even just talking (moving your jaw) they would wriggle from their set position.  Also, I didn't care for the loud sound pressure transferred to your eardrum when tapping to issue commands either of the older generation units.  These new Pro model buds have a pressure sensor on each bud stem you press/pinch to activate features.  They make little single click/tick sound when pressed. One press for Play/Pause/Answer/Hangup, Two-presses for next track, Three-presses for previous track. So far the best feature is noise cancellation which is fantastic.  Calgon, take me a away. The peacefulness is bliss.  The only nag I have so far is with the shorter stem they can be a little fumbly putting them into and getting them out of the charging case.  I haven't had them long enough to test call-quality (both audio and microphone quality) but will update if anything comes up.  I did make sure the firmware updated to latest version as I've heard others speak of microphone call quality with original/shipping firmware version, so I am interested to see if this new version resolves it.  All in all I can highly recommend them and will come back and either bump rating to 5 stars or keep it at 4Update ~6 month (04/17/2020). Still at 4-stars. All in all a decent upgrade over Gen 2 AirPods and best wireless buds out there I think. Still some software/firmware bugs requiring to put back in case or reset and repairing them to get them working again. Also, microphone voice quality is horrible. On par with gen1 and gen2 AirPods and this is one of the major items I hope Apple targets for the next model(s). Mic noise cancellation is pretty good but voice quality is just lacking. Some would call fidelity of the microphones very compressed and tinny. If you can pick these up for 235+tax they are a decent deal. If they’d get to 199+tax it would be much better.  I still highly recommend them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Definitely an upgrade over 2nd Gen Airpods\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 9, 2020",
            "id": "amzn1.account.AEFAVZFGNFJCMGELIX3F66CZCNHA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEFAVZFGNFJCMGELIX3F66CZCNHA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    UPDATE: These are literally designed to have a short lifespan. There is no way to fully discharge the batteries from both the case and the pods as the pods do not work if the case is dead, although they work without the case if you had already started using them. This is to depreciate the lifespan on the product itself. With lithium ion batteries you need to fully discharge between charges for the best battery life. Seems like Apple has designed these in a manner where you actually can’t do so. Pathetic.I really didn’t have crazy expectations for these but they’ve let me down in every way.-Doesn’t even come with a power block to charge the device, because they make you buy it separately.-Sound quality doesn’t match the price tag as it’s very heavy on the bass and mid range but treble is almost non-existent.-Water exposure rating is extremely poor, which won’t be covered by Apple care if you get these wet or too sweaty and they stop working.-Battery life should be better for the price tag as these do not last as long as advertised.-The case is poorly designed as it’s extremely easy to accidentally push the cap backwards which will break it off.-These are designed to be inoperable if they need maintenance or are malfunctioning as the housing is glued together. If you open them up, you’d never be able to put them back together again.-Since these cannot be repaired, it contributes to our global pollution problem as once you’ve reached your max recharge amount and degraded the battery, there’s nothing to do but throw them away and get new ones.Apple really needs to do better. This is just another example of how badly they’ve let these products slip.-No way to locate the device if it gets lost.-No security functions to keep strangers from making it their own if they find it or steal it.-Have to get a case for the case because it scratches insanely easily. What’s the point of designing something to look sleek when you have to put a bulky case on it?\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Do better Apple.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 15, 2020",
            "id": "amzn1.account.AHD25EEOUWNRVLIHPGOQ6JK3I6OA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHD25EEOUWNRVLIHPGOQ6JK3I6OA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Both the Apple Airpods Pro and the Sony WF-1000XM3 wireless earbuds had very good reviews so I decided to purchase both and see which one worked for me.Sound:I have been in audio engineering for 40 years but honestly sound is a very personal thing. Some people like heavy bass while I prefer a genuine full spectrum experience, as if I were sitting in front of a live orchestra. That said, I suspect the Sony earbuds will make the bass aficionado very happy. In my opinion they lacked a full range experience while the Apple was very refreshing making every instrument stand out, even the softest notes. Both had good quality as far as NO distortion even at max volume. Speaking of volume, the Sony could not achieve the same loudness as the Apple. (I should also point out that I was using an Apple iPad Pro as my source device, not that it \"would or should\" make a difference) The Apple also had better clarity most likely because the Sony bass drowns everything else out making it sound a bit muddy.Comfort:In my opinion the Apple wins this one hands down. The Sony is much heavier and seems to run a bit hot as my ears literally burn when I use them. I can't imagine trying to listen long term with the Sony while the Apple earbuds feel very comfortable for the long haul. They both have different size buds that can be interchanged very easily. The Sony has more options and even has two different materials that might appeal to someone who has skin allergy. The down side of the Apple might be that because they are so light it might be easier to loose them however if one the Apple buds fall out, the sound comes to a halt on both which is very nice. Another thing to point out for the athletic type is that the Apple is sweat resistant where the Sony is not.Function and Control:I hate to keep harping on the Sony but once again it mostly fails in this category. One thing the Sony has that I truly like is the ability to pass through external sounds by simply touching and holding the left bud. This also pauses what you are listening to while you attend to the interruption. Once you release your finger it resumes your music or whatever you are listening to. Unfortunately the Sony tap (touch) control for pausing, advancing and changing sound modes are hit or miss at best. Sometimes it works and sometimes it doesn't making for a very frustrating experience. The Apple has a little microswitch on each bud that consistently works as advertised.  Either left or right bud of the Apple perform the same function while the left and right buds of the Sony have unique functions. The Apple has a seal test that you can run in the app settings to help you get a good fit.UPDATE: After loading the latest firmware the controls are much better for the Sony. No other improvements noted.Carrying Case:On both of these the case function as an integral part of the system. They both have internal batteries that charge the buds while the buds are in the case. The Apple case is a bit smaller and lighter making it the better choice for my pocket. The Apple can also be charged wirelessly or by USB cable where the Sony must use a cable only.  The Sony is more stylish and feels more expensive. I haven't yet tested battery run time but from what I've read, they are both similar.Summary:Overall the Apple is my pick and makes me very happy. I'm sure there are many more options one might consider concerning either of these brands but this is just my experience in a nutshell and I hope it is helpful.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Apple vs Sony\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 14, 2019",
            "id": "amzn1.account.AEOAF5ZABB23LVRK5IJRZDWIIPQQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEOAF5ZABB23LVRK5IJRZDWIIPQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I've been searching for the right earbuds/headphones for the last 5 months, running the gamut from cheap to expensive.  Some of the cheaper buds sounded good, but in order to get good sound, you had to have the perfect seal.  In my case, the seal would be fine until I moved around, then the buds would work their way out of my ears just enough to render the bass response useless. One the ear headphones like the Bose and Sonys sound terrific with good NC, but my ears would get warm.  Cheaper headphones didn't have solid NC and most times felt like my head was in a vice after 30 minutes.Apple has created the perfect listening device.  NC is phenomenal and the sound, while not comparable to big cans is remarkable with solid bass.  The ear fit test is brilliant and works perfectly.  It determined I needed a different tip for my right ear.  And to top it off, these buds are so comfortable (like the regular AirPods), you don't even notice they're in your ears.Yes, they're expensive.  Yes, they'll probably lose their charging ability in 2 years.  But are they worth it?  Absolutely.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Apple Magic\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 4, 2019",
            "id": "amzn1.account.AEKVSM7UDDUT5CSESLDVXWGIASVQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEKVSM7UDDUT5CSESLDVXWGIASVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    If you can rationalize the steep pride tag these will deliver an extremely enjoyable and easy to use form of music listening. Can you get a better deal? probably, but can you get a more slick and fun experience? Probably not.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fantastic improvement over original\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 15, 2019",
            "id": "amzn1.account.AHL3BE3JKTDVMH5T2YM6GUTSHQCA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHL3BE3JKTDVMH5T2YM6GUTSHQCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Kept falling out of ear on treadmill and while cycling.Apple provided different sizes of earbuds and a program that try’s the seal of the different earbuds. The program confirmed that all sizes where a fit, rather odd, as none of them had a good seal.Returned these and purchased the Beats pro. Very happy, fit perfect. Great for exercising. Excellent sound and owned by Apple now so setup was a breeze! They beat the air pods pro hands down...\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Air Pods Semi-Pro\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 2, 2019",
            "id": "amzn1.account.AGA7E33ZWIPR4JWZGP35LYHPXKPA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGA7E33ZWIPR4JWZGP35LYHPXKPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Used for about a week and then found the left bud battery drained overnight. Sent for replacement for about two weeks. Right now I still did not get it back. Do me a favor stay away from this product, the quality is sooooooo bad!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Badddd Quality\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 14, 2019",
            "id": "amzn1.account.AF23L5ZOR3QJRGGFS4NJ5BPDJAMA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF23L5ZOR3QJRGGFS4NJ5BPDJAMA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought these to help block out distracting office noise.  Unfortunately (and ironically), the noise cancelling algorithm on these actually make the distractions worse.  The AirPods Pro removes the white noise that had been masking conversations and abrupt sounds.  With them in, it's actually harder to concentrate.  I truly hope the magicians at Apple can improve the noise cancellation program via firmware update.  It is not in the same league as Bose and Sony at this point.  It is also not as customizable.As far as sound quality goes, I had been scared by other reviewers into thinking these were absolute garbage.  I'm happy to say that's not the case.  They are generally balanced and pleasant to listen to.  The bass is present but not over-accentuated.  The mids and highs are also present but not irritating.  It's close to being good.  There are better options out there, obviously.  My favorite pair of wireless ears is the Bose SoundSport Wireless, which is, by the way, cheaper and more appropriate for working out.  Apple's sound should have a bit more low frequency extension and more customizability.  By the way, having a good tight fit in crucial to achieving proper low-end response on any in-ear headphone.  So if the bass sounds weak to you, try a bigger tip and make sure to push it in snugly!As far as the mic, it's OK.  It sounds about like you'd expect.  Everything else works pretty flawlessly.  The charging case is easy and intuitive.  Putting them in your ears (one or both) is easy and intuitive.  Pairing them was a breeze.  They look pretty good too, if that's important to you.It's a 50/50 toss up now if I return them or not.  I already have better sound in the Bose SoundSport Wireless, and these are not adding the noise cancelling functionality I was hoping for.UPDATE: It may be placebo effect, but I think the most recent firmware update really has helped the noise cancelling feature on these perform better.  They are still not on par with Sony's technology, but it seems better.  You just have to add a little noise from the Coffetivity app or the White Noise app to further drown out the office noise.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Noise cancelling falls far short, making distracting office sounds worse\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 26, 2020",
            "id": "amzn1.account.AG3UKA5L5GA2IJMU2UDDUQWACGFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG3UKA5L5GA2IJMU2UDDUQWACGFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have only had these for 1 day and I am debating whether or not to return them. I have had every generation of the airpods (e.g. Airpods 1 and Airpods 2). Why did I get these? Well, because I lost my previous Airpods and I was intrigued by the anti-sweat claims of this product. However, I am on the fence as to whether to return them because after about 30 minutes of a hard run, the silicon tips kept coming out. Every time I would try to push them back in it was awkward because I was running fast. What's more, each time I tried to readjust the tips and jam them into my canal (imagine me doing this running a 6:30 mile), I kept hitting the button on the stem and stopping/the music. For the last 10 minutes of my run I just threw the airpods into the treadmill cup. I am now trying smaller buds in hopes that they will work. I will say that the noise cancellation and the transparency mode is amazing. The speaker and sound is superb. But that won't mean much if my main use case (running with these on at high speeds and with lots of sweat) doesn't work. I will update this review in a week or so.UPDATE: I am definitely returning these. The first Apple product that I am extremely disappointed in. The left Airpod fell out multiple times during my run yesterday at high intensity. What is more, the Airpod has started emitting a high-pitched squeak/squeal sound. You can do a Google search on this and many users have complained of this. It appears to be related to the noise cancelling feature and there is definitely a design flaw. I'm disappointed and will be going back to the Airpods 2. I really wanted to these to work, but for serious runners, I would look elsewhere.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fell out when running high intensity tempo run\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 13, 2020",
            "id": "amzn1.account.AEXV2JC62VVYR7YNXL7PIIODMYUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEXV2JC62VVYR7YNXL7PIIODMYUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I've ben using these AirPods pro earbuds for 2 weeks now. These are the best of the 5 different pairs of high-end earbuds I own. However, to make them  work for my ears, I upgraded the ear tips to foam.  The included silicone tips kept falling our of my ears, and I tried all 3 sizes.  On Saturday the left ear fell out 3x on my 2 mile walk. So - I found an upgrade offered by an eBay seller that includes foam tips with a clip that replaces the apple silicone tips.The foam works like a charm. Not only do they fit great in my ears, they don't fall out , and fit easily in the original charging case.  The bass and highs are now both cleaner and crisper..  Apple should revisit using foam similar to the comply tips.I'm writing this review after my walk today because the AirPod pros are absolutely sensational with this foam tip upgrade.  I predict, that all the haters would change their minds, if they had a chance to try this for themselves.Other features I like: noise reduction works great, the touch sensitive switches on the earpieces also work perfectly. Charging is quick, and switching between an iPhone and MacBook pro is seamless.  The sheer convience of these AirPod pros is reason enough to use them any Apple products.Apple designers should be proud of this product. I love tech, and these earbuds are the best of the bunch.  Enjoy!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    You gotta get 'em - but you gotta do one thing first...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 6, 2019",
            "id": "amzn1.account.AHWTLG5KNOJOCD4O4XEQ73GPHQWQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHWTLG5KNOJOCD4O4XEQ73GPHQWQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I am very happily pleased with this purchase. I bought these to replace my Sennheiser Momentum True Wireless headphones. The noise cancellation is amazing. It works so well. The supplied ear tips make sure that these stay in my ears and don’t move around. The sound is less bass heavy than the Sennheiser but in a good way. It seamlessly transitions between my Apple devices. Highly recommended.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Highly Recommended\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 5, 2020",
            "id": "amzn1.account.AEXL4FRYILX6S4AKAEURIWTQOPFQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEXL4FRYILX6S4AKAEURIWTQOPFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I really want to love these, but I always go back to using my regular Airpods or Bose QuietComfort.  The primary issue for me is that they do not stay in my ears and I am constantly having to push them back in, which is extremely annoying.  I have tried all the different bud versions, but none of them work for me.I hate having to carry two different differents, but I found the following combination to work the best for me.Normal Use - AirpodsExercise - Airpods w/ Silicone coversAirplane / Noise Cancelling - Bose QuietComfortFor sound quality, Bose continues to lead the pack in my opinion.  Apple should acquire Bose by combining their Bose's silicone ear piece / sound quality with Apple's ease of use.  The combination would be unbeatable in my opinion in the current competitor landscape.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    OK, but not great in my opinion.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 4, 2019",
            "id": "amzn1.account.AEZJTM2X7MLI73YG2ZFINGXQVZTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZJTM2X7MLI73YG2ZFINGXQVZTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I bought these for my girlfriend. Unfortunately, she has smaller ears, so the largeness of the white plastic piece, not the interchangeable silicone pieces, feels uncomfortable after short term usage. Even for me, the largeness of the ear bud starts to feel uncomfortable after an hour or so. They at least stay in when exercising.The noise canceling helps but doesn’t completely block out external noise. You can still hear the subway, people talking, etc. There is a high pitch squeal, like feedback, that occurs when lying your head down on the AirPods Pro. One forum said it’s likely mic feedback from the noise canceling.I also noticed that with an iPhone 6, the AirPods Pro would cut out occasionally. Oddly, it was when I was walking and my hand would hit my phone in my pocket.I probably won’t buy this shape of true wireless headphones when purchasing in the future, unless they are able to reduce the ear bud size or improve its comfort.I do appreciate the compact recharging case, addition of the silicone ear piece, reduced profile of the external control stems, and the control functions and stable communication with my iPad 7 and iPhone 11.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not for tiny ears\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 1, 2020",
            "id": "amzn1.account.AETPNAARPF4CLQXUACZMME34WXZQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AETPNAARPF4CLQXUACZMME34WXZQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    FAKESSSS!!!! I bought mine a couple of months back and upon opening, they looked a bit used (there was black stuff in the crevices of the button on the case and on the airpods themselves) but I decided to give Amazon the benefit of the doubt...WRONG MOVE!!!! I have not given them significant use (I preferred using my regular earbuds because it became more convenient in EVERY sense) but they have been cutting off and now its gotten to the point where the left one completely stopped working. Nothing plays on it. The other one (the right one) sounds subpar. DO NOT WASTE YOUR MONEY GO TO APPLE DIRECTLY!!! I am EXTREMELY disappointed in amazon. I should've listened to the previous reviews saying they weren’t authentic and they arrived used. DO. NOT. BUY!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    DONT BUY FROM AMAZON\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 2, 2020",
            "id": "amzn1.account.AGJA6WYAYQ6SSIP7QXL4EKRMO4CA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGJA6WYAYQ6SSIP7QXL4EKRMO4CA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Double check your airpods. Mine did not come with the Apple plastic wrapping and came with scotch tape and the case and airpods themselves had clearly been used. Had to return them and now I don’t know when I’ll get new ones.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Received Used airpods\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 27, 2019",
            "id": "amzn1.account.AHMWPRP37B4HE6IF436NWVNMUO7Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHMWPRP37B4HE6IF436NWVNMUO7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The noise cancellation works really well.  instead of tapping now you have to squeeze the posts, this is a bit of a pain as you sometimes fumble for the grip and if you hold too long it switches modes.not as comfortable either.  Used them to work out and when you sweat they have a tendency to fall out.  constantly pushing them back into your ears\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    good/bad\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 26, 2020",
            "id": "amzn1.account.AFZX5VTAXXDTQSXHPIC2WY5F42PA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFZX5VTAXXDTQSXHPIC2WY5F42PA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Oh my goodness. These are incredible.1) Background & Comparison:I have had the Bose QC35 headphones for a year, and just purchased the Bose SoundSport Free (after purchasing the AirPods Pro) and love them both, but these AirPods Pro buds are SO lightweight I actually forgot I had left one in my ear at work the other day (no music playing of course). I don’t see a need for wearing my QC35s anymore because they’re heavy and large. After I purchased the AirPods Pro, purchased a pair of Bluetooth Bose Soundsport Free to compare sound and bass. Sound quality is great on the SoundSport Free model but I have issues with the size (even smalls tips hurt my ears) and they are bulky. Sorry, Bose, I really wanted to love your product but the AirPods Pro win for me due to size, ease of use, and comfort.——2) Fit:My ears hurt with a lot of earbuds styles bc I have smaller ears, but the medium sized tips surprisingly fit great. There’s functionality to test the ear tip fit while you have them in your ear - I assume it tests pressure and seal that the tips make in your ear canal. They also don’t fall out and seem completely snug. I did work out in them, but haven’t run or done any kind of strenuous activity with them, but would be interested to see if they stay in while running. So far, I would assume they do based on the secure fit.——3) Noise cancellation & transparency mode:I work in an open office and was completely shocked by the noise cancellation mode. It is AWESOME and really muffled out most (95%?) of the noise. I might wear these at work without playing music just so it’s quiet and I can focus better. Transparency mode is excellent for doing things around the house or wearing on a trail where I need to be cognizant of surroundings, and still want to hear my music.——4) Audio quality:I feel like I don’t need to turn these up as loud as I have had to with other brands. Ear tip fit is great and sound is crystal clear. I wish they had more bass, but I do find the bass quite sufficient. I generally seek out bass in my headphones because of personal preference, and I’m happy with them. I do wish there was an equalizer to be able to adjust the settings for the use, but I’ll leave that to my music apps to do. Sound quality is great and I hope it will save my ears a little bit from not having to turn them up like I have had to with my other earbuds previously.——5) Conclusion:These are amazing. Form and function are great, and most of all, they are lightweight and ease of use is excellent. Highly recommended.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    These are nothing short of incredible.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 22, 2019",
            "id": "amzn1.account.AFRB2LEOY7FZT7DYSEET27LAWKCQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFRB2LEOY7FZT7DYSEET27LAWKCQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Very frustrating to find out that, if I wasn't fully stocked with Apple products that have the right charger cord setup, I have to buy more stuff!  Besides, the packaging designers must be 20 year olds with perfect vision.  The documents are in super fine print and printed in a soft gray that is virtually impossible to see if you are over 50 years old.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Need to buy an adaptor to recharge them & documents are terrible!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 4, 2019",
            "id": "amzn1.account.AGRSUGBI37G77LWJD4QJZKETMMUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGRSUGBI37G77LWJD4QJZKETMMUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    These are hands down better than the OG Airpods. The fit, the sound quality and the bass on these bad boys are no joke.  Apple nailed ANC and transparency mode on these as well. If you're thinking about upgrading I definitely recommend it.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Worth the upgrade\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 12, 2019",
            "id": "amzn1.account.AHKNM6X4FCSUJ3DDXIZCZZNLSOUA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHKNM6X4FCSUJ3DDXIZCZZNLSOUA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Try as I might I could not get these to stay in my ears if I moved past just walking. I tried each of the ear inserts and eventually purchased some hooks that claimed to help keep them in. They didn't work either. Apple needs to do more research into ear types, I guess. BTW my kids each have no difficulty keeping the buds in. Go figure.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Ear attachment does not work for all people\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 5, 2019",
            "id": "amzn1.account.AGGO2XSKNXKLTV5BKBPG7UHRTOVA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGGO2XSKNXKLTV5BKBPG7UHRTOVA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have had/owned and still own many wireless headsets/earbuds.If you're an apple/iOS user, Airpods are a no-brainer.  I didn't love the originals, the battery life wasn't great.  They'd be cooked on a 2 hour conference call before the call was over.  90 mins in you have to pull one pre-emptively and place it in the case to catch a charge then swap.  I figured these would be the same, but they are considerably better.For comparing the original release w/o wireless charging case, if the second gens have a better battery life then this may not apply.  But with the Pro's I can easily stay on a 3+ hour call (sounds fun doesn't it?) w/o having to charge them.The noise-canceling is nowhere near as good as Bose over the ear, maybe not even as good as the Amazon Echo buds.  but it's adequate.  I haven't taken them on a plane yet but they easily cancel out basic background noises.Anyone that tells you they don't hear people sitting next to them or loud traffic is smoking crack.  None really cover-up that type of noise.I will buy these again when I lose one.  That is the biggest downside.  They are slippery but so are the originals.That's all I have to say.  If you're an Apple fan you won't be disappointed.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Love them, not the price.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 14, 2019",
            "id": "amzn1.account.AGHPSVQSGLS7RPFDEW3XVPCEZVIA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGHPSVQSGLS7RPFDEW3XVPCEZVIA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    much needed improvement for odd ear canal people like me. The new pods have rubber tips that lets you customize them for a much better fit. The shorter stems don't interfere with my helmet straps when I am out pedaling on the road ( yes I keep my volume down so i can hear ambient noises for safety)Make sure you have the latest ios installed to take advantage of the airpod proThe airpod 2 with wireless charging has dropped in price but quit drinking lattes for a few days and buy these instead .With the rubber tips they still fall out with very vigorous head shaking but not like before , I don't think any of these will stay in unless you have an over the ear hook but alas a vast improvement.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    noise cancelling switchable on the fly- cyclist this is a better fit no helmet strap issue\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 21, 2019",
            "id": "amzn1.account.AF2PK7NX4IYC7PBZ2X34PUFJRMTQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AF2PK7NX4IYC7PBZ2X34PUFJRMTQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I've been using it for 5 weeks approximately and these airpods suddenly started to make a weird cracking sound. Like if there was connection failure. I paid the extra cash for the noise canceling benefit. It sucks that it's not working like it was designed to.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    The Noise Canceling Bug\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 3, 2019",
            "id": "amzn1.account.AFFMPDFKSS3CUMWDHOA6VKM725YQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFFMPDFKSS3CUMWDHOA6VKM725YQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Where else would they squeeze their margins- they are at the point of cutting quality control which they sorely need. I’m disappointed to open a sealed box from Apple, a luxury brand, to find that the case is wobbling and the earbuds are misaligned where it was glued/bonded with dirt already trapped inside. The sound is improved due to insulation and the noise cancellation is impressive for what they are- small earbuds. However, I expect more for this price point from from an “elite” brand. Apple was once my favorite brand for all things they produce, and now all things have been gradually going down hill. These hit a breaking point where I will be returning them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    No quality control anymore?\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 7, 2019",
            "id": "amzn1.account.AFPWQKTF2COXJL3V3HW55VARFTDQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AFPWQKTF2COXJL3V3HW55VARFTDQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I would absolutely give these Airpod Pros 5 stars if they included the USB C charging block with them,  the noise cancellation feature actually cancelled out low frequency sound waves and they included a volume control ON the actual earbuds.  I'm kind of annoyed that I had to go and purchase a seperate $20 USB C charging block to plug the charging cable into.  These airpods do charge wirelessly in the case but you will eventually need to recharge the case up which is why they include a chaging cord but it is USB C to take note of that.  There is also no volume control on the earbuds. You need to go to your phone which can be inconvenient if jogging or working out with them. They also do not cancel low frequency sound from neighbor's audio equipment but then nothing so far has.  Overall the sound quality is amazing and I love the noise cancellation feature while listening to music at the gym.  It totally turns off all surrounding noise for machines, weights being dropped, etc... I do love them but they could be improved.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    would be 5 stars if...\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 21, 2019",
            "id": "amzn1.account.AEINIH7IBOFAPYS3M33VNCMBWJ3A",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEINIH7IBOFAPYS3M33VNCMBWJ3A/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I had the 2019 air pods and some Bose noise cancelling headphones.  These air pod pros fit in my ear canal well. They don't hurt my ear after a while. The noise cancelling is excellent. I turn them off when somebody needs to talk to me in a loud environment (e.g. Starbucks) by just short holding one of the tips. The difference is noticeable. I like how you can pause and unpause.  The sound quality is really good but not as good as over the ear noise cancelling headphones which I expected. I do wish there was more functionality for phone calls such as mute/unmute and hangup.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Noise cancelling is nice\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 30, 2019",
            "id": "amzn1.account.AE6MWHRIKDRQS56VLXDWDNPADAJQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AE6MWHRIKDRQS56VLXDWDNPADAJQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n     Ambos lados puedes usarlos diferentes opciones, por ejemplo: el auricular derecho puedes hacer para llamar a SIRI, y en el auricular izquierdo puedes activar la cancelacion de ruido. O viceversa.. lo unico que le falto fue un control de volumen.. infelizmente solo puedes subir y bajar el volumen desde tu celular.. resto esta muy bueno..\n  \n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n    Esta muy bueno, solo falto el control del volumen en el auricular\n  \n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on April 17, 2020",
            "id": "amzn1.account.AEZQC3SPZ4QBOTJIT66J6BTY5X3Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEZQC3SPZ4QBOTJIT66J6BTY5X3Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    So, I got a pair the day after they were released for the first time. When I put them on the noise cancelation felt magical. Unfortunately my dog chewed them up two weeks later. Fast forward to last week, when I finally bit the bullet and spent the crazy amount of money on a new pair. For some reason they just didn’t sound the same. A few days ago, I finally came across an article talking about the firmware updates. Apparently, This is something that happens automatically and Apple really botched it. It’s completely destroyed the noice cancelling capabilities and once it is updated it can’t go back. I’ve lost all trust in Apple for keeping this quiet and refusing to rectify the situation or address it in any way.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY. Apple botched firmware updates and it ruined noise cancellation!!! It can’t be fixed!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 14, 2019",
            "id": "amzn1.account.AEE3UAMRIIOXD6QGERVGM774WTBA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AEE3UAMRIIOXD6QGERVGM774WTBA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 2,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Not worth the money.  Very disappointed in the noise cancellation.  I’ve worn these on a plane and they only cancel out about 60% of the engine noise.  I occasionally work in a large data center where there’s a consistent equipment hum of about 84 decibels, and I estimate that these are only blocking out about 75% of the noise.  The noise cancellation software needs some serious updating.  The sound transparency mode is pretty good so that you can hear people talking and sounds around you.  There’s just a slight filtering of the sound, so it’s not completely transparent.  Good enough to leave the EarPods in and still hear what’s going on around you.The BIG downside to these are that the EASILY fall out!!  I’ve tried the different sized ear tips, and ran the Air Pods Pro sound/noise cancellation tests and I’m using the correct size tips.  On a plane, I nodded off for a bit and woke up to a missing AirPod.  I had to wait until the plane landed and everyone got off to search for the AirPod.  It rolled a few rows back winding up under a seat with a bunch of garbage and dirt.  On a return trip, I put them in, and within 5 minutes, one fell out again.  Forget about moving around with them in, as they will definitely fall out.  If you bend over, they fall out.  You will find yourself constantly pushing them in to avoid losing them.  I had to buy a silicone strap to keep the two attached to each other so the don’t venture off.  The use of the strap is ridiculous, and shouldn’t be necessary, but I don’t feel like buying a replacement AirPod and wasting more money.The battery charge lasts at least five hours, and charges quite quickly in the included charging case.Overall, save yourself about $200 and spend $50 on a decent pair of wired ear buds, which will have the same audio quality.  A very disappointing purchase!!\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Fall out EASILY!  Noise cancellation isn’t great.  Waste of money.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 22, 2020",
            "id": "amzn1.account.AGI2EXU5RN43KKQRCLEQXKZUO32Q",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AGI2EXU5RN43KKQRCLEQXKZUO32Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 1,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Sounds quality is maybe on par with the regular AirPods. The sub-bass is non-existent and the low-end in general is absolutely anemic. The Noise Cancellation was pretty good until they updated it and made it almost useless. You can still hear almost everything when ANC is activated now, it had no problem drowning out car noises on the first firmware. Why Apple would willingly choose to nerf their product and not release an update to fix it almost a month later shows that these are absolutely not ready for market. If you want to waste $250 to be a market tester for some not-so-great sounding headphones, this is for you. Everyone else just avoid them and stick to the standards or another brand altogether like the Sony WF-1000XM3's for better sound and Noise Cancellation\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Not very good, not worth even close to $250\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 24, 2019",
            "id": "amzn1.account.AG5E4UHZ3B2GJK3AWS4YQVQMOIAQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AG5E4UHZ3B2GJK3AWS4YQVQMOIAQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Honestly, I was a little bit spectacle about purchasing this AirPods, because I know the original ones are just like the wired Apple earphones, where you can hear the sounds from outside and I did not want to spend 100$+ for earphones that can hear outside! Smh So I did my research diligently (for weeks). Finally decided to purchase the AirPods pros for my birthday especially because I love Apple and after my LG TONE Pro HBS-770 broke down within 10 months smh, never buying again.I am a huge audiophile and especially when it comes to picture and sound; I look for the best. I tested both LG and AirPod Pro and the Pros comes in first because it does block out any noise from the outside - I would say mostly 80%. I also hear that it adapts to the sound to actively block out any noise outside especially when I shop: I can’t hear my footsteps, the people around, the car on the streets. It’s amazing! Plus I can leave them in my ear and they are so comfortable, especially when I’m on the treadmill they stick like glue! Plus it helps with the sweat resistant feature the AirPods provide! Sometimes I forget they are in my ear lol also the transparency mode works well so I don’t have to remove my earphones (but seriously I’m listening to music why are you talking to me) lolI also love switching between Noise cancellation and transparency modes. Golden. Even when the modes for Off, the sound is still particularly good.My recommendation is that if you are or not an audiophile and you want to purchase AirPods, go for the AirPod Pros. You won’t be disappointed. 249$ it can be high, but it’s money well spent. It’s better to spend a little more or a lot more to get what you want versus spending 100$ less and you aren’t satisfied.... life is too short! Enjoy while you can :D Plus 249$, I mean... we spent 249$ on anything else :P\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Amazing! My favourite wireless earphones!\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 5, 2019",
            "id": "amzn1.account.AHBQSX2GKUQ34ZTEFRA66XX323PQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHBQSX2GKUQ34ZTEFRA66XX323PQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 3,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The noise cancellation isn't the greatest. Of course, our expectations for the noise cancellation won't be similar to Sony's  wh-1000xm3 be we should expect it to be pretty decent right? It's not. People have had concerns about the if listeners would hear a car or train coming up behind them but listeners have nothing to fear. In a relatively quiet room, the noise cancellation sounds great. Any fans, AC noise, etc is canceled out. However, once you start going about your day, outside noises can still be heard while having the volume 2/3 of the way up.Now that is assuming that the pros are able to stay in your ear. I tend to smile a lot throughout my day and sadly when I do, the airpods slip out. I tried both the medium and the small buds to see if my problem would be fixed. It wasn't.Compared to the gen 2 airpods, the pros have great additions. The noise cancellation and the replacement of the buttons used in previous generations are great. However, the pros do lack when it comes to fit, noise cancellation, and price. Additionally, they are not the prettiest. The short neck looks awkward and out of place.I recommend that you try before you buy. Go to an Apple store and ask one of the representatives if you can try on the pros before you buy them. Also, ask them to clean them beforehand. Perform a variety of head movements (depending on how confident you are in public you can try headbanging, head shaking, running in place, etc etc) to make sure that they fit properly. Finally, make sure you smile while you wear them.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Eh. not worth $270\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on January 13, 2020",
            "id": "amzn1.account.AHDANARAVQLHGW3NLTYWMU7AIIOA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHDANARAVQLHGW3NLTYWMU7AIIOA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 4,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    Hello so I’m coming from air pods 2. I guess sweat got into it or light rain got into but I had to sell those because they started to mess up on me..Apple doesn’t say they are sweat proof or any IP rating so I guess that’s my fault. The fit was perfect they never feel off and I loved them.Now I’ve tried a lot of different types but they would all fall off true wireless ones. I said the hell wit them and I went for air pods pro because of familiarity and IP rating.Pros:Secure fit (didn’t fall off my ears while running).Sweat proof.Noise cancellation (didn’t hear cars next to me).Phone calls.Lightweight.Shorter stem.transparency mode.Replaceable silicone tips.Cons:This is more my problem my left ear felt “heavier” Not a perfect fit but for some reason my right ear was perfect.Battery. Could be better.Earbud is bigger than airpods 2.I will come back and update my review as I get more familiar with air pods pro as I go on runs more. That’s if I find anything I must let you guys know about.Thank you.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    20-25mile per week runner. Air Pods Pro review.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on December 16, 2019",
            "id": "amzn1.account.AH6ZI2QZEKQKSCC4ZMRB26IB6HWA",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AH6ZI2QZEKQKSCC4ZMRB26IB6HWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    The reviews are right on target...these ear pods are quite remarkable!  The technology that went into creating very good sound quality, good comfort and very easy and flexible setup is amazing. Normally I haven’t been comfortable wearing and of the EarPods Apple have sent me with iPhones in the past. An hour at best and I was happy to remove them. These I can wear and have worn for three hours with no need to remove them.Sound wise they aren’t going to make me throw away my Bose Quiet Comfort headphones or even my pair of ten year old Sony Open Ear headphones. But the sound is perfect for background listening of classical orchestra and piano. I love them in the background while reading, doing desk work and even taking my daily hour long outdoor walk. I mostly use transparency mode especially when walking outdoors where safety is a factor. And indoors I don’t need noise quieting.A big advantage with these  Ear Buds is the freedom of movement and long playing time. My main music source is an Apple 11 Pro iPhone and an app I found online with streaming classical music. I also have a number of downloaded music from my Amazon Prime and use this outdoors where I have no internet.All in all...five stars. My only concern is expected lifetime (two years...maybe?). And I wish they were flesh colored not Polar White.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    Well deserved FIVE Stars.\n  \n"
        },
        {
            "author": "Not found",
            "date": "Reviewed in the United States on November 30, 2019",
            "id": "amzn1.account.AHUILFWVOTDOB2Y27UABXS7GJVLQ",
            "link": "https://www.amazon.com/gp/profile/amzn1.account.AHUILFWVOTDOB2Y27UABXS7GJVLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8",
            "rating": 5,
            "text": "\n\n\n\n\n\n\n\n  \n  \n    I have been avoiding the Apple AirPods since when I tried them I couldn't keep them in my ear and they constantly fall out.  The original AirPods did not have the ear piece that the Pro comes with.  The original was annoying with meh sound quality and no noise cancellation feature.The AirPods Pro are definitely different.  I don't have any problem keeping them in my ear as I walk and the sounds quality is so crisp on both sides I have not had any bluetooth device work so well like these.  However, they do get a bit of getting used to since there's no actual buttons or anything to push on the AirPods.  But get used to the following is not that hard: Using two fingers, squeeze the flat side on each AirPod. You'll hear a click in your ear with each press.Single-press: Pause/playDouble-press: Skip forwardTriple-press: Skip backwardLong-press: Switch between noise cancellation and transparency mode.Another cool feature that's included allows the user to check which ear tip is better to use for you by allowing the software check the quality of the sound.  To run the test, open the Settings app on your iPhone, select Bluetooth and tap on the \"i\" next to the name of your AirPods Pro. Select Ear Tip Fit Test, and then follow the prompts.I ordered a second pair for my better half.\n  \n",
            "title": "\n\n\n\n\n\n\n\n  \n  \n    These actually work\n  \n"
        }
    ]
}